// Copyright 2025 [Fyisvia Virell]
// This program is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// any later version.
// See the LICENSE file in the project root for full license information.

const img = n => `/mahjongfiles/${n}.png`
const m = n => img(`${n}m`)
const p = n => img(`${n}p`)
const s = n => img(`${n}s`)
const z = n => img(`${n}z`)
const z0 = img('-1')
const ph = img('ph')

const m0 = m(0), m1 = m(1), m2 = m(2), m3 = m(3), m4 = m(4), m5 = m(5), m6 = m(6), m7 = m(7), m8 = m(8), m9 = m(9)
const p0 = p(0), p1 = p(1), p2 = p(2), p3 = p(3), p4 = p(4), p5 = p(5), p6 = p(6), p7 = p(7), p8 = p(8), p9 = p(9)
const s0 = s(0), s1 = s(1), s2 = s(2), s3 = s(3), s4 = s(4), s5 = s(5), s6 = s(6), s7 = s(7), s8 = s(8), s9 = s(9)
const z1 = z(1), z2 = z(2), z3 = z(3), z4 = z(4), z5 = z(5), z6 = z(6), z7 = z(7)

export const articles = [
  {
    id: 1,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [p6, p7, p7, p8, s1, s1, s2, s2, s3, s4, s5, z7, z7, p0],
    answerImg: s2,
    explanation: [
      '这', '里', '要', '考', '虑', z7, z7, '对', '碰', '听', '牌', '的', '形', '状', '。',
      '虽', '然', '切', s1, '和', s2, '的', '进', '张', '枚', '数', '相', '同', '，',
      '但', '是', '在', '对', '碰', '听', '牌', '时', s1, s1, '、', z7, z7, '的', '对', '碰',
      '优', '于', s2, s2, '、', z7, z7, '的', '对', '碰', '，',
      '所', '以', '这', '里', '优', '先', '切', s2, '。'
    ]
  },
  {
    id: 2,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [p6, p7, p7, p8, s1, s1, s2, s2, s3, s4, s5, z7, z7, p6],
    answerImg: s5,
    explanation: [
      '从', '进', '张', '数', '考', '虑', '，',
      '切', s5, '比', '切', s2, '少', '一', '枚', '进', '张', '，',
      '但', '这', '里', '七', '对', '一', '向', '听', '，',
      '且', '有', '两', '杯', '口', '的', '可', '能', '，',
      '要', '切', s5, '保', '留', '七', '对', '的', '听', '牌', '机', '会', '。'
    ]
  },
  {
    id: 3,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [p6, p7, p7, p8, s1, s1, s2, s2, s3, s4, s5, z7, z7, p7],
    answerImg: p8,
    explanation: [
      '对', '子', '数', '量', '过', '多', '，', p6, p7, p7, p7, p8, '只', '需', '形', '成', '一', '搭', '牌', '即', '可', '。',
      '保', '留', p7, p7, p7, '则', '可', '以', '狙', '击', '三', '暗', '刻', '，',
      '同', '时', '切', p8, '来', '保', '留', p0, '的', '进', '张', '可', '能', '，',
      '重', '视', '手', '牌', '的', '防', '御', '性', '时', '则', '先', '切', p6, '。'
    ]
  },
  {
    id: 4,
    round: '东 1 局  东家   6 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m2, m3, m8, m8, p4, p5, p5, p6, p7, p9, s5, s5, s6, m1],
    answerImg: s5,
    explanation: [
      '饼', '子', '侧', '是', '有', p3, '、', p6, '、', p8, '三', '种', '进', '张', '的', 'DNA', '型', '，',
      '切', s5, '可', '以', '确', '定', '索', '子', '侧', '的', '两', '面', '好', '型', '，',
      '同', '时', '还', '能', '在', '听', '牌', '时', '确', '定', '平', '和', '。'
    ]
  },
  {
    id: 5,
    round: '东 1 局  东家   6 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m2, m3, m8, m8, p4, p5, p5, p6, p7, p9, s5, s5, s6, m4],
    answerImg: p9,
    explanation: [
      '虽', '然', '饼', '子', '侧', '是', '有', p3, '、', p6, '、', p8, '三', '种', '进', '张', '的', 'DNA', '型', '，',
      '但', '是', '比', '起', '平', '和', '，', '断', '幺', '可', '以', '副', '露', '，', '更', '加', '灵', '活', '。',
      '所', '以', '不', '应', '该', '确', '定', '平', '和', '，', '而', '是', '应', '该', '断', '幺', '。',
      '并', '且', '留', '下', s5, s5, '还', '可', '以', '狙', '击', s0, '。'
    ]
  },
  {
    id: 6,
    round: '东 1 局  东家   8 巡目',
    images1: [z0, z0, p2, z0, z0, z0, z0],
    images2: [m3, m3, m4, m5, m5, p6, p6, p8, s3, s4, s6, s6, s7, s5],
    answerImg: p8,
    explanation: [
      '切', p8, '则', '放', '弃', '了', p7, '的', '进', '张', '，',
      '切', s6, '确', '定', p6, '为', '雀', '头', '也', '放', '弃', '了', p7, '进', '张', '，',
      '并', '且', '损', '失', '了', p6, '、', s6, '的', '进', '张', '，',
      '所', '以', '切', p8, '的', '进', '张', '数', '大', '于', s6, '。',
      '切', s6, '的', '好', '处', '在', '于', '摸', '进', p7, '之', '后', '切', p6, '会', '变', '成', '无', '雀', '头', '型', '，',
      '一', '向', '听', '的', '枚', '数', '很', '高', '，',
      '但', '是', '自', '亲', '8', '巡', '的', '巡', '目', '下', '还', '是', '期', '望', '更', '快', '听', '牌', '，',
      '而', '不', '是', '一', '向', '听', '的', '改', '良', '（', '只', '有', p7, '）', '，',
      '所', '以', '这', '里', '切', p8, '。'
    ]
  },
  {
    id: 7,
    round: '东 1 局  东家   6 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m4, m4, m0, p1, p3, p4, p5, p5, p6, s3, s4, s7, s8, m6],
    answerImg: p1,
    explanation: [
      '好', '型', '两', '向', '没', '有', '雀', '头', '。',
      '切', p1, '损', '失', '摸', p1, '形', '成', p1, p1, '雀', '头', '的', '进', '张', '。',
      '切', m4, '损', '失', '摸', m4, '、', m7, '形', '成', m4, m4, '雀', '头', '的', '进', '张', '。',
      '切', p5, '损', '失', '摸', p4, '、', p7, '形', '成', '顺', '子', '和', '摸', p5, '形', '成', p5, p5, '雀', '头', '的', '进', '张', '。',
      '所', '以', '切', p1, '进', '张', '面', '最', '广', '（', '不', '损', p2, '的', '原', '因', '在', '于', '摸', '进', p2, '可', '以', '切', p6, '从', '而', '确', '定', p5, p5, '雀', '头', '）。'
    ]
  },
  {
    id: 8,
    round: '东 1 局  东家   6 巡目',
    images1: [z0, z0, s9, z0, z0, z0, z0],
    images2: [m1, m3, m5, p1, p1, p2, p4, p0, p6, p6, p7, s7, s8, s9],
    answerImg: p2,
    explanation: [
      '考', '虑', '最', '终', '听', '牌', '型', '，',
      '听', '在', '饼', '子', '侧', '（', '切', p2, '）', '为', '两', '面', '好', '型', '听', '牌', '，', '且', '有', '平', '和', '。',
      '听', '在', '万', '子', '侧', '（', '切', m5, '）', '为', '骗', m2, '的', '坎', '张', '听', '牌', '。',
      '保', '留', m1, m3, m5, '两', '坎', '型', '，', '能', '最', '大', '程', '度', '听', '牌', '到', '饼', '子', '侧', '。',
      '所', '以', '切', p2, '。'
    ]
  },
  {
    id: 9,
    round: '东 1 局  南家   6 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m1, m3, m5, p1, p2, p3, p9, p9, s1, s2, s3, s6, s6, s7],
    answerImg: m5,
    explanation: [
      '切', m5, '可', '以', '确', '定', m1, m2, m3, '的', '三', '色', '，',
      '切', s6, '的', '平', '和', '可', '能', '性', '更', '高', '，',
      '但', '是', '这', '里', '推', '荐', '切', m5, '来', '固', '定', '更', '高', '打', '点', '的', '三', '色', '。',
      '并', '且', '切', m5, '还', '可', '以', '骗', '筋', '，', '可', '以', '副', '露', '，', '相', '对', '来', '说', '更', '加', '灵', '活', '。'
    ]
  },
  {
    id: 10,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, m1, z0, z0, z0, z0],
    images2: [m4, m6, m9, m9, p1, p1, p3, p3, s3, s4, s5, s6, s7, m0],
    answerImg: p3,
    explanation: [
      '考', '虑', '最', '终', '听', '牌', '型', '，', '听', '到', '索', '子', '侧', '是', '最', '优', '的', '。',
      '但', '是', '如', '果', '索', '子', '侧', '先', '进', '张', '，', m9, m9, '，', p1, p1, '的', '对', '碰', '听', '牌', '强', '于', m9, m9, '，', p3, p3, '的', '对', '碰', '听', '牌', '，',
      '虽', '然', '保', '留', p3, p3, '有', '机', '会', '进', p4, '形', '成', '完', '全', '一', '向', '听', '，',
      '但', '是', '索', '子', '先', '成', '为', '面', '子', '的', '可', '能', '性', '更', '大', '，',
      '重', '视', '最', '终', '听', '牌', '型', '所', '以', '切', p3, '。'
    ]
  },
  {
    id: 11,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, s8, z0, z0, z0, z0],
    images2: [m1, m2, m3, m4, p5, p6, p7, p8, s1, s2, s2, s2, s3, s3],
    answerImg: m1,
    explanation: [
      '考', '虑', '最', '终', '听', '牌', '型', '和', '打', '点', '，',
      '切', s1, '时', '为', '立', '直', 'nomi', '或', '者', '立', '直', '断', '幺', '，',
      '切', s3, '时', '为', '立', '直', 'nomi', '或', '者', '立', '直', '平', '和', '，',
      '切', m1, '时', '为', '立', '直', '断', '幺', '或', '者', '立', '直', '平', '和', '并', '且', '有', '机', '会', '一', '杯', '口', '，',
      '切', p8, '时', '为', '立', '直', 'nomi', '或', '者', '立', '直', '平', '和', '。',
      '所', '以', '这', '里', '切', m1, '。'
    ]
  },
  {
    id: 12,
    round: '东 1 局  东家   5 巡目',
    images1: [z0, z0, p6, z0, z0, z0, z0],
    images2: [m5, m5, m7, m8, p3, p4, p6, p7, s2, s4, s6, s6, s8, m6],
    answerImg: s2,
    explanation: [
      '六', '个', '搭', '子', '，', '所', '以', '考', '虑', '拆', '一', '搭', '。',
      '有', '678', '三', '色', '，', '所', '以', '不', '切', s8, '。',
      '考', '虑', '万', '子', '侧', '的', '延', '伸', '，', s6, s6, '是', '候', '补', '雀', '头', '，', '所', '以', '不', '切', s6, '。',
      '饼', '子', '侧', p5, '虽', '然', '是', '二', '度', '受', '，', '但', '容', '易', '形', '成', '好', '型', '听', '牌', '，',
      '应', '该', '拆', '掉', '更', '差', '的', '坎', '张', '。',
      '所', '以', '这', '里', '综', '合', '考', '虑', '应', '该', '切', s2, '。'
    ]
  },
  {
    id: 13,
    round: '东 1 局  西家   4 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m6, m7, m8, p1, p2, p3, p3, p0, s1, s2, s3, s7, s8, p6],
    answerImg: p2,
    explanation: [
      '切', p3, '固', '定', '面', '子', '进', '张', '面', '最', '广', '，', '并', '且', '摸', '进', p6, '会', '舍', '弃', p0, '。',
      '切', p6, '不', '一', '定', '能', '留', '住', p0, '。',
      '而', '固', '定', p3, p3, '雀', '头', '可', '以', '确', '定', '好', '型', '听', '牌', '，', '并', '且', '能', '保', '留', p0, '。',
      'p1', '、', 'p2', '全', '舍', '的', '情', '况', '，', '先', '切', '相', '对', '更', '危', '险', '的', p2, '。'
    ]
  },
  {
    id: 14,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, m8, z0, z0, z0, z0],
    images2: [m2, m4, m8, m9, p6, p6, p6, p7, s3, s4, s7, s8, s9, m3],
    answerImg: m8,
    explanation: [
      '无', '雀', '头', '，', '要', '保', '留', p6, p6, p6, p7, '，', '拆', '掉', '最', '弱', '的', m8, m9, '搭', '子', '。',
      '宝', '牌', '是', m9, '，', '所', '以', '先', '切', m8, '，', '狙', '击', '宝', '牌', '雀', '头', '。'
    ]
  },
  {
    id: 15,
    round: '东 1 局  东家   6 巡目',
    images1: [z0, z0, m6, z0, z0, z0, z0],
    images2: [m2, m2, m0, p3, p4, p6, p6, s2, s2, s5, s6, s7, s8, m7],
    answerImg: s8,
    explanation: [
      '面', '子', '对', '子', '都', '超', '载', '，', '索', '子', '侧', '有', '延', '申', '，', '一', '般', '来', '说', '可', '以', '保', '留', '4', '连', '型', '等', '改', '良', '。',
      '但', '是', '由', '于', m0, '的', '存', '在', '，', '不', '太', '考', '虑', '放', '弃', m0, m7, '，',
      '并', '且', '索', '子', '侧', '的', '延', '申', '可', '能', '会', '失', '去', '断', '幺', '。',
      '所', '以', '不', '如', '直', '接', '切', s5, '或', s8, '确', '定', '断', '幺', '，',
      '而', '保', '留', s5, '有', '机', '会', '形', '成', s5, s6, s7, '的', '三', '色', '，', '所', '以', '切', s8, '。'
    ]
  },
  {
    id: 16,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, p2, z0, z0, z0, z0],
    images2: [m1, m3, m4, m5, m5, m6, p6, p7, s3, s0, s7, s8, s8, s9],
    answerImg: m1,
    explanation: [
      '切', m1, '或', s8, '由', '于', '没', '有', '固', '定', '雀', '头', '，', '进', '张', '枚', '数', '较', '多', '。',
      '这', '里', '切', m1, '之', '后', '摸', '进', m2, '完', '成', m5, m5, '雀', '头', '，', '向', '听', '数', '前', '进', '，', '所', '以', '不', '损', m2, '进', '张', '。',
      '切', s9, '固', '定', '雀', '头', '损', '失', '的', '进', '张', '过', '多', '，',
      '所', '以', '这', '里', '切', m1, '。'
    ]
  },
  {
    id: 17,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, p9, z0, z0, z0, z0],
    images2: [m1, m3, m5, m7, m8, m8, m9, p0, p6, p7, s5, s5, s6, m2],
    answerImg: m8,
    explanation: [
      '可', '以', '看', '成', m5, '，', m8, '，', s6, '的', '搭', '张', '一', '向', '听', '，',
      '其', '中', m8, '的', '搭', '张', '能', '力', '最', '弱', '，', '所', '以', '切', m8, '。',
      '摸', '进', m4, '，', m6, '还', '有', '一', '气', '的', '机', '会', '。'
    ]
  },
  {
    id: 18,
    round: '东 1 局  东家   5 巡目',
    images1: [z0, z0, m3, z0, z0, z0, z0],
    images2: [p2, p2, p3, p3, p5, p5, p6, p6, p8, s5, s6, s6, s7, p7],
    answerImg: p8,
    explanation: [
      '5', '个', '对', '子', '，', '七', '对', '一', '向', '听', '，',
      '切', p8, '可', '以', '保', '留', '面', '子', '手', '的', '一', '向', '听', '和', '七', '对', '的', '一', '向', '听', '，',
      '而', '且', '保', '留', '了', s5, s6, s6, s7, '形', '成', '两', '个', '面', '子', '的', '可', '能', '。'
    ]
  },
  {
    id: 19,
    round: '东 1 局  东家   8 巡目',
    images1: [z0, z0, m3, z0, z0, z0, z0],
    images2: [m4, m5, m5, m6, m6, m6, p3, p4, p4, p5, p6, p7, p7, p4],
    answerImg: p7,
    explanation: [
      '万', '子', '侧', '摸', '进', m3, m4, m5, m6, m7, '都', '可', '以', '完', '成', '两', '个', '面', '子', '，',
      '而', '饼', '子', '侧', p4, p7, '的', '筋', '张', '重', '复', '，', '所', '以', '切', p7, '。',
      '仔', '细', '分', '析', '进', '张', '，', '切', p7, '如', '果', '摸', '进', m2, '或', p1, '只', '能', '坎', '张', '听', '牌', '，',
      '如', '果', '注', '重', '听', '牌', '形', '状', '的', '话', '，', '切', m6, '也', '是', '一', '个', '好', '选', '择', '，',
      '还', '有', '一', '杯', '口', '的', '机', '会', '。'
    ]
  },
  {
    id: 20,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, s3, z0, z0, z0, z0],
    images2: [m4, m5, p6, p8, p9, p9, s1, s1, s2, s3, s4, s6, s7, p7],
    answerImg: p9,
    explanation: [
      '切', '掉', '一', '个', '对', '子', '可', '以', '确', '定', '平', '和', '，',
      '这', '里', '要', '保', '留', s1, s1, '的', '雀', '头', '，',
      '在', '摸', '进', '宝', '牌', '时', '再', '切', '出', '，', '从', '而', '形', '成', '宝', '牌', '雀', '头', '，',
      '所', '以', '这', '里', '切', p9, '。'
    ]
  },
  {
    id: 21,
    round: '东 1 局  东家   9 巡目',
    images1: [z0, z0, z4, z0, z0, z0, z0],
    images2: [m3, m4, m4, p3, p3, p4, p5, p6, p7, s5, s5, z1, z1, p4],
    answerImg: p7,
    explanation: [
      '面', '子', '手', '两', '向', '听', '，', '七', '对', '一', '向', '听', '。',
      '但', '考', '虑', '面', '子', '手', '，', '切', m3, '损', '失', m2, m5, '进', '张', '，',
      '切', p7, '只', '损', '失', p8, '进', '张', '，',
      '所', '以', '面', '子', '手', '方', '向', '切', p7, '损', '失', '进', '张', '最', '少', '，', '优', '于', m3, '。'
    ]
  },
  {
  id: 22,
    round: '东 1 局  东家   3 巡目',
    images1: [z0, z0, m1, z0, z0, z0, z0],
    images2: [m1, m2, m3, m7, p2, p2, p8, s3, s3, s4, s5, s7, s9, s9],
    answerImg: p8,
    explanation: [
      '面', '子', '候', '补', '不', '足', '，', '浮', '牌', '有', m7, '和', p8, '。',
      '考', '虑', '浮', '牌', '生', '成', '面', '子', '的', '能', '力', '，', '其', '中', p8, '弱', '于', m7, '，',
      '所', '以', p8, '是', '正', '解', '。'
    ]
  },
  {
  id: 23,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, s1, z0, z0, z0, z0],
    images2: [m3, m4, m0, m7, m7, p3, p4, p5, p6, s5, s5, s5, s7, m6],
    answerImg: s7,
    explanation: [
      '自', '亲', '宝', '牌', '一', '枚', '，', '三', '色', '不', '确', '，', '考', '虑', '进', '张', '数', '最', '大', '化', '切', s7, '。',
      '切', m7, '损', '失', '摸', m2, p2, p7, '的', '三', '面', '听', '，', '和', '摸', m7, '的', '五', '面', '听', '。',
      '切', s7, '只', '损', '失', '摸', s6, s7, '的', '三', '面', '听', '，',
      '切', s7, '多', '面', '听', '的', '概', '率', '也', '是', '最', '高', '的', '。'
    ]
  },
  {
  id: 24,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, s3, z0, z0, z0, z0],
    images2: [m3, m4, m6, m6, p4, p4, p5, p8, p9, s1, s3, z7, z7, m0],
    answerImg: p8,
    explanation: [
      '六', '搭', '拆', '一', '搭', '，', '没', '有', '浮', '牌', '。',
      '拆', '掉', '最', '弱', '的', '搭', '子', p8, p9, '，',
      '考', '虑', '到', '危', '险', '度', '，', '所', '以', '从', '内', '侧', '的', p8, '打', '起', '。'
    ]
  },
  {
  id: 25,
    round: '东 1 局  北家   7 巡目',
    images1: [z0, z0, p2, z0, z0, z0, z0],
    images2: [m2, m3, m4, p1, p1, p3, p3, p3, p4, p4, p5, s7, s7, s8],
    answerImg: s7,
    explanation: [
      '饼', '子', p3, p3, p3, p4, p4, p5, '复', '合', '型', '有', p2, p3, p4, p5, p6, '的', '进', '张', '，',
      '切', s7, '固', '定', '索', '子', '的', '两', '面', '，', '保', '留', '饼', '子', '侧', '的', '复', '合', '型', '进', '张', '，',
      '进', '张', '数', '是', '最', '多', '的', '，',
      '虽', '然', '摸', '到', p2, p5, '要', '切', '掉', '宝', '牌', p3, '，', '但', '是', '打', '点', '已', '经', '足', '够', '了', '。'
    ]
  },
  {
  id: 26,
    round: '东 1 局  东家   6 巡目',
    images1: [z0, z0, s2, z0, z0, z0, z0],
    images2: [m5, m5, m6, p6, p7, s3, s4, s5, s5, s6, s6, z2, z2, p8],
    answerImg: m5,
    explanation: [
      '想', '着', '摸', '红', m5, '听', '牌', '而', '打', s6, '的', '话', '，', '摸', '进', s3, '很', '难', '处', '理', '。',
      '打', m5, '之', '后', '摸', '到', '宝', '牌', '就', '可', '以', '拆', '掉', '南', '的', '对', '子', '，',
      '顺', '畅', '地', '转', '为', '断', '幺', '。'
    ]
  },
  {
  id: 27,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m3, m0, m5, m6, m7, m7, m7, p3, p4, p5, s5, s6, s6, m8],
    answerImg: s6,
    explanation: [
      '万', '子', '形', '状', '很', '复', '杂', '。',
      '摸', m6, '有', '一', '杯', '口', '，', '摸', m4, '有', '断', '幺', '，', '但', '两', '者', '都', '是', '坎', '张', '。',
      '这', '种', '时', '候', '的', '小', '窍', '门', '是', '留', '着', '杂', '乱', '的', '部', '分', '不', '动', '，',
      '把', '较', '强', '的', '部', '分', '弄', '清', '爽', '，',
    ]
  },
  {
  id: 28,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, p1, z0, z0, z0, z0],
    images2: [m9, m9, p2, p3, p4, p6, p8, s3, s0, s7, s7, z4, z4, z4],
    answerImg: s7,
    explanation: [
      '“', '门', '清', '为', '前', '提', '”', '的', '手', '牌', '。',
      '优', '先', '打', s7, '固', '定', s0, '。',
      '亲', '家', '一', '枚', '赤', '宝', '牌', '，', '愚', '型', '即', '立', '也', '可', '以', '。'
    ]
  },
  {
  id: 29,
    round: '东 1 局  西家  6 巡目',
    images1: [z0, z0, m1, z0, z0, z0, z0],
    images2: [m6, m6, m6, m7, m8, p3, p4, s3, s0, s7, s7, z7, z7, m9],
    answerImg: s3,
    explanation: [
      '比', '起', '打', s7, '固', '定', s0, '，', '更', '优', '先', '碰', '中', '或', '者', '成', '暗', '刻', '。',
      '在', '有', '祝', '仪', '的', '规', '则', '可', '能', '会', '比', '较', '抵', '触', '打', '掉', '赤', '牌', '，',
      '但', '同', '样', '是', '一', '番', '，', '速', '度', '完', '全', '不', '一', '样', '。',
      '饼', '子', '进', '张', '听', '牌', '的', '时', '候', '，', '基', '本', '都', '是', '打', '掉', s0, '听', '对', '碰', '。'
    ]
  },
  {
  id: 30,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, p1, z0, z0, z0, z0],
    images2: [p2, p3, p4, p6, p8, s1, s3, s7, s7, s7, z4, z4, z4, s0],
    answerImg: p8,
    explanation: [
      '单', '纯', '从', '进', '张', '面', '看', '，', '打', s1, '更', '广', '，',
      '但', '是', '打', s1, '摸', s3, '要', '打', '掉', s0, '。',
      '这', '样', '考', '虑', '的', '话', '，', '有', '效', '牌', '数', '量', '没', '差', '别', '。',
      '有', '效', '枚', '数', '一', '样', '的', '话', '，', '可', '以', '根', '据', '摸', s5, s6, '完', '成', '面', '子', '时', '的', '最', '终', '型', '来', '选', '择', '。',
      '比', '起', '坎', p7, '，', '坎', s2, '的', '最', '终', '型', '更', '加', '优', '秀', '，',
      '因', '此', '正', '解', '是', '打', p8, '。'
    ]
  },
  {
  id: 31,
    round: '东 1 局  西家  5 巡目',
    images1: [z0, z0, m2, z0, z0, z0, z0],
    images2: [m2, m3, m5, m5, p3, p3, p4, s3, s4, s5, s6, s8, s9, s4],
    answerImg: s9,
    explanation: [
      '索', '子', '可', '以', '看', '成', s2, s5, s7, '进', '张', '的', '两', '面', '坎', '张', '形', '，',
      '没', '有', s9, '也', '能', '用', '上', s7, '。',
      '这', '里', '瞄', '准', '三', '色', '。'
    ]
  },
  {
  id: 32,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, p8, z0, z0, z0, z0],
    images2: [m3, m4, m4, m4, p5, p6, p7, p8, p9, s6, s7, s9, s9, s9],
    answerImg: m3,
    explanation: [
      '亲', '家', '宝', '牌', '1', '。',
      '目', '标', '先', '制', '立', '直', '，', '选', '择', '进', '张', '最', '多', '的', '形', '状', '。',
      '虽', '然', '摸', '进', p8, '的', '时', '候', '要', '打', '掉', '宝', '牌', '，', '但', '是', '几', '率', '不', '高', '。'
    ]
  },
  {
  id: 33,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, p7, z0, z0, z0, z0],
    images2: [m3, m3, m5, p2, p3, p4, p7, p8, s5, s6, s7, s7, s7, m6],
    answerImg: m3,
    explanation: [
      '平', '和', '一', '向', '听', '，', '因', '此', '是', '拆', m3, '还', '是', s7, '对', '子', '的', '问', '题', '。',
      m5, m6, '或', p7, p8, '这', '两', '个', '未', '完', '成', '搭', '子', '摸', '成', '对', '的', '完', '全', '一', '向', '听', '时', '就', '有', '差', '别', '了', '。',
      '例', '如', '摸', '进', p8, '，', '打', s7, '的', '话', '增', '加', '了', m3, p8, '四', '枚', '有', '效', '牌', '，',
      '相', '对', '的', '，', '打', m3, '的', '话', '则', '增', '加', '了', s4, s7, p8, '共', '七', '枚', '有', '效', '牌', '。',
      '而', '且', '索', '子', '上', '也', '有', '了', '一', '杯', '口', '的', '变', '化', '。',
      '留', '下', '连', '续', '的', '牌', '型', '是', '常', '理', '。'
    ]
  },
  {
  id: 34,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, m1, z0, z0, z0, z0],
    images2: [m6, m6, m6, m7, m9, m9, p1, p2, p3, p5, p6, s7, s7, m6],
    answerImg: m9,
    explanation: [
      '有', '红', m5, '的', '进', '张', '，', '因', '此', '不', '能', '开', '杠', '。',
      '先', '打', '掉', '一', '张', m9, '。',
      '摸', m8, '就', '杠', m6, '立', '直', '。',
      '亲', '家', '的', '暗', '杠', '立', '直', '是', '谁', '也', '无', '法', '违', '抗', '的', '“', '永', '远', '是', '我', '的', '回', '合', '”', '。'
    ]
  },
  {
  id: 35,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, s1, z0, z0, z0, z0],
    images2: [m4, m5, m6, m7, p2, p2, p3, p5, s6, s7, s7, s8, s8, p1],
    answerImg: p2,
    explanation: [
      '需', '要', '雀', '头', '。',
      '比', '起', '对', '万', '子', '的', '四', '连', '型', '下', '手', '，', '先', '整', '理', p2, p5, '。',
      '这', '样', '万', '子', '或', '者', '索', '子', '延', '伸', '的', '时', '候', '，', '手', '牌', '也', '更', '加', '整', '齐', '。',
      '类', '似', p1, p2, p2, p3, p5, '的', '形', '状', '，', '多', '半', '优', '先', '固', '定', '面', '子', '比', '较', '好', '。'
    ]
  },
  {
  id: 36,
    round: '东 1 局  东家  4 巡目',
    images1: [z0, z0, p1, z0, z0, z0, z0],
    images2: [m4, m5, m6, m7, p4, p0, p6, p6, p7, s3, s4, s5, s5, p3],
    answerImg: s5,
    explanation: [
      '因', '为', '宝', '牌', '是', p2, '，', '所', '以', '很', '想', '固', '定', '饼', '子', '的', '三', '面', '张', '，',
      '但', '是', '打', p6, '的', '进', '张', '比', '其', '他', '打', '法', '少', '很', '多', '，', '没', '有', '必', '要', '急', '着', '固', '定', '。',
      '打', s5, '不', '单', '进', '张', '数', '占', '优', '，', '形', '成', '好', '形', '听', '牌', '的', '枚', '数', '也', '更', '有', '利', '。'
    ]
  },
  {
  id: 37,
    round: '东 1 局  西家  4 巡目',
    images1: [z0, z0, m1, z0, z0, z0, z0],
    images2: [m3, m4, m5, m6, p1, p3, p7, p9, p9, s4, s5, s6, s7, p8],
    answerImg: p1,
    explanation: [
      '能', '看', '到', '平', '和', '的', '两', '向', '听', '。',
      '单', '看', '进', '张', '面', '，', '应', '该', '打', m3, '或', '者', p9, '，',
      '但', '是', '要', '留', '下', '容', '易', '做', '出', '雀', '头', '的', '万', '子', '四', '连', '型', '和', p7, p8, p9, p9, '。',
      '根', '据', '拆', '解', '，', '面', '子', '超', '载', '了', '，', '打', p1, '拆', '掉', '坎', '张', '。'
    ]
  },
  {
  id: 38,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, s7, z0, z0, z0, z0],
    images2: [m3, m3, p2, p3, p4, p5, p8, p9, s3, s3, s4, s7, s8, s9],
    answerImg: s3,
    explanation: [
      '打', p2, '或', p5, '进', '张', '面', '最', '广', '，', '但', '是', '容', '易', '最', '终', '听', '到', '边', p7, '上', '。',
      '这', '里', '柔', '软', '地', '打', s3, '，', '既', '能', '保', '留', '摸', p7, '直', '接', '听', '牌', '，',
      '同', '时', '也', '能', '期', '待', p2, p3, p4, p5, '四', '连', '型', '的', '延', '伸', '。',
      '取', '得', '制', '造', '两', '面', '和', '速', '度', '的', '妥', '协', '是', '一', '项', '重', '要', '的', '技', '术', '。'
    ]
  },
  {
  id: 39,
    round: '东 1 局  东家  5 巡目',
    images1: [z0, z0, s1, z0, z0, z0, z0],
    images2: [m3, m4, p3, p4, p4, p4, s1, s2, s2, s3, s4, s5, s5, s6],
    answerImg: p3,
    explanation: [
      '能', '看', '到', '断', '平', '三', '色', '，', '但', '这', '里', '打', p3, '才', '是', '正', '解', '。',
      '恐', '怕', '大', '多', '数', '人', '都', '会', '打', '掉', s1, '，',
      '可', '是', '摸', '进', '进', '入', '听', '牌', '的', '有', '效', '牌', m2, m5, s4, s7, '中', '任', '意', '一', '张', '时', '，',
      '要', '听', '牌', '还', '是', '只', '能', '打', '掉', p3, '。',
      '而', '留', '下', s1, '，', '摸', '进', '宝', '牌', s2, s3, s0, '都', '可', '以', '听', '牌', '。',
      '打', p3, '看', '上', '去', '很', '可', '惜', '，', '其', '实', '是', '非', '常', '优', '秀', '的', '一', '打', '。'
    ]
  },
  {
  id: 40,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, s2, z0, z0, z0, z0],
    images2: [m2, m3, m4, m6, m7, m8, p4, p0, s1, s2, s3, s4, s5, m5],
    answerImg: s1,
    explanation: [
      '这', '里', '选', '择', '能', '确', '实', '用', '上', p0, '的', '形', '状', '。',
      '基', '本', '确', '定', '有', '断', '幺', '，', '先', '完', '成', '饼', '子', '的', '面', '子', '的', '话', '有', '三', '面', '听', '。',
      '摸', '进', '宝', '牌', '也', '可', '以', '打', s2, '来', '应', '对', '。'
    ]
  },
  {
  id: 41,
    round: '东 1 局  西家  9 巡目',
    images1: [z0, z0, p5, z0, z0, z0, z0],
    images2: [m1, m2, m3, p2, p3, p3, p5, p6, p7, p8, s5, s6, s7, s8],
    answerImg: p2,
    explanation: [
      '固', '定', '雀', '头', '，', '活', '用', '两', '个', '四', '连', '型', '。',
      '巡', '目', '早', '的', '时', '候', '，', '摸', '进', p5, p8, '或', s5, s8, '的', '对', '碰', '听', '牌', '也', '可', '以', '摸', '切', '拒', '听', '。'
    ]
  }, 
  {
  id: 42,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, p1, z0, z0, z0, z0],
    images2: [m3, m3, m3, m5, p7, s1, s1, s2, s0, s6, ph, ph, ph, s7],
    images3: [z1, z1, z1],
    answerImg: s2,
    explanation: [
      '这', '里', '会', '有', '人', '想', '打', p7, '来', '准', '备', '碰', '听', '或', '者', '吃', '听', '吧', '。',
      '但', '是', '这', '里', '打', p7, '的', '话', '，', '再', '摸', '进', '周', '边', '的', '牌', '也', '只', '能', '扔', '掉', '。',
      '留', '着', s2, '可', '以', '吃', s3, '加', '速', '，', '四', '枚', s3, '按', '吃', '听', '两', '倍', '速', '换', '算', '下', '来', '就', '是', '八', '枚', '。',
      '而', '留', '着', p7, '有', '八', '枚', '两', '面', '听', '牌', '的', '有', '效', '牌', '。',
      '周', '边', '还', '有', '坎', '张', '或', '者', '对', '碰', '的', '听', '牌', '进', '张', '。',
      '打', s2, '后', '的', '最', '终', '型', '也', '更', '好', '些', '。'
    ]
  }, 
  {
  id: 43,
    round: '东 1 局  东家  6 巡目',
    images1: [z0, z0, m5, z0, z0, z0, z0],
    images2: [m4, m4, m4, m7, p3, p5, p7, s1, s1, s1, s3, s5, s5, p4],
    answerImg: s3,
    explanation: [
      '靠', '张', '听', '牌', '的', '问', '题', '。',
      '借', '助', '暗', '刻', '旁', '边', '的', '浮', '牌', '不', '适', '合', '靠', '张', '听', '牌', '的', '理', '论', '，', '可', '以', '得', '出', '正', '解', '。',
      '请', '注', '意', '，', '摸', '进', s2, '后', '的', '变', '则', '三', '面', '听', '是', '不', '如', '单', '纯', '的', '两', '面', '听', '牌', '的', '。',
      '目', '标', '是', '摸', '宝', '牌', m6, '、', '摸', p6, '的', '三', '面', '听', '、', '摸', s5, '的', '三', '暗', '刻', '，',
      s3, '妨', '碍', '狙', '击', '三', '暗', '刻', '。'
    ]
  }, 
  {
  id: 44,
    round: '东 1 局  南家  7 巡目',
    images1: [z0, z0, s4, z0, z0, z0, z0],
    images2: [m2, m3, m4, p3, s1, s2, s4, s5, s5, s6, s8, s9, s9, s3],
    answerImg: s8,
    explanation: [
      '推', '荐', '打', s8, '。',
      '执', '着', '于', '一', '气', '会', '让', '进', '张', '变', '少', '，',
      '而', '且', '还', '有', '“', '最', '终', '型', '不', '好', '”', '“', '要', '打', '掉', '宝', '牌', '”', '等', '等', '减', '分', '项', '。',
      '想', '狙', '击', p3, '和', s5, '靠', '张', '后', '的', '立', '平', '。'
    ]
  }, 
  {
  id: 45,
    round: '东 1 局  西家  5 巡目',
    images1: [z0, z0, m1, z0, z0, z0, z0],
    images2: [m3, m4, p4, p5, p6, p6, p7, p8, s2, s4, s6, s7, s7, s8],
    answerImg: s2,
    explanation: [
      '单', '看', '听', '牌', '枚', '数', '，', '打', s7, '固', '定', '面', '子', '最', '多', '，',
      '但', '是', '万', '子', '的', '两', '面', '可', '以', '吸', '收', '宝', '牌', '和', '红', '5', '，', '非', '常', '想', '用', '上', '。',
      '这', '里', '打', s2, '更', '好', '。', '比', '起', '打', s8, '的', '两', '坎', '，', '打', s2, '有', '效', '牌', '更', '多', '。',
      '再', '加', '上', '听', '牌', '的', '入', '张', '以', '外', '，', '摸', '进', s6, s8, '可', '以', '变', '化', '成', '更', '优', '秀', '的', '一', '向', '听', '。',
      '也', '可', '以', '应', '对', '饼', '子', '的', '延', '伸', '。'
    ]
  }, 
  {
  id: 46,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, m2, z0, z0, z0, z0],
    images2: [m2, m4, m6, m7, m9, m9, p6, p7, p8, s1, s1, s4, s5, m5],
    answerImg: m9,
    explanation: [
      '打', m9, '后', '形', '成', m3, m8, '进', '张', '的', '两', '个', '坎', '张', '。',
      '先', '摸', '进', '坎', '张', '有', '平', '和', '。',
      '两', '坎', '分', '离', '的', '形', '状', '就', '是', '一', '般', '所', '说', '的', '相', '离', '两', '坎', '。'
    ]
  }, 
  {
  id: 47,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, s4, z0, z0, z0, z0],
    images2: [m1, m1, m3, m4, m6, m8, p2, p2, p2, s5, s6, s9, s9, m5],
    answerImg: m8,
    explanation: [
      '一', '向', '听', '。', '打', m1, '和', m8, '进', '张', '同', '样', '是', '16', '枚', '，',
      '打', m8, '后', m1, '或', s9, '摸', '成', '暗', '刻', '可', '以', '跳', '符', '。',
      '而', '且', '端', '牌', '的', '对', '碰', '容', '易', '和', '出', '也', '是', '优', '点', '。'
    ]
  }, 
  {
  id: 48,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, m7, z0, z0, z0, z0],
    images2: [m4, m6, m7, m8, m9, p6, p6, s2, s2, s4, s4, s5, s5, m0],
    answerImg: p6,
    explanation: [
      '虽', '想', '从', s4, s4, s5, s5, '的', '两', '面', '子', '中', '切', '掉', '一', '枚', '，',
      '但', '是', '两', '面', '听', '牌', '的', '枚', '数', '打', p6, '、', s2, '、', s5, '都', '是', '一', '样', '的', '。',
      '拆', '出', p6, '单', '张', '，', '看', '一', '下', '饼', '子', '横', '向', '的', '延', '伸', '（', '遥', '远', '的', '三', '色', '）',
      '和', '索', '子', '的', '一', '杯', '口', '。',
      s4, '绝', '对', '不', '能', '打', '，', '因', '为', '会', '错', '过', '进', s3, '的', '两', '面', '听', '牌', '。',
      '不', '考', '虑', '赤', '牌', '的', '牌', '效', '率', '顺', '序', '：', '打', p6, '>', '打', s5, '>', '打', s4, '。'
    ]
  }, 
  {
  id: 49,
    round: '东 1 局  东家  6 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m1, m3, m8, m8, p4, p6, p6, s2, s2, s4, s7, s8, s9, m5],
    answerImg: p6,
    explanation: [
      '三', '对', '子', '“', '以', '门', '清', '为', '前', '提', '”', '。',
      '根', '据', '三', '对', '子', '最', '弱', '理', '论', '，', '拆', '对', '子', '有', '效', '牌', '多', '两', '枚', '。',
      '打', p6, '的', '两', '面', '变', '化', '有', '两', '种', '，', '因', '此', '是', '正', '解', '。'
    ]
  }, 
  {
  id: 50,
    round: '东 1 局  东家  4 巡目',
    images1: [z0, z0, m8, z0, z0, z0, z0],
    images2: [m2, m4, m7, m8, m9, p2, p3, p5, p6, s2, s2, s4, s6, s6],
    answerImg: m2,
    explanation: [
      '狙', '击', '234', '三', '色', '需', '要', '拆', '掉', p5, p6, '的', '两', '面', '，', '因', '此', '放', '弃', '234', '的', '三', '色', '。',
      '老', '实', '打', '掉', '最', '弱', '的', '搭', '子', '。',
      '有', '着', m0, '和', '456', '的', '三', '色', '，', '所', '以', '从', '外', '侧', '的', m2, '打', '起', '。'
    ]
  }, 
  {
  id: 51,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, m8, z0, z0, z0, z0],
    images2: [m3, m4, m6, p2, p3, p4, p8, p8, s2, s3, s4, s7, s9, m0],
    answerImg: s9,
    explanation: [
      '推', '荐', '拒', '听', '。', '断', '幺', '、', '平', '和', '、', '三', '色', '、', '赤', '牌', '应', '对', '、', '四', '连', '型', '的', '大', '量', '两', '面', '变', '化', '。',
      '集', '齐', '了', '这', '么', '多', '条', '件', '，', '当', '然', '拒', '听', '更', '有', '利', '。',
      '大', '多', '数', '时', '候', '坎', '张', '即', '立', '是', '对', '的', '，', '但', '正', '是', '在', '这', '里', '拒', '听', '也', '是', '很', '重', '要', '的', '。',
      '思', '考', '的', '方', '向', '不', '是', '因', '为', '有', '赤', '所', '以', '立', '直', '，', '而', '是', '因', '为', '有', '赤', '所', '以', '要', '做', '成', '能', '够', '自', '摸', '的', '形', '状', '。',
      '此', '外', '，', '最', '差', '的', '打', '法', '是', '无', '役', '默', '听', '。', '比', '起', '无', '法', '荣', '和', '的', '听', '牌', '，', '即', '立', '要', '好', '太', '多', '了', '。'
    ]
  }, 
  {
  id: 52,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, s6, z0, z0, z0, z0],
    images2: [m2, m4, m6, m6, p4, p5, p6, p7, p7, s3, s4, s6, s7, s8],
    answerImg: m2,
    explanation: [
      '打', m6, '的', '两', '坎', '最', '终', '型', '容', '易', '成', '为', '坎', '张', '。',
      '打', m2, '期', '待', '饼', '子', '的', '变', '化', '。'
    ]
  }, 
  {
  id: 53,
    round: '东 1 局  西家  6 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m7, m7, p1, p2, p2, p2, p3, p4, s3, s0, s5, s7, s8, s9],
    answerImg: p1,
    explanation: [
      '打', s5, '进', '张', '面', '最', '广', '，', '但', '是', '打', '完', '后', '的', '形', '状', '比', '较', '微', '妙', '。',
      '打', m7, '退', '回', '两', '向', '听', '在', '有', '赤', '麻', '将', '中', '绝', '对', '不', '行', '。',
      p1, s3, s5, '三', '个', '选', '项', '，', '搞', '不', '清', '的', '时', '候', '根', '据', '“', '最', '终', '型', '”', '和', '“', '容', '纳', '赤', '牌', '”', '来', '选', '就', '可', '以', '了', '。',
      '其', '中', '打', p1, '最', '优', '。'
    ]
  }, 
  {
  id: 54,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, s7, z0, z0, z0, z0],
    images2: [m2, m3, m4, m6, m7, p3, p4, p4, p5, s4, s5, s6, s8, s7],
    answerImg: p4,
    explanation: [
      '问', '题', '点', '在', '于', '把', '饼', '子', '作', '为', p3, p4, p5, '来', '用', '，', '还', '是', '把', p3, p5, '打', '掉', '，', p4, '做', '雀', '头', '。',
      '手', '牌', '中', '有', '连', '续', '型', '的', '时', '候', '固', '定', '面', '子', '。',
      '索', '子', '的', '连', '续', '型', '容', '易', '出', '雀', '头', '，', '摸', '进', '万', '子', '的', '听', '牌', '最', '终', '型', '为', '带', '宝', '牌', s8, '的', '两', '面', '单', '骑', '也', '没', '问', '题', '。',
      '摸', s7, '的', '听', '牌', '虽', '然', '要', '打', '掉', '宝', '牌', s8, '，', '但', '是', '门', '断', '平', '的', '打', '点', '也', '够', '了', '。'
    ]
  }, 
  {
  id: 55,
    round: '东 1 局  西家  4 巡目',
    images1: [z0, z0, s8, z0, z0, z0, z0],
    images2: [m3, m3, m4, m0, m5, m5, p6, p7, p7, s6, s7, s8, s9, m2],
    answerImg: p7,
    explanation: [
      '打', p7, '的', '进', '张', '少', '于', '其', '他', '牌', '，', '但', '是', '听', '牌', '必', '定', '为', '两', '面', '以', '上', '。',
      '进', '宝', '牌', '、', '赤', '、', '万', '子', '的', '多', '面', '听', '，', '全', '部', '都', '可', '以', '应', '对', '，',
      '期', '待', '值', '最', '大', '。'
    ]
  }, 
  {
  id: 56,
    round: '东 1 局  东家  4 巡目',
    images1: [z0, z0, m1, z0, z0, z0, z0],
    images2: [m2, m3, m4, m7, p5, p9, p9, s1, s2, s3, s3, s4, s6, s2],
    answerImg: p5,
    explanation: [
      '靠', '张', '问', '题', '。', '因', '为', '是', '平', '和', '的', '一', '向', '听', '，',
      '所', '以', '要', '留', '下', '“', '进', '赤', '5', '可', '以', '做', '成', '两', '面', '”', '、',
      '“', '可', '以', '做', '成', '听', '赤', '5', '的', '两', '面', '”', '、',
      '“', '最', '终', '听', '牌', '尽', '可', '能', '靠', '近', '端', '侧', '”', '的', '牌', '。',
      '而', '且', '，', '摸', '进', '红', p5, '还', '可', '以', '和', '其', '他', '浮', '牌', '交', '换', '。'
    ]
  }, 
  {
  id: 57,
    round: '东 1 局  东家  6 巡目',
    images1: [z0, z0, p4, z0, z0, z0, z0],
    images2: [m4, m4, m0, m5, p4, p0, p7, p7, s4, s4, s4, s6, s6, p6],
    answerImg: p4,
    explanation: [
      '能', '看', '到', '4', '5', '6', '的', '三', '色', '，', '想', '整', '理', '万', '子', '的', '重', '复', '面', '子', '，',
      '但', '是', '已', '经', 'dora', '3', '，', '比', '起', '三', '色', '更', '需', '要', '的', '是', '和', '出', '。',
      '实', '际', '上', '这', '里', '也', '是', '七', '对', '的', '一', '向', '听', '。',
      '打', p4, '进', '张', '最', '多', '，', '而', '且', '保', '留', '了', '三', '暗', '刻', '、', '七', '对', '、', '一', '杯', '口', '的', '可', '能', '性', '。'
    ]
  }, 
  {
  id: 58,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, m8, z0, z0, z0, z0],
    images2: [m3, m4, m5, m6, p2, p2, p2, p4, s2, s3, s4, s6, s8, m0],
    answerImg: s8,
    explanation: [
      '进', '张', '面', '上', '打', p4, '最', '佳', '，', '但', '最', '终', '形', '成', '坎', '张', '的', '可', '能', '性', '很', '高', '。',
      '这', '里', '拒', '绝', '愚', '形', '听', '牌', '，', '拆', s6, s8, '。',
      '而', '且', '也', '保', '留', '了', '234', '三', '色', '。',
      '摸', s5, '后', '进', '张', '面', '很', '广', '，', '因', '此', '先', '打', '外', '侧', '的', s8, '。'
    ]
  }, 
  {
  id: 59,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, m8, z0, z0, z0, z0],
    images2: [m3, m4, m5, m6, p2, p2, p2, p4, s3, s4, s5, s6, s8, m0],
    answerImg: p4,
    explanation: [
      '和', '打', s8, '比', '较', '，', '打', p4, '的', '有', '利', '点', '在', '于', '：',
      '“', '单', '纯', '的', '进', '张', '面', '更', '广', '”', '、',
      '“', '万', '子', '两', '面', '部', '分', '先', '进', '张', '也', '可', '以', '听', '两', '面', '单', '骑', '”', '、',
      '“', '最', '差', '情', '况', '听', '了', '坎', '张', '也', '可', '以', '暗', '听', '期', '待', '改', '好', '形', '”', '等', '等', '。'
    ]
  }, 
  {
  id: 60,
    round: '东 1 局  东家  8 巡目',
    images1: [z0, z0, s5, z0, z0, z0, z0],
    images2: [m2, m3, p2, p3, p4, p7, p7, p7, s6, s7, s8, s8, s9, p5],
    answerImg: s8,
    explanation: [
      '单', '看', '进', '张', '数', '量', '打', p2, '最', '多', '，', '但', '是', '作', '为', '最', '终', '听', '牌', '形', '非', '常', '优', '秀', '，', '所', '以', '还', '是', '想', '留', '着', '。',
      '在', s8, '和', s9, '中', '选', '择', '，', '根', '据', '“', '断', '幺', '不', '确', '定', '”', '、', '“', '红', s5, '和', '宝', '牌', s6, '的', '枚', '数', '差', '距', '”', '、', '“', '摸', '回', '失', '张', '时', '的', '形', '状', '补', '强', '”', '等', '方', '面', '，',
      '综', '合', '起', '来', '打', s8, '更', '优', '。'
    ]
  },
  {
  id: 61,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, m2, z0, z0, z0, z0],
    images2: [m3, m4, m4, m4, p5, p6, p7, p8, p9, s6, s7, s9, s9, s9],
    answerImg: p9,
    explanation: [
      '做', '成', '不', '会', '打', '掉', 'dora', m3, '的', '形', '状', '。',
      '如', '果', '打', s6, '进', s8, '还', '是', '要', '打', '掉', '宝', '牌', '，', '和', '摸', '回', '失', '张', '没', '区', '别', '。',
      '这', '里', '打', p9, '来', '最', '大', '限', '度', '活', '用', '三', '种', '赤', '牌', '的', '进', '张', '。'
    ]
  }, 
  {
  id: 62,
    round: '东 1 局  东家  4 巡目',
    images1: [z0, z0, p2, z0, z0, z0, z0],
    images2: [m2, m3, m7, m7, p2, p3, p7, p8, p9, s6, s7, s8, s9, m2],
    answerImg: s9,
    explanation: [
      '赤', '牌', '进', '张', '>', '两', '阶', '段', '变', '化', '的', '三', '色', '。',
      '打', s6, '找', '789', '的', '三', '色', '是', '无', '赤', '麻', '将', '的', '手', '顺', '。',
      '完', '成', '三', '色', '需', '要', '按', m8, '->', m9, '的', '顺', '序', '进', '张', '（', m9, '->', m8, '的', '顺', '序', '会', '丢', '平', '和', '，', '没', '有', '好', '处', '）。',
      '做', '出', '三', '色', '的', '几', '率', '太', '低', '，', '为', '了', '用', '上', '赤', '牌', '而', '向', '内', '侧', '靠', '近', '才', '是', '正', '解', '。'
    ]
  }, 
  {
  id: 63,
    round: '东 1 局  东家  5 巡目',
    images1: [z0, z0, s1, z0, z0, z0, z0],
    images2: [m1, m2, m3, m0, m6, m7, m8, p3, p4, s2, s6, s7, s7, s3],
    answerImg: m8,
    explanation: [
      '有', '两', '张', '宝', '牌', '，', '老', '实', '打', s6, '也', '是', '正', '解', '之', '一', '，',
      '不', '过', '推', '荐', '保', '留', '赤', '牌', '进', '张', '的', '贪', '心', '打', '法', '。',
      '不', '仅', '赤', '牌', '，', '摸', '进', '宝', '牌', s2, '的', '时', '候', '也', '可', '以', '变', '化', '为', '宝', '牌', '雀', '头', '的', '完', '全', '一', '向', '听', '。',
      '而', '狙', '击', '一', '气', '价', '值', '很', '低', '，', '原', '因', '有', '以', '下', '几', '点', '：',
      '“', '必', '须', '要', m4, '和', m9, '两', '者', '”', '、', '“', '先', '进', m4, '很', '好', '，', '但', '先', '进', m9, '有', '点', '微', '妙', '”', '、',
      '“', '摸', '进', '失', '张', '的', m4, '也', '可', '以', '转', '而', '狙', '击', '断', '幺', '三', '色', '”', '。'
    ]
  },
  {
  id: 64,
    round: '东 1 局  西家  5 巡目',
    images1: [z0, z0, s8, z0, z0, z0, z0],
    images2: [m5, m6, m6, m7, p4, p5, p7, s2, s2, s4, s5, s6, s7, s9],
    answerImg: p7,
    explanation: [
      '摸', '切', '宝', '牌', '也', '不', '差', '，', '但', '是', '不', '要', '被', '567', '三', '色', '限', '制', '住', '。',
      '面', '子', '候', '补', '已', '经', '够', '了', '，', '选', '择', '进', s8, '也', '能', '听', '牌', '的', '形', '状', '。',
      '而', '且', '还', '有', '456', '三', '色', '的', '机', '会', '。'
    ]
  },  
  {
  id: 65,
    round: '东 1 局  东家  3 巡目',
    images1: [z0, z0, m1, z0, z0, z0, z0],
    images2: [m2, m3, m3, p1, p3, p3, p7, s4, s4, s4, s8, z4, z4, p2],
    answerImg: s8,
    explanation: [
      '单', '看', '进', '张', '打', m3, '最', '多', '，', '但', '是', '搭', '子', '不', '足', '，', '不', '用', '急', '着', '固', '定', '宝', '牌', '搭', '子', '。',
      '有', '着', '宝', '牌', '成', '对', '或', '者', '进', m4, '等', '高', '打', '点', '变', '化', '的', '种', '子', '。',
      '而', '且', '打', m3, '也', '没', '七', '对', '了', '。',
      '根', '据', '验', '证', '结', '果', '，', '这', '个', '形', '状', '留', '下', m3, '对', '打', '点', '和', '速', '度', '都', '更', '加', '有', '利', '。'
    ]
  }, 
  {
  id: 66,
    round: '东 1 局  西家  3 巡目',
    images1: [z0, z0, s3, z0, z0, z0, z0],
    images2: [m3, m4, m0, m8, m9, m9, p5, p6, p6, s1, s3, s8, s9, m6],
    answerImg: s9,
    explanation: [
      '面', '子', '超', '载', '。', '才', '第', '3', '巡', '，', '没', '必', '要', '急', '着', '固', '定', '饼', '子', '的', '两', '面', '，', '先', '拆', '最', '弱', '的', '边', '张', '。',
      p5, p6, p6, '的', '形', '状', '摸', '进', p6, '或', p7, '都', '很', '强', '。',
      '这', '里', '打', '掉', p6, '的', '话', '，', '之', '后', '摸', p4, p7, '以', '外', '的', '饼', '子', '就', '都', '用', '不', '上', '了', '。'
    ]
  }, 
  {
  id: 67,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, m8, z0, z0, z0, z0],
    images2: [m2, m5, m5, m5, p0, p5, p8, p9, p9, p9, s2, s4, s6, s5],
    answerImg: p8,
    explanation: [
      '从', '摸', '到', '内', '侧', '牌', '（', m3, '/', p7, '/', s3, '）', '时', '的', '形', '状', '来', '思', '考', '。',
      '万', '子', '是', '两', '面', '，', '饼', '子', '是', '变', '则', '三', '面', '，', '索', '子', '是', '三', '面', '，', '最', '差', '的', '是', '饼', '子', '。',
      '暗', '刻', '旁', '边', '的', '浮', '牌', '不', '适', '合', '靠', '张', '听', '牌', '。',
      '所', '以', '切', p8, '，', '优', '化', '形', '状', '，', '避', '免', '劣', '势', '听', '牌', '。'
    ]
  }, 
  {
  id: 68,
    round: '东 1 局  西家  9 巡目',
    images1: [z0, z0, m2, z0, z0, z0, z0],
    images2: [m8, m8, p3, p4, p5, p6, p6, p7, p8, p9, s4, s6, s8, s3],
    answerImg: p9,
    explanation: [
      '最', '希', '望', '摸', '进', s7, '，', '饼', '子', '延', '伸', '了', '就', '狙', '击', '断', '平', '。',
      '自', '己', '一', '张', '宝', '牌', '都', '没', '有', '，', '可', '以', '认', '为', '其', '他', '家', '用', '上', '了', '，', '想', '进', '攻', '要', '选', '用', '便', '于', '行', '动', '的', '形', '状', '。',
      '无', '赤', '麻', '将', '也', '有', '打', p6, '狙', '击', '一', '气', '的', '手', '段', '，', '而', '有', '赤', '麻', '将', '中', '应', '该', '考', '虑', '到', '自', '己', '比', '起', '其', '他', '家', '已', '经', '相', '当', '不', '利', '，', '采', '用', '速', '度', '最', '快', '的', '形', '状', '。',
      '所', '以', '切', p9, '，', '追', '求', '速', '度', '和', '灵', '活', '性', '。'
    ]
  }, 
  {
  id: 69,
    round: '东 1 局  东家  5 巡目',
    images1: [z0, z0, m7, z0, z0, z0, z0],
    images2: [m2, m3, m6, m7, p3, p4, p4, p9, p9, s3, s0, z7, z7, s3],
    answerImg: p9,
    explanation: [
      '四', '个', '对', '子', '的', '七', '对', '两', '向', '听', '，', '但', '是', '两', '面', '搭', '子', '很', '多', '，', '也', '能', '容', '纳', '宝', '牌', '和', '赤', '牌', '，', '不', '适', '合', '走', '七', '对', '。',
      '面', '子', '超', '载', '了', '，', '所', '以', '拆', p9, '对', '子', '留', '下', '较', '强', '的', '五', '搭', '。',
      '不', '要', '觉', '得', p9, '容', '易', '鸣', '而', '拆', m2, m3, '的', '两', '面', '，', '或', '者', '模', '棱', '两', '可', '地', '打', p4, '。',
      '所', '以', '切', p9, '，', '优', '化', '面', '子', '结', '构', '，', '追', '求', '更', '广', '的', '进', '张', '。'
    ]
  }, 
  {
  id: 70,
    round: '东 1 局  东家  6 巡目',
    images1: [z0, z0, p3, z0, z0, z0, z0],
    images2: [m5, m6, m7, m7, m8, p5, p6, p6, p7, p8, s2, s4, s6, m8],
    answerImg: m7,
    explanation: [
      '万', '子', '看', '着', '有', '延', '伸', '性', '，', '但', '是', '进', m9, '就', '没', '了', '断', '幺', '。',
      '老', '老', '实', '实', '地', '保', '留', '两', '坎', '进', '张', '，', '同', '时', '也', '确', '定', '了', '断', '幺', '。',
      '抛', '弃', '掉', '打', s2, '这', '种', '两', '面', '信', '仰', '。'
    ]
  }, 
  {
  id: 71,
    round: '东 1 局  西家  4 巡目',
    images1: [z0, z0, m2, z0, z0, z0, z0],
    images2: [m3, m4, m5, p2, p2, p2, p4, p6, s3, s3, s3, s5, s7, m6],
    answerImg: s7,
    explanation: [
      '万', '子', '有', '横', '向', '延', '伸', '以', '及', '宝', '牌', m3, '成', '对', '可', '能', '，', '所', '以', '不', '能', '动', '。',
      p6, '和', s7, '比', '较', '，', '进', '向', '上', '延', '伸', '的', p7, '和', s8, '时', '，', '差', '距', '在', '是', '否', '确', '定', '断', '幺', '上', '。'
    ]
  }, 
  {
  id: 72,
    round: '东 1 局  东家  5 巡目',
    images1: [z0, z0, s8, z0, z0, z0, z0],
    images2: [m3, m5, m5, p2, p2, p6, p8, p8, s6, s7, ph, ph, ph, s8],
    images3: [s4, s3, s0],
    answerImg: m3,
    explanation: [
      '瞬', '间', '的', '进', '张', '数', '上', '拆', m5, '或', p8, '略', '多', '，', '但', '是', '可', '以', '从', '三', '家', '碰', '听', '，', '因', '此', '不', '存', '在', '拆', '对', '子', '的', '选', '项', '。',
      '只', '剩', '下', '打', m3, '和', p6, '的', '二', '择', '。', '比', '较', '补', '强', '牌', '（', m3, '/', p6, '）', '各', '自', '靠', '张', '的', '情', '况', '。',
      m3, '靠', '上', m2, '成', '为', '要', m1, m4, '的', '两', '面', '，', m1, '没', '有', '断', '幺', '，', '用', '不', '上', '。',
      p6, '靠', '上', p5, '成', '为', '要', p4, p7, '的', '两', '面', '，', '可', '以', '拆', '掉', '一', '个', '对', '子', '留', '下', '两', '面', '搭', '子', '。'
    ]
  }, 
  {
  id: 73,
    round: '东 1 局  东家  5 巡目',
    images1: [z0, z0, p5, z0, z0, z0, z0],
    images2: [m3, m3, m4, p4, p5, p6, p6, p6, p7, s6, s6, s7, s8, s9],
    answerImg: m3,
    explanation: [
      '虽', '然', '只', '能', '门', '清', '了', '，', '但', '是', '进', '张', '最', '多', '。',
      '进', p5, p8, '打', '宝', '牌', '成', '为', '平', '和', '，', '立', '直', '了', '确', '定', '亲', '家', '满', '贯', '，', '打', '点', '够', '高', '了', '。',
      '意', '识', '到', '食', '断', '打', s9, '只', '会', '拖', '慢', '速', '度', '。',
      '早', '点', '去', '治', '断', '幺', '病', '。'
    ]
  }, 
  {
  id: 74,
    round: '东 1 局  东家  4 巡目',
    images1: [z0, z0, s7, z0, z0, z0, z0],
    images2: [m6, m8, m8, p1, p1, p4, p0, p5, p7, p9, s5, s7, s7, s9],
    answerImg: p9,
    explanation: [
      '亲', '家', '第', '4', '巡', '，', '四', '个', '对', '子', '的', '七', '对', '两', '向', '听', '。',
      '一', '边', '保', '留', '着', '七', '对', '路', '线', '，', '同', '时', '也', '不', '放', '弃', '进', '宝', '牌', '的', '面', '子', '手', '。',
      '根', '据', '情', '况', '转', '为', '食', '断', '也', '要', '纳', '入', '视', '野', '。',
      '像', '失', '张', '的', '失', '张', '只', '有', p8, '。',
      '这', '就', '是', '所', '谓', '的', '先', '往', '内', '侧', '靠', '，', '最', '柔', '软', '的', '一', '打', '。'
    ]
  }, 
  {
  id: 75,
    round: '东 1 局  西家  6 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m2, m3, m6, m7, p4, p5, p5, p6, p7, p9, s0, s6, s6, m4],
    answerImg: p9,
    explanation: [
      '打', s0, '进', '张', '最', '多', '，', '但', '进', p8, '的', '门', '平', '没', '啥', '意', '思', '。',
      '除', '此', '情', '况', '之', '外', '即', '使', '留', '下', p9, '，', '听', '牌', '的', '时', '候', '还', '是', '要', '打', '掉', '的', '可', '能', '性', '很', '高', '，',
      '而', '能', '用', '上', '红', s5, '的', '变', '化', '很', '多', '。',
      '这', '里', '打', p9, '先', '确', '定', '断', '幺', '，', '看', '后', '面', '的', '摸', '牌', '是', '上', '策', '。',
      '门', '断', '平', '听', '牌', '的', '打', '点', '已', '经', '够', '了', '，', '可', '以', '打', s0, '立', '直', '。'
    ]
  }, 
  {
  id: 76,
    round: '东 1 局  西家  6 巡目',
    images1: [z0, z0, s3, z0, z0, z0, z0],
    images2: [p3, p4, p4, p6, p6, p8, p8, s3, s4, s4, s5, s6, s7, p5],
    answerImg: p6,
    explanation: [
      '进', '张', '最', '多', '，', '还', '有', '碰', '宝', '牌', s4, '听', '牌', '的', '可', '能', '。',
      '进', '饼', '子', '听', '牌', '的', '话', '，', '就', '打', '宝', '牌', s4, '三', '面', '听', '立', '直', '吧', '。'
    ]
  }, 
  {
  id: 77,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, s1, z0, z0, z0, z0],
    images2: [m3, m4, m0, m6, m8, p1, p1, p1, p7, p9, s7, s8, s8, s8],
    answerImg: m8,
    explanation: [
      '索', '子', '好', '形', '，', '因', '此', '能', '够', '最', '大', '限', '度', '活', '用', '的', '切', '牌', '才', '是', '正', '解', '。',
      '打', m8, '和', p9, '的', '二', '择', '，', '但', '万', '子', '是', '连', '续', '形', '，', '打', m8, '进', '张', '更', '多', '。',
      '最', '终', '形', '上', '坎', p8, '也', '比', '坎', m7, '强', '。',
      '注', '意', '别', '看', '漏', '了', '摸', m3, m6, '也', '能', '听', '牌', '。'
    ]
  }, 
  {
  id: 78,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, s1, z0, z0, z0, z0],
    images2: [m3, m4, m0, m7, m9, p1, p1, p1, p7, p9, s7, s9, s9, s9],
    answerImg: s7,
    explanation: [
      '两', '个', '愚', '型', '的', '一', '向', '听', '。',
      '虽', '然', '希', '望', '最', '终', '形', '是', '听', s7, s8, '的', '变', '则', '两', '面', '听', '，', '但', '是', '必', '须', '先', '进', '万', '子', '或', '者', '饼', '子', '的', '坎', '张', '。',
      '这', '里', '打', s7, '寻', '求', '最', '大', '的', '进', '张', '面', '。',
      m7, m9, '/', p7, p9, '出', '对', '子', '就', '坎', '张', '听', '牌', '，', '坎', '张', '先', '进', '的', '话', '，', '可', '以', '选', '择', '从', '暗', '刻', '中', '打', '掉', '一', '张', '听', '坎', '。',
      '7', '8', '9', '的', '三', '色', '需', '要', '三', '张', '牌', '，', '很', '不', '现', '实', '。'
    ]
  }, 
  {
  id: 79,
    round: '东 1 局  西家  6 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m1, m1, m3, m0, m5, m7, p3, p4, p5, p6, p7, s6, s7, p8],
    answerImg: m7,
    explanation: [
      '虽', '然', '花', '一', '手', '可', '以', '变', '化', '为', '三', '色', '，', '但', '需', '要', '听', '牌', '前', '摸', '进', p2, '或', '者', p5, '，', '再', '和', '到', s5, '，', '太', '困', '难', '了', '。',
      '老', '老', '实', '实', '选', '进', '张', '面', '最', '广', '的', '，', '打', m7, '更', '优', '。'
    ]
  }, 
  {
  id: 80,
    round: '东 1 局  西家  6 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m1, m1, m3, m0, m5, m7, p3, p4, p5, p6, p7, s6, s7, p5],
    answerImg: m5,
    explanation: [
      '容', '易', '做', '出', '567', '三', '色', '，', '也', '可', '以', '吃', '听', '的', '形', '状', '。',
      '摸', m4, '也', '有', '门', '平', '赤', '，', '打', '点', '足', '够', '，', '听', '牌', '即', '立', '。',
      '通', '常', '这', '手', '牌', '不', '会', '鸣', '牌', '，', '不', '过', '根', '据', '其', '他', '家', '的', '动', '作', '，', '吃', '也', '要', '纳', '入', '视', '野', '。',
      '进', '张', '数', '打', m7, '最', '多', '，', '但', '门', '清', '期', '待', '值', '最', '大', '的', '还', '是', '打', m5, '。'
    ]
  }, 
  {
  id: 81,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, m2, z0, z0, z0, z0],
    images2: [m2, m3, m4, m5, p2, p3, p5, p7, s6, s6, s6, s6, s7, p4],
    answerImg: m2,
    explanation: [
      '打', s6, '进', '张', '面', '不', '错', '，', '但', '大', '多', '数', '情', '况', '会', '变', '成', '坎', '张', '听', '牌', '。',
      '饼', '子', '和', '索', '子', '保', '留', '不', '动', '的', '话', '，', '进', p2, p5, '两', '面', '听', '，', '进', p6, '三', '面', '听', '，', '进', s5, s8, '两', '面', '单', '骑', '听', '牌', '。',
      '不', '但', '进', '张', '面', '最', '大', '，', '打', '点', '也', '很', '优', '秀', '，', '因', '此', '打', '万', '子', '是', '正', '解', '。',
      '打', m2, '或', m5, '的', '比', '较', '，', '把', '宝', '牌', m3, '放', '在', '边', '上', '更', '容', '易', '应', '对', '万', '一', '又', '摸', '进', '一', '枚', '宝', '牌', '的', '场', '合', '。',
      '宝', '牌', '要', '靠', '边', '，', '所', '以', '打', m2, '更', '优', '。'
    ]
  }, 
  {
  id: 82,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, s1, z0, z0, z0, z0],
    images2: [m6, m7, m8, p0, p5, p7, p9, p9, s3, s4, s6, z7, z7, s5],
    answerImg: s6,
    explanation: [
      '打', '饼', '子', '会', '大', '幅', '减', '少', '进', '张', '数', '。',
      '带', '中', '的', '双', '碰', '听', '牌', '已', '经', '很', '好', '了', '，',
      '现', '在', '不', '要', '拘', '泥', '于', '四', '连', '形', '，', '直', '接', '要', '最', '大', '进', '张', '。',
      '考', '虑', '进', '宝', '牌', '的', '情', '况', '，', '打', s6, '。'
    ]
  }, 
  {
  id: 83,
    round: '东 1 局  东家  8 巡目',
    images1: [z0, z0, p9, z0, z0, z0, z0],
    images2: [m0, m5, m6, m7, p2, p2, s0, s6, s7, s8, ph, ph, ph, p2],
    images3: [z7, z7, z7],
    answerImg: m5,
    explanation: [
      '打', m5, '和', '打', s8, '听', '牌', '数', '都', '是', '6', '枚', '，',
      '根', '据', '摸', s4, '有', '三', '面', '听', '并', '且', '自', '摸', '时', '跳', '符', '这', '两', '条', '理', '由', '，',
      '打', m5, '是', '正', '解', '。'
    ]
  }, 
  {
  id: 84,
    round: '东 1 局  东家  4 巡目',
    images1: [z0, z0, m1, z0, z0, z0, z0],
    images2: [m1, m2, m3, m3, m4, m6, m7, p3, p5, p5, s5, s6, s7, m3],
    answerImg: p3,
    explanation: [
      m1, '和', p3, '的', '二', '择', '。', '进', '张', '数', '只', '差', '一', '枚', '。',
      '打', m1, '虽', '然', '失', '张', '更', '少', '，', '但', '听', '牌', '时', '半', '数', '情', '况', '是', '愚', '形', '。',
      '打', p3, '更', '容', '易', '成', '为', '平', '和', '，', '最', '终', '形', '必', '定', '两', '面', '以', '上', '。',
      '吃', '听', '的', '枚', '数', '不', '如', '打', m1, '，', '不', '过', '碰', '听', '是', '一', '样', '的', '。'
    ]
  }, 
  {
  id: 85,
    round: '东 1 局  南家  7 巡目',
    images1: [z0, z0, m9, z0, z0, z0, z0],
    images2: [m2, m2, m4, m4, p4, p5, p6, p7, p7, s0, z2, z2, z2, s5],
    answerImg: p4,
    explanation: [
      '看', '上', '去', '优', '柔', '寡', '断', '，', '其', '实', '兼', '顾', '七', '对', '和', '面', '子', '手', '的', '打', p4, '不', '仅', '进', '张', '数', '最', '多', '而', '且', '很', '柔', '软', '。',
      '容', '易', '看', '漏', '掉', '进', m3, '也', '是', '听', '牌', '的', '。'
    ]
  }, 
  {
  id: 86,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, s1, z0, z0, z0, z0],
    images2: [m3, m3, m5, m6, p2, p3, p3, p5, p6, s2, s2, s3, s4, s0],
    answerImg: m3,
    explanation: [
      '现', '在', '六', '搭', '，', '面', '子', '超', '载', '。',
      '不', '需', '要', '三', '个', '对', '子', '，', '打', '掉', '没', '有', '补', '强', '牌', '的', m3, '对', '。'
    ]
  }, 
  {
  id: 87,
    round: '东 1 局  东家  6 巡目',
    images1: [z0, z0, z7, z0, z0, z0, z0],
    images2: [m2, m3, m4, m4, m4, s1, s1, s3, s4, z2, z2, z5, z5, s4],
    answerImg: m3,
    explanation: [
      '能', '鸣', '到', '宝', '牌', '白', '就', '很', '简', '单', '，', '但', '鸣', '不', '到', '的', '话', '反', '而', '挺', '难', '办', '的', '一', '手', '牌', '。',
      '这', '里', '最', '高', '可', '以', '看', '到', '四', '暗', '刻', '，', '推', '荐', '拆', '掉', m2, m3, '。',
      '这', '样', '不', '管', '从', '哪', '里', '鸣', '起', '都', '能', '留', '下', '强', '力', '的', '形', '状', '，', '兼', '顾', '面', '子', '手', '和', '七', '对', '，', '进', '张', '数', '最', '多', '。',
      '一', '眼', '看', '上', '去', '打', s4, '最', '快', '，', '但', '用', '五', '搭', '理', '论', '思', '考', '一', '下', '就', '能', '发', '现', '推', '进', '向', '听', '后', '会', '产', '生', '多', '余', '的', '牌', '，', '速', '度', '上', '反', '而', '比', '较', '微', '妙', '。',
      '此', '外', '，', m2, m3, '先', '打', '哪', '个', '区', '别', '不', '大', '，', '考', '虑', '到', '下', '一', '巡', '听', '牌', '的', '时', '候', '外', '侧', '的', '牌', '和', '率', '稍', '高', '一', '些', '，', '正', '解', '是', '打', m3, '。'
    ]
  }, 
  {
  id: 88,
    round: '东 1 局  东家  9 巡目',
    images1: [z0, z0, p3, z0, z0, z0, z0],
    images2: [m1, m2, m3, p1, p2, p3, p7, p8, p9, s1, s7, s8, s8, p4],
    answerImg: s1,
    explanation: [
      '宝', '牌', '是', p4, '，', '因', '此', '兼', '顾', '宝', '牌', '雀', '头', '和', '一', '气', '。',
      '三', '色', '肯', '定', '愚', '型', '听', '牌', '，', '而', '且', '要', '打', '掉', '宝', '牌', '，', '所', '以', '放', '弃', '掉', '。',
      '追', '纯', '全', '太', '没', '效', '率', '。',
      '这', '里', '打', s1, '能', '更', '好', '地', '保', '留', '宝', '牌', '和', '一', '气', '的', '可', '能', '性', '。'
    ]
  }, 
  {
  id: 89,
    round: '东 1 局  东家  9 巡目',
    images1: [z0, z0, p7, z0, z0, z0, z0],
    images2: [m0, m6, p1, p2, p3, p4, p6, p7, p8, p8, p9, z2, z2, z2],
    answerImg: p8,
    explanation: [
      '宝', '牌', '指', '示', '牌', '的', p7, '是', '瓶', '颈', '。',
      '这', '里', '打', p1, '或', '者', p9, '的', '话', '，', '万', '子', '成', '对', '后', '就', '寸', '步', '难', '行', '了', '。',
      '这', '里', '果', '断', '打', '掉', '宝', '牌', p8, '。',
      '运', '气', '好', '会', '有', '一', '气', '，', '进', p1, p4, '/', p6, p9, '也', '可', '以', '直', '接', '立', '直', '。'
    ]
  }, 
  {
  id: 90,
    round: '东 1 局  东家  4 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m3, m4, m4, m6, m8, p1, p3, p3, p6, p8, p8, s6, s7, m7],
    answerImg: p1,
    explanation: [
      '想', '要', '断', '幺', '就', p1, '，', '想', '要', '平', '和', '就', m4, '，', '想', '要', '三', '色', '就', p8, '。',
      '断', '幺', '、', '平', '和', '、', '三', '色', '全', '都', '要', '就', p1, '，', '期', '待', '值', '最', '大', '化', '。',
      '能', '想', '到', '进', p7, '或', '者', s8, '一', '向', '听', '的', '形', '状', '就', '能', '很', '简', '单', '地', '解', '出', '这', '题', '了', '。',
      '做', '不', '出', '的', '人', '请', '仔', '细', '阅', '读', '一', '向', '听', '顶', '峰', '理', '论', '的', '解', '说', '。'
    ]
  },   {
  id: 91,
    round: '东 1 局  东家  8 巡目',
    images1: [z0, z0, m7, z0, z0, z0, z0],
    images2: [m1, m1, m2, m3, m3, m4, m4, s3, s4, s4, s5, s6, s8, s8],
    answerImg: m1,
    explanation: [
      '索', '子', '打', s8, '后', '是', '两', '面', '两', '坎', '的', '形', '状', '，', '但', '要', '狙', '击', '门', '断', '平', '就', '打', m1, '。',
      '万', '子', '是', '连', '续', '形', '，', '实', '际', '上', '打', m1, '和', '打', s8, '有', '效', '枚', '数', '相', '同', '。',
      '注', '意', '到', '这', '点', '就', '能', '得', '出', '正', '解', '。'
    ]
  }, 
  {
  id: 92,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, s3, z0, z0, z0, z0],
    images2: [m3, m3, m4, m5, m6, m6, m7, s1, s1, s1, s2, s2, s3, m7],
    answerImg: s2,
    explanation: [
      '两', '杯', '口', '的', '瓶', '颈', '在', '于', '只', '剩', '余', '两', '枚', '的', '宝', '牌', '指', '示', '牌', s3, '。',
      '一', '开', '始', '就', '打', '掉', s2, '，', '期', '待', '平', '和', '以', '及', '万', '子', '的', '三', '面', '听', '（', m2, m5, m8, '）', '更', '加', '实', '际', '。'
    ]
  }, 
  {
  id: 93,
    round: '东 1 局  东家  8 巡目',
    images1: [z0, z0, s3, z0, z0, z0, z0],
    images2: [p5, p6, p6, p7, p8, p9, s5, s5, s6, s8, ph, ph, ph, p4],
    images3: [z1, z1, z1],
    answerImg: p9,
    explanation: [
      '打', s8, '拒', '听', '看', '上', '去', '能', '立', '刻', '变', '成', '好', '型', '，', '但', '打', '点', '并', '不', '会', '确', '实', '地', '上', '升', '。',
      '因', '此', '老', '实', '地', '听', '牌', '。',
      'p6', '和', p9, '的', '选', '择', '，', '打', p9, '可', '以', '食', '替', p0, '（', '坎', '张', '吃', '打', p8, '）。',
      '之', '后', '摸', '到', '宝', '牌', '可', '以', '先', '单', '骑', '。',
      '这', '里', '一', '番', '的', '提', '升', '非', '常', '大', '，', '不', '要', '忘', '记', '鸣', '宝', '牌', s4, '和', s0, '。'
    ]
  }, 
  {
  id: 94,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, m7, z0, z0, z0, z0],
    images2: [m5, m5, m8, m9, p1, p1, p2, p3, p3, p3, p4, s3, s4, m7],
    answerImg: p3,
    explanation: [
      '进', '张', '数', '最', '多', '，', '摸', p2, '有', '一', '杯', '口', '。',
      '注', '意', '不', '要', '打', p1, '。'
    ]
  }, 
  {
  id: 95,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, s4, z0, z0, z0, z0],
    images2: [m2, m3, m3, m4, m5, m7, m8, s1, s1, s2, s3, s4, s5, s1],
    answerImg: m8,
    explanation: [
      '牌', '形', '出', '自', '漫', '画', '《', '牌', '賊', '！', 'オ', 'カ', 'ル', 'テ', 'ィ', '》', '（', '片', '山', 'ま', 'さ', 'ゆ', 'き', '、', '竹', '书', '房', '）。',
      '索', '子', '的', '形', '状', '可', '以', '容', '纳', '宝', '牌', '，', '作', '为', '最', '终', '形', '非', '常', '完', '美', '（', '四', '面', '听', '），', '因', '此', '不', '能', '动', '。',
      '万', '子', '中', '的', '选', '择', '，', '打', m8, '成', '为', '需', '求', m1, m4, m6, '的', '两', '面', '两', '坎', '形', '。',
      '打', m3, '进', '张', '数', '虽', '多', '，', '但', '比', '起', '打', m8, '，', '平', '和', '的', '进', '张', '要', '少', '。'
    ]
  }, 
  {
  id: 96,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, m4, z0, z0, z0, z0],
    images2: [m2, m3, m3, m4, m5, m7, p3, p4, p5, p6, p6, p6, p7, m8],
    answerImg: m3,
    explanation: [
      '饼', '子', '作', '为', '完', '美', '的', '最', '终', '形', '，', '放', '着', '不', '动', '。',
      '期', '待', '平', '和', '打', m8, '把', '万', '子', '做', '成', '需', '求', m1, m4, m6, '的', '两', '面', '两', '坎', '形', '的', '话', '，', '就', '用', '不', '上', m0, '了', '，', '十', '分', '可', '惜', '。',
      '这', '里', '打', m3, '，', '最', '大', '限', '度', '活', '用', '宝', '牌', '。',
      '比', '起', '打', m8, '来', '虽', '然', '平', '和', '的', '进', '张', '变', '少', '了', '，', '但', '摸', '进', m0, '的', '破', '坏', '力', '是', '破', '格', '的', '。'
    ]
  }, 
  {
  id: 97,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m0, m6, m7, m8, p2, p2, p5, p6, p7, p8, p9, s6, s6, s8],
    answerImg: m8,
    explanation: [
      '亲', '家', '有', '赤', '的', '一', '向', '听', '。',
      '都', '到', '这', '里', '了', '，', '不', '需', '要', '找', '改', '良', '，', '要', '最', '大', '进', '张', '面', '。'
    ]
  }, 
  {
  id: 98,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, s9, z0, z0, z0, z0],
    images2: [m2, m3, m4, m6, m7, p4, p5, p6, p7, p7, s1, s3, s5, s0],
    answerImg: s1,
    explanation: [
      '打', s1, '和', '打', s5, '有', '效', '牌', '一', '样', '多', '。',
      '那', '就', '先', '确', '定', '断', '幺', '，', '追', '求', '饼', '子', '或', '者', '索', '子', '的', '延', '伸', '。',
      '有', '赤', '麻', '将', '里', '赤', '>', '宝', '牌', '。',
      '这', '种', '宝', '牌', 'no', ' ', 'time', '扔', '掉', '。'
    ]
  }, 
  {
  id: 99,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, s9, z0, z0, z0, z0],
    images2: [m4, m5, m6, m7, m9, p1, p3, s1, s1, s1, s2, s3, s4, s5],
    answerImg: m9,
    explanation: [
      '手', '里', '宝', '牌', '三', '。',
      '选', '择', '进', '张', '最', '多', '的', '形', '状', '，', '想', '要', '先', '制', '立', '直', '。',
      m9, '、', s2, '（', s5, '）', '进', '张', '最', '多', '。',
      '索', '子', '作', '为', '完', '美', '的', '最', '终', '形', '不', '要', '去', '动', '。',
      '因', '此', '打', m9, '是', '正', '解', '。',
      '恐', '怕', '不', '少', '人', '没', '发', '现', '打', m9, '和', '打', p1, '的', '进', '张', '数', '差', '别', '。',
      '区', '别', '在', '打', m9, '后', '摸', m4, m7, '。',
      '只', '看', '到', '两', '面', '的', '变', '化', '，', '盲', '点', '在', '对', '子', '的', '进', '张', '差', '别', '。',
      '请', '记', '住', '这', '种', '模', '式', '。'
    ]
  }, 
  {
  id: 100,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, m7, z0, z0, z0, z0],
    images2: [m1, m1, m2, m3, m4, m4, m5, m6, p4, s1, s1, s2, s4, p0],
    answerImg: s4,
    explanation: [
      '赤', '1', '足', '够', '了', '，', '先', '制', '的', '话', '愚', '型', '立', '直', '也', '很', '好', '，', '选', '择', '最', '大', '进', '张', '面', '。',
      '这', '里', '做', '456', '三', '色', '需', '要', '三', '张', '牌', '，', '很', '不', '现', '实', '。'
    ]
  }, 
  {
  id: 101,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, s4, z0, z0, z0, z0],
    images2: [m4, m5, m7, m8, p2, p2, p4, p0, p6, p7, p7, s3, s3, m9],
    answerImg: p2,
    explanation: [
      '进', p3, '也', '可', '以', '听', '牌', '，', '进', '张', '最', '多', '。',
      '打', p7, '就', '没', '有', '完', '全', '一', '向', '听', '和', '一', '杯', '口', '的', '机', '会', '了', '。'
    ]
  }, 
  {
  id: 102,
    round: '东 1 局  西家  9 巡目',
    images1: [z0, z0, z7, z0, z0, z0, z0],
    images2: [s1, s1, s2, s3, s0, s7, s7, s8, s8, s8, z3, z3, z3, s8],
    answerImg: s0,
    explanation: [
      '打', '点', '已', '经', '足', '够', '，', '所', '以', '从', '最', '终', '形', '上', '来', '思', '考', '。',
      '已', '经', '到', '了', '第', '九', '巡', '，', '需', '要', '考', '虑', '包', '括', '鸣', '牌', '在', '内', '的', '速', '度', '。',
      '作', '为', '最', '终', '形', '最', '好', '的', '听', '牌', '是', s6, s9, '。',
      '可', '以', '最', '大', '限', '度', '活', '用', '这', '点', '的', '打', '牌', '才', '是', '正', '解', '。',
      '打', s0, '不', '论', '怎', '么', '鸣', '牌', '都', '可', '以', '活', '用', s6, s9, '。',
      '吃', s1, s4, '/', s6, s9, '，', '碰', s7, '。',
      '上', '家', '之', '外', '的', '人', '打', '出', s1, '的', '话', '就', '碰', '。',
      '虽', '然', '有', '点', '抵', '触', '打', '掉', s0, '，', '但', '打', '点', '已', '经', '够', '高', '，', '更', '希', '望', '能', '确', '实', '地', '和', '牌', '。',
      '即', '使', '打', '掉', '赤', '牌', '，', '能', '鸣', '出', s1, '仍', '然', '有', '跳', '满', '。'
    ]
  }, 
  {
  id: 103,
    round: '东 1 局  东家  5 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m1, m1, m3, m4, m0, m7, m8, p3, p5, s2, s2, s7, s9, s9],
    answerImg: m1,
    explanation: [
      '面', '子', '超', '载', '。',
      '拆', '掉', '最', '弱', '的', '搭', '子', '留', '五', '搭', '。',
      '总', '之', '先', '拆', '个', m1, '。'
    ]
  }, 
  {
  id: 104,
    round: '东 1 局  西家  5 巡目',
    images1: [z0, z0, m7, z0, z0, z0, z0],
    images2: [m6, m7, m8, p3, p4, p4, s2, s2, s3, s3, s4, s5, s7, s5],
    answerImg: p4,
    explanation: [
      '其', '实', '是', '有', '没', '有', '注', '意', '到', '进', s6, '的', '断', '平', '听', '牌', '问', '题', '。',
      '单', '纯', '进', '张', '枚', '数', '打', s7, '有', '利', '（', '差', '两', '枚', '），', '但', '是', '两', '面', '听', '牌', '的', '进', '张', '枚', '数', '是', '一', '样', '的', '（', '打', s7, '后', '进', s2, '是', '坎', '张', '听', '牌', '）。',
      '打', p4, '确', '保', '一', '定', '有', '平', '和', '。'
    ]
  }, 
  {
  id: 105,
    round: '东 1 局  东家  8 巡目',
    images1: [z0, z0, p9, z0, z0, z0, z0],
    images2: [m4, m5, m6, m7, p1, p1, p0, p7, p8, s2, s4, s6, s7, p6],
    answerImg: p8,
    explanation: [
      '只', '看', '形', '状', '的', '话', '打', s2, '不', '错', '，', '但', '是', '退', '回', '两', '向', '听', '了', '。',
      '虽', '说', '有', '两', '个', '四', '连', '形', '，', '第', '8', '巡', '退', '向', '听', '还', '是', '稍', '嫌', '困', '难', '。',
      '宝', '牌', '3', '鸣', '牌', '了', '也', '有', '满', '贯', '，', '以', '“', '鸣', '三', '色', '为', '本', '线', '”', '来', '构', '筑', '。',
      '因', '此', '，', '要', '从', '万', '子', '或', '饼', '子', '的', '四', '连', '形', '中', '打', '掉', '一', '张', '，', '考', '虑', '到', '“', '最', '终', '形', '的', '优', '秀', '程', '度', '”', '、', '“', '成', '为', '三', '色', '的', '容', '易', '程', '度', '”', '、', '“', '应', '对', '赤', '牌', '”', '几', '点', '，', '打', '饼', '子', '更', '加', '有', '利', '。',
      '此', '外', '，', '别', '忘', '了', '进', m2, '可', '以', '替', '换', s2, s4, '。'
    ]
  }, 
  {
    id: 106,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m3, m4, m4, m5, p5, p6, p6, p6, s6, s7, s7, s8, s9, s9],
    answerImg: m4,
    explanation: [
      '打', s7, '进', '张', '数', '最', '多', '，', '但', '不', '能', '活', '用', '饼', '子', '的', '三', '面', '听', '。', 
      '打', s9, '的', '进', '张', '数', '不', '能', '令', '人', '满', '意', '。', 
      '进', '张', '数', '、', '打', '点', '、', '最', '终', '形', '、', '综', '合', '力', '最', '均', '衡', '的', '打', m4, '为', '正', '解', '。'
    ]
  },
  {
    id: 107,
    round: '东 1 局  西家  4 巡目',
    images1: [z0, z0, p4, z0, z0, z0, z0],
    images2: [m6, m7, p5, p7, p7, s2, s2, s3, s3, s4, s0, s7, s7, s8],
    answerImg: s8,
    explanation: [
      '宝', '牌', '2', '，', '遥', '远', '的', '三', '色', '。', 
      '拒', '绝', '会', '丢', '掉', '断', '幺', '的', s9, '，', '构', '造', '成', '“', '向', '内', '侧', '靠', '近', '也', '可', '以', '，', '鸣', '牌', '也', '可', '以', '”', '。', 
      '打', p7, '固', '定', '宝', '牌', '搭', '子', '也', '有', '点', '道', '理', '，', '但', '卡', '死', '在', '坎', p6, '上', '的', '可', '能', '性', '很', '高', '。', 
      '因', '为', '已', '经', '确', '保', '了', '一', '枚', '赤', '牌', '，', '先', '从', s8, '打', '起', '是', '基', '本', '。'
    ]
  },
  {
    id: 108,
    round: '东 1 局  西家  6 巡目',
    images1: [z0, z0, s4, z0, z0, z0, z0],
    images2: [m6, m6, m6, p3, p4, p0, p6, p7, p9, p9, p9, s6, s7, s8],
    answerImg: p3,
    explanation: [
      '估', '计', '打', m6, '或', '者', '打', p9, '听', p2, p5, p8, '三', '面', '的', '人', '很', '多', '，', 
      '但', '打', p3, '是', p4, p7, p8, '的', '变', '则', '三', '面', '听', '，', '和', '到', p4, p7, '有', '跳', '符', '。', 
      '荣', '和', '2600', '点', '和', '3200', '点', '的', '差', '距', '，', '自', '摸', '1000', '点', '2000', '点', '和', '1300', '点', '2600', '点', '的', '差', '距', '不', '小', '。', 
      '实', '战', '中', '需', '要', '看', '实', '际', '情', '况', '选', '择', '，', '期', '待', '值', '上', '的', '顺', '序', '是', '打', p3, '>', '打', m6, '>', '打', p9, '。'
    ]
  },
  {
    id: 109,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, p1, z0, z0, z0, z0],
    images2: [p3, p3, p4, p6, p7, p8, p9, s3, s3, s4, s6, s7, s8, p6],
    answerImg: s3,
    explanation: [
      '固', '定', '宝', '牌', '进', '张', '的', '两', '面', '…', '这', '样', '想', '就', '进', '坑', '了', '。', 
      '打', s3, '后', '进', p5, '有', '断', '幺', '。'
    ]
  },
  {
    id: 110,
    round: '东 1 局  东家  6 巡目',
    images1: [z0, z0, m6, z0, z0, z0, z0],
    images2: [m6, m7, m8, m8, m8, p3, p4, p4, p0, p6, p8, s2, s2, s3],
    answerImg: p8,
    explanation: [
      '饼', '子', '的', '形', '状', '是', p2, p5, p7, '进', '张', '的', '两', '面', '两', '坎', '。', 
      '打', s2, '要', '平', '和', '看', '上', '去', '不', '错', '，', '可', '实', '际', '上', '万', '子', '是', '面', '子', '和', '雀', '头', '的', '连', '续', '形', '，', 
      '打', p8, '进', '张', '最', '多', '，', '进', m5, m8, '可', '以', '听', '牌', '，', '期', '待', '值', '也', '最', '大', '。', 
      '此', '外', '比', '起', '打', s2, '来', '更', '容', '易', '附', '加', '断', '幺', '也', '是', '优', '点', '。'
    ]
  },
  {
    id: 111,
    round: '东 1 局  西家  4 巡目',
    images1: [z0, z0, m8, z0, z0, z0, z0],
    images2: [m7, m8, m8, m9, m9, p1, p1, p2, p4, p4, p5, p6, s0, s6],
    answerImg: p4,
    explanation: [
      '虽', '然', '有', '想', '打', m8, '期', '待', '饼', '子', '延', '伸', '的', '心', '情', '，', '但', '能', '进', m7, '的', '话', '这', '形', '状', '牢', '不', '可', '破', '。', 
      '很', '有', '可', '能', '会', '打', '掉', '宝', '牌', m9, '，', '因', '此', '万', '子', '不', '到', '万', '不', '得', '已', '不', '想', '去', '动', '。', 
      '这', '样', '就', '只', '能', '拆', p2, p4, '的', '坎', '张', '了', '。', 
      '说', '起', '先', '打', '哪', '张', '，', '比', '起', '打', p2, '进', p5, '的', '两', '面', '变', '化', '，', '打', p4, '进', p3, '做', '出', '一', '个', '面', '子', '更', '好', '。'
    ]
  },
  {
    id: 112,
    round: '东 1 局  南家  6 巡目',
    images1: [z0, z0, m6, z0, z0, z0, z0],
    images2: [m3, m4, m6, m8, p1, p2, p2, p3, p3, p5, p6, s4, s5, m7],
    answerImg: p3,
    explanation: [
      '面', '子', '超', '载', '。', 
      '拆', '哪', '个', '搭', '子', '，', '比', '起', '一', '杯', '口', '更', '可', '能', '断', '幺', '或', '三', '色', '。', 
      '打', p3, '准', '备', '把', p2, '做', '为', '雀', '头', '，', '其', '他', '地', '方', '出', '雀', '头', '候', '补', '了', '就', '打', p2, '固', '定', p1, p2, p3, '的', '面', '子', '。'
    ]
  },
  {
    id: 113,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, p4, z0, z0, z0, z0],
    images2: [m2, m3, m3, m4, p1, p2, p3, p6, p7, p7, p7, s7, s8, s8],
    answerImg: m3,
    explanation: [
      '现', '在', '没', '宝', '牌', '。', 
      p0, '还', '没', '出', '现', '的', '话', '，', '最', '大', '限', '度', '去', '构', '造', '容', '易', '听', '到', p5, p8, '的', '牌', '形', '。', 
      '如', '果', '万', '子', '固', '定', '一', '个', '面', '子', '，', '不', '仅', '在', '索', '子', '做', '出', '面', '子', '的', '时', '候', '，', '摸', '进', '第', '四', '张', p7, '也', '可', '以', '听', p5, p8, '。'
    ]
  },
  {
    id: 114,
    round: '东 1 局  东家  4 巡目',
    images1: [z0, z0, m1, z0, z0, z0, z0],
    images2: [m3, m3, m4, m0, m9, p1, p4, p0, p5, p6, s5, s8, z1, z1],
    answerImg: m9,
    explanation: [
      '孤', '张', '的', '选', '择', '。', 
      s8, '虽', '然', '是', '宝', '牌', '筋', '，', '但', '有', '两', '面', '的', '可', '能', '性', '和', s5, s6, s7, s8, '连', '续', '形', '做', '出', '宝', '牌', '雀', '头', '。', 
      p1, '进', p3, '有', p1, p3, p4, p5, p5, p6, '的', '两', '面', '两', '坎', '形', '。', 
      '排', '除', '下', '来', m9, '没', '用', '。'
    ]
  },
  {
    id: 115,
    round: '东 1 局  西家  4 巡目',
    images1: [z0, z0, m2, z0, z0, z0, z0],
    images2: [m3, m4, m5, m6, m6, m7, p3, p3, p7, p7, s1, s3, s5, s6],
    answerImg: s1,
    explanation: [
      '打', m6, '固', '定', '三', '面', '的', '话', '，', '进', m3, '很', '难', '受', '。', 
      '根', '据', '五', '搭', '理', '论', '拆', '掉', '最', '弱', '的', '坎', '张', '，', '向', '断', '幺', '前', '进', '。'
    ]
  },
  {
    id: 116,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, s3, z0, z0, z0, z0],
    images2: [m4, m5, m6, m6, m6, m7, p3, p4, p5, p6, s6, s7, s8, s8],
    answerImg: m7,
    explanation: [
      '因', '为', s4, '是', '宝', '牌', '而', '急', '着', '打', '掉', s8, '的', '话', '，', m7, '就', '完', '全', '没', '用', '了', '。', 
      '打', m7, '进', '张', '最', '多', '，', '而', '且', '进', s7, '还', '有', '一', '杯', '口', '。'
    ]
  },
  {
    id: 117,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, p4, z0, z0, z0, z0],
    images2: [m3, m7, m8, m9, p2, p3, p4, p5, p5, p6, s1, s2, s3, s4],
    answerImg: s1,
    explanation: [
      '打', m3, '/', p6, '/', s1, '的', '进', '张', '数', '都', '差', '不', '多', '。', 
      '本', '次', '的', '形', '状', '可', '以', '看', '做', '宝', '牌', p5, '雀', '头', '的', m3, '/', p6, '/', s4, '靠', '张', '听', '牌', '。', 
      '比', '起', '单', '独', '的', '牌', '，', '不', '上', '不', '下', '的', '连', '续', '形', '在', '靠', '张', '后', '听', '牌', '的', '枚', '数', '更', '少', '。', 
      '单', '独', '的', m3, '靠', '张', '后', '最', '少', '也', '能', '听', '四', '张', '牌', '，', '而', '且', '还', '有', '三', '色', '、', '赤', '牌', '等', '高', '附', '加', '价', '值', '。', 
      '留', '下', p6, '有', '多', '面', '听', '的', '期', '待', '，', '除', '了', '靠', '张', '也', '有', p2, '的', '进', '张', '。', 
      '排', '除', '下', '来', s4, '是', '最', '没', '用', '的', '牌', '，', '所', '以', '打', s1, '是', '正', '解', '。', 
      '估', '计', '有', '不', '少', '人', '觉', '得', '留', '下', s1, '最', '差', '也', '能', '听', '索', '子', '的', '两', '面', '单', '骑', '，', '实', '际', '上', '必', '须', '听', '索', '子', '的', '两', '面', '单', '骑', '的', '情', '况', '是', '很', '少', '的', '。'
    ]
  },
  {
    id: 118,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m3, m4, m4, m4, p5, p6, p7, s3, s4, s6, s7, s9, s9, s9],
    answerImg: s6,
    explanation: [
      '索', '子', '有', '效', '牌', '重', '复', '，', '留', '下', s7, '/', s8, '的', '进', '张', '打', s6, '进', '张', '面', '最', '广', '。', 
      '最', '终', '形', '也', '容', '易', '是', '好', '形', '。'
    ]
  },
  {
    id: 119,
    round: '东 1 局  东家  4 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m2, m3, m4, m6, m7, m7, p2, p3, p3, p4, s6, s7, s8, s9],
    answerImg: s9,
    explanation: [
      '单', '纯', '看', '进', '张', '数', '是', '打', p3, '，', '但', p2, p3, p3, p4, '的', '中', '膨', '形', '靠', '张', '必', '是', '两', '面', '听', '牌', '，', 
      '平', '和', '一', '向', '听', '需', '要', '靠', '张', '的', '场', '合', '，', '留', '下', '这', '个', '形', '状', '相', '当', '有', '利', '。', 
      '相', '对', '的', '，', '索', '子', '靠', '近', '端', '侧', '，', '靠', '张', '机', '能', '不', '高', '。', 
      '打', s9, '有', '断', '幺', '的', '可', '能', '性', '，', '打', '点', '上', '也', '有', '利', '。', 
      '还', '有', '进', m5, '或', m7, '三', '面', '听', '的', '可', '能', '性', '。'
    ]
  },
  {
    id: 120,
    round: '东 1 局  东家  4 巡目',
    images1: [z0, z0, m5, z0, z0, z0, z0],
    images2: [m2, m3, m4, m6, m7, m7, p2, p3, p4, p4, s6, s7, s8, s0],
    answerImg: p4,
    explanation: [
      '宝', '牌', '是', m6, '，', '打', m7, '固', '定', '宝', '牌', '还', '可', '以', '，', '但', '是', '进', '张', '面', '太', '窄', '。', 
      '打', '掉', '宝', '牌', m6, '进', '张', '最', '多', '，', '但', '是', '这', '种', '形', '状', '打', '宝', '牌', '还', '是', '太', '可', '惜', '了', '。', 
      '这', '里', '折', '衷', '打', p4, '是', '正', '解', '。', 
      '自', '摸', m4, '-', m8, '/', s4, '-', s9, '都', '能', '成', '为', '很', '有', '打', '点', '的', '手', '牌', '。', 
      '特', '别', '是', '祝', '仪', '麻', '将', '中', '，', '赤', '1', '就', '够', '了', '，', '朝', '着', '能', '够', '自', '摸', '和', '牌', '的', '最', '终', '形', '前', '进', '是', '基', '本', '操', '作', '。'
    ]
  },
  {
    id: 121,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, p1, z0, z0, z0, z0],
    images2: [m1, m2, m2, m3, m4, m6, p5, p7, p7, s3, s4, s7, s8, s9],
    answerImg: p5,
    explanation: [
      '万', '字', '是', '两', '面', '坎', '张', '靠', '近', '端', '侧', '的', '形', '状', '，', '进', m3, '/', m5, '。', 
      '朴', '素', '地', '进', '一', '向', '听', '。'
    ]
  },
  {
    id: 122,
    round: '东 1 局  东家  5 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m2, m3, m4, m5, m6, p3, p4, p4, p5, p6, s3, s3, s0, s6],
    answerImg: p4,
    explanation: [
      '简', '单', '要', '最', '多', '进', '张', '。', 
      '亲', '赤', '1', '还', '强', '行', '打', '万', '子', '是', '大', '罪', '。', 
      '进', p7, '就', '替', '换', '万', '子', '。'
    ]
  },
  {
    id: 123,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, s1, z0, z0, z0, z0],
    images2: [m2, m3, m3, m5, m6, m7, m8, p4, p4, p4, p6, s0, s6, s7],
    answerImg: m2,
    explanation: [
      p6, '有', '三', '色', '和', '赤', '牌', '进', '张', '，', '不', '能', '打', '。', 
      '所', '以', '是', '打', m2, '和', m8, '的', '二', '择', '。', 
      '先', '进', p5, '的', '场', '合', '，', '选', '择', '像', '下', '面', '的', '形', '状', '这', '样', '高', '目', '三', '色', '的', '变', '则', '三', '面', '听', '。', 
      m3, m3, m5, m6, m7, p4, p4, p4, p5, p6, s0, s6, s7, 
      '既', '然', '如', '此', '就', '不', '要', '考', '虑', '最', '终', '形', m1, m4, '，', '一', '开', '始', '就', '固', '定', m3, '雀', '头', '，', 
      '狙', '击', '万', '子', '四', '连', '形', '和', p6, '的', '靠', '张', '比', '较', '优', '秀', '。', 
      '此', '外', '，', '两', '面', '听', '牌', '就', '即', '立', '了', '，', '所', '以', '不', '存', '在', '一', '气', '。'
    ]
  },
  {
    id: 124,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, s1, z0, z0, z0, z0],
    images2: [m3, m5, p3, p4, p6, p7, p8, s3, s4, s4, s5, s5, s5, s0],
    answerImg: m3,
    explanation: [
      '把', '索', '子', '分', '开', '看', '成', s3, s4, s5, '和', s4, s5, s5, s5, '比', '较', '好', '。', 
      '单', '纯', '进', '张', '数', '打', s4, '多', '，', '但', '依', '据', '最', '终', '形', '打', '万', '子', '更', '优', '。', 
      '因', '为', '可', '以', '摸', m0, '，', '所', '以', '打', m3, '是', '正', '解', '。'
    ]
  },
  {
    id: 125,
    round: '东 1 局  东家  8 巡目',
    images1: [z0, z0, m7, z0, z0, z0, z0],
    images2: [m3, m3, m4, m4, m5, m6, m7, m8, m8, p4, p6, s4, s5, p5],
    answerImg: m4,
    explanation: [
      '打', m8, '进', '张', '最', '多', '，', '但', '万', '子', '先', '进', '张', '的', '时', '候', '会', '有', '单', '骑', '听', '牌', '的', '可', '能', '性', '。', 
      '可', '以', '尽', '量', '用', '上', '宝', '牌', '，', '而', '且', '进', '张', '面', '也', '很', '广', '的', '打', m4, '是', '正', '解', '。', 
      m9, '进', '张', '乍', '看', '上', '去', '有', '点', '亏', '，', '但', '实', '际', '上', '有', '高', '目', '三', '色', '，', '也', '很', '大', '。'
    ]
  },
  {
    id: 126,
    round: '东 1 局  东家  8 巡目',
    images1: [z0, z0, z7, z0, z0, z0, z0],
    images2: [m6, m7, p6, p7, s4, s4, s0, s6, s7, s7, s8, s8, s9, s9],
    answerImg: s4,
    explanation: [
      '比', '起', '不', '确', '定', '的', '三', '色', '，', '确', '定', '的', '一', '杯', '口', '。', 
      '虽', '然', '当', '下', '没', '有', '雀', '头', '，', '由', '于', '确', '保', '了', '一', '杯', '口', '这', '个', '役', '，', '之', '后', '单', '骑', '听', '牌', '也', '没', '问', '题', '。', 
      '而', '且', '，', '这', '个', '形', '状', '摸', '到', m6, m7, p6, p7, '四', '种', '12', '枚', '成', '对', '也', '可', '以', '两', '面', '听', '牌', '，', 
      '单', '纯', '计', '算', '下', '来', '约', '43%', '的', '概', '率', '可', '以', '扔', '下', '门', '平', '一', '杯', '口', '赤', '1', '的', '棒', '子', '。'
    ]
  },
  {
    id: 127,
    round: '东 1 局  西家  4 巡目',
    images1: [z0, z0, s7, z0, z0, z0, z0],
    images2: [m1, m2, m2, m3, m4, m7, m8, p1, p2, p3, p4, p6, s7, s8],
    answerImg: p6,
    explanation: [
      '能', '看', '到', '平', '和', '的', '两', '向', '听', '。', 
      '构', '造', '容', '易', '出', '雀', '头', '的', '形', '状', '。', 
      '打', p6, '后', '不', '光', '进', m2, m5, '，', '进', m1, m4, p1, p4, '也', '能', '出', '雀', '头', '。'
    ]
  },
  {
    id: 128,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, m7, z0, z0, z0, z0],
    images2: [m6, m7, p5, p6, p7, s2, s3, s4, s5, s6, s6, s7, s8, p5],
    answerImg: s6,
    explanation: [
      '单', '看', '进', '张', '数', '打', p5, '最', '多', '，', '但', '进', s1, s4, s7, '会', '变', '成', '单', '骑', '听', '牌', '，', '也', '容', '易', '失', '去', '断', '幺', '。', 
      '三', '色', '+', '断', '幺', '+', '赤', '牌', '对', '应', '+', '好', '形', '确', '定', '，', '打', s6, '的', '期', '待', '值', '最', '大', '。'
    ]
  },
  {
    id: 129,
    round: '东 1 局  东家  4 巡目',
    images1: [z0, z0, p7, z0, z0, z0, z0],
    images2: [m7, m8, p2, p3, p6, p7, p7, s2, s3, s3, s3, s4, s6, s7],
    answerImg: p7,
    explanation: [
      '把', s2, s3, s3, s3, s4, '算', '作', '两', '搭', '的', '话', '已', '经', '六', '搭', '，', '估', '计', '拆', p2, p3, '的', '人', '很', '多', '，', 
      '但', s3, '和', p7, '各', '只', '剩', '一', '枚', '（', p7, '是', '宝', '牌', '指', '示', '牌', '）', '，', '所', '以', '即', '使', '拆', '掉', p2, p3, '，', '五', '搭', '的', '机', '能', '也', '很', '一', '般', '。', 
      '这', '里', '先', '打', '掉', '一', '张', p7, '固', '定', '宝', '牌', '进', '张', '搭', '子', '。', 
      '就', '这', '么', '用', '六', '搭', '子', '打', '不', '仅', '从', '结', '果', '上', '看', '速', '度', '更', '快', '，', '打', '点', '也', '更', '高', '。', 
      '先', '跑', '掉', '危', '险', '的', '宝', '牌', '指', '示', '牌', '的', '优', '点', '也', '不', '容', '忽', '视', '。'
    ]
  },
  {
    id: 130,
    round: '东 1 局  东家  8 巡目',
    images1: [z0, z0, p9, z0, z0, z0, z0],
    images2: [m5, m5, m5, m6, m7, m7, p3, p4, p5, p6, s7, s8, s8, p1],
    answerImg: m7,
    explanation: [
      '进', '张', '面', '最', '大', '的', '朴', '素', '打', m7, '是', '正', '解', '。', 
      '亲', '家', '即', '使', '最', '终', '听', '坎', p2, '也', '要', '毫', '不', '犹', '豫', '地', '立', '直', '。'
    ]
  },
  {
    id: 131,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, p2, z0, z0, z0, z0],
    images2: [m6, m7, s1, s1, s2, s4, s4, s5, s6, s6, s7, z4, z4, m0],
    answerImg: s4,
    explanation: [
      '进', '张', '面', '很', '广', '，', '最', '高', '形', '是', '进', s3, '的', '平', '和', '。', 
      s1, '和', '北', '的', '对', '碰', '听', '牌', '也', '不', '错', '。', 
      '乍', '看', '上', '去', '要', '进', '张', '数', '就', '打', s4, '（', '两', '面', '坎', '张', '）', '，', '要', '打', '点', '就', '打', s2, '（', '一', '杯', '口', '）', '，', 
      '实', '际', '上', '还', '有', '平', '和', '，', '不', '管', '是', '进', '张', '数', '还', '是', '打', '点', '都', '是', s4, '更', '有', '利', '。'
    ]
  },
  {
    id: 132,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, m2, z0, z0, z0, z0],
    images2: [m1, m1, m1, m2, m3, m4, m5, p2, p3, s1, s1, s1, s2, s1],
    answerImg: s1,
    explanation: [
      '这', '就', '是', '俗', '话', '说', '的', '“', '一', '番', '上', '升', '”', '的', '手', '牌', '。', 
      '幺', '九', '牌', '/', '字', '牌', '的', '暗', '杠', '和', '一', '番', '的', '价', '值', '差', '不', '多', '。', 
      '要', '听', '牌', '需', '要', m2, m5, '/', m3, m6, '/', p1, p4, '/', s2, '，', '看', '着', '马', '上', '就', '能', '听', '。', 
      '这', '牌', '是', '完', '全', '的', '胜', '负', '手', '，', '即', '杠', '非', '常', '实', '战', '。', 
      '听', '牌', '了', '就', '即', '立', '。', 
      '此', '外', '也', '有', '“', '先', '打', s2, '，', '摸', '到', '有', '效', '牌', '再', '杠', '”', '的', '打', '法', '，', '但', '比', '起', '即', '杠', '少', '了', '三', '枚', '有', '效', '牌', '。'
    ]
  },
  {
    id: 133,
    round: '东 1 局  南家  5 巡目',
    images1: [z0, z0, p3, z0, z0, z0, z0],
    images2: [m1, m1, m3, m5, p3, p4, p6, p7, s4, s4, s6, z2, z2, p8],
    answerImg: m5,
    explanation: [
      '虽', '然', '有', '三', '个', '雀', '头', '，', '但', '有', '役', '牌', '对', '子', '，', '以', '鸣', '牌', '为', '前', '提', '留', '下', '碰', '材', '。', 
      '根', '据', '弱', '搭', '子', '三', '枚', '构', '成', '理', '论', '，', '把', '万', '字', '变', '为', '三', '枚', '是', '正', '解', '。'
    ]
  },
  {
    id: 134,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, m4, z0, z0, z0, z0],
    images2: [m4, m5, m6, m6, m6, m7, p3, p4, s5, s6, s6, s7, s8, s8],
    answerImg: s6,
    explanation: [
      '进', '张', '最', '多', '，', '而', '且', '有', '进', '宝', '牌', m5, '的', '期', '待', '。', 
      '放', '过', m0, '会', '后', '悔', '一', '辈', '子', '。'
    ]
  },
  {
    id: 135,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, m4, z0, z0, z0, z0],
    images2: [m5, m6, m7, m7, m8, m8, m9, s4, s4, s4, s0, s7, s7, s8],
    answerImg: s7,
    explanation: [
      '只', '看', '进', '张', '数', '的', '话', '，', '打', s0, '或', '打', s8, '压', '倒', '性', '的', '多', '，', '但', '很', '难', '用', '上', s0, '。', 
      '那', '似', '乎', '该', '打', m8, '，', '但', '应', '对', '不', '了', '摸', '进', '宝', '牌', m5, '。', 
      '这', '里', '的', '正', '解', '是', '打', s7, '，', '一', '边', '备', '着', '摸', '宝', '牌', m5, '，', '一', '边', '期', '待', '索', '子', '的', '好', '形', '。', 
      s4, s4, s4, s5, s7, s8, '的', s6, '有', '效', '牌', '重', '复', '，', '看', '上', '去', '不', '像', '好', '形', '，', '但', '仅', s3, s5, '进', '张', '就', '有', '7', '枚', '。', 
      '更', '进', '一', '步', '时', '能', '留', '下', '两', '面', '以', '上', '的', '听', '牌', '。', 
      '不', '认', '为', '这', '个', '形', '状', '是', '好', '形', '的', '人', '需', '要', '改', '改', '观', '念', '了', '。'
    ]
  },
  {
    id: 136,
    round: '东 1 局  西家  4 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m7, m7, m9, p2, p3, p7, p8, p9, s2, s2, s0, s6, s7, m5],
    answerImg: m7,
    explanation: [
      m7, '和', m9, '的', '二', '择', '，', '不', '过', '打', m9, '的', '两', '雀', '头', '形', '时', '，', '两', '面', '变', '化', '的', '有', '效', '牌', '差', '异', '只', '有', s3, '。',
      '这', '里', '两', '坎', '形', '容', '易', '形', '成', '平', '和', '。',
      '即', '使', '先', '摸', '到', p1, p4, '的', '最', '终', '形', '，', '舍', '牌', '中', '有', m7, '>', m5, '的', '坎', m8, '也', '很', '强', '。'
    ]
  },
  {
    id: 137,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, m8, z0, z0, z0, z0],
    images2: [m3, m3, m4, p4, p4, p4, s2, s3, s4, s4, s5, s5, s6, p0],
    answerImg: s2,
    explanation: [
      '构', '造', '不', '用', '打', '掉', p0, '的', '形', '状', '是', '有', '赤', '麻', '将', '的', '基', '本', '。',
      '能', '看', '到', '345', '三', '色', '，', '如', '果', '可', '以', '想', '到', '“', '万', '子', '完', '成', '了', '就', '听', '饼', '子', '，', '饼', '子', '完', '成', '了', '就', '听', '万', '子', '”', '，',
      '就', '会', '得', '出', '索', '子', '只', '需', '做', '出', '两', '个', '面', '子', '的', '正', '解', '。',
      '打', m3, '虽', '然', '柔', '软', '，', '但', '只', '会', '增', '加', '必', '须', '打', '掉', p0, '的', '进', '张', '。'
    ]
  },
  {
    id: 138,
    round: '东 1 局  南家  7 巡目',
    images1: [z0, z0, m3, z0, z0, z0, z0],
    images2: [m4, m4, m6, m7, m8, p6, p7, p7, s1, s3, ph, ph, ph, s3],
    images3: [z7, z7, z7],
    answerImg: p7,
    explanation: [
      '推', '荐', '这', '里', '固', '定', '两', '面', '来', '使', '得', '最', '终', '形', '容', '易', '成', '为', '好', '形', '。',
      '宝', '牌', '是', m4, '，', '因', '此', '最', '终', '形', '强', '行', '贪', '一', '手', '带', '宝', '牌', '的', '对', '碰', '，', '大', '部', '分', '时', '候', '都', '会', '失', '败', '。',
      '无', '论', '如', '何', '都', '要', '满', '贯', '的', '局', '面', '下', '，', '也', '要', '记', '得', '还', '有', '“', '期', '待', '赤', '牌', '先', '打', p7, '，', '即', '使', '能', '鸣', '的', '索', '子', '出', '了', '也', '不', '到', '极', '限', '不', '动', '手', '”', '的', '打', '法', '。'
    ]
  },
  {
    id: 139,
    round: '东 1 局  东家  4 巡目',
    images1: [z0, z0, s5, z0, z0, z0, z0],
    images2: [m4, m5, m7, m8, p2, p4, p4, p6, p8, s2, s3, s9, s9, m9],
    answerImg: p4,
    explanation: [
      '看', '上', '去', '违', '背', '了', '两', '雀', '头', '理', '论', '，', '但', '保', '持', '两', '雀', '头', '推', '进', '的', '话', '，', '变', '成', '无', '役', '无', '宝', '牌', '听', '牌', '的', '可', '能', '性', '很', '大', '。',
      '由', '于', '变', '化', '也', '不', '多', '，', '这', '里', '选', '择', '最', '容', '易', '成', '平', '和', '的', '形', '状', '。',
      '打', p2, '和', '打', p4, '的', '直', '接', '进', '张', '数', '没', '区', '别', '。'
    ]
  },
  {
    id: 140,
    round: '东 1 局  西家  4 巡目',
    images1: [z0, z0, p4, z0, z0, z0, z0],
    images2: [m4, m4, m8, m9, p3, p3, p7, p8, p9, s3, s4, s6, s6, s8],
    answerImg: m9,
    explanation: [
      '六', '搭', '子', '面', '子', '超', '载', '。', '根', '据', '五', '搭', '理', '论', '留', '下', '有', '发', '展', '的', '较', '强', '五', '搭', '。',
      '这', '里', '拆', '掉', '最', '弱', '的', '边', '张', m8, m9, '是', '正', '解', '。',
      '考', '虑', '到', '摸', m6, '后', '万', '子', '会', '形', '成', m4, m6, m8, '的', '两', '坎', '，', '细', '心', '地', '先', '打', m9, '。',
      '想', '着', '“', '三', '色', '”', '“', '引', '挂', '”', '而', '去', '打', m4, '很', '蠢', '。'
    ]
  },
  {
    id: 141,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, p5, z0, z0, z0, z0],
    images2: [m2, m3, m4, m5, m5, p3, p4, p5, s3, s5, s6, s6, s7, m6],
    answerImg: s3,
    explanation: [
      '虽', '然', '能', '看', '到', '345', '三', '色', '，', '但', '最', '终', '形', '可', '能', '会', '听', '坎', '张', '，', '因', '此', '放', '弃', '三', '色', '。',
      '单', '纯', '进', '张', '数', '上', '打', s6, '最', '多', '，', '考', '虑', '到', '最', '终', '形', '打', s3, '。',
      '这', '样', '大', '概', '率', '会', '有', '断', '平', '，', '进', s5, '或', s7, '高', '目', '一', '杯', '口', '，', '进', m7, '三', '面', '听', '，', '很', '香', '。'
    ]
  },
  {
    id: 142,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, s1, z0, z0, z0, z0],
    images2: [m5, m6, m7, m8, p3, p4, p5, p7, p7, s2, s3, s4, s4, p6],
    answerImg: s4,
    explanation: [
      '打', s4, '的', '进', '张', '数', '和', '打', '点', '都', '很', '优', '秀', '。',
      '搞', '不', '清', '楚', '的', '时', '候', '拆', '亚', '两', '面', '基', '本', '都', '是', '正', '解', '。'
    ]
  },
  {
    id: 143,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, m4, z0, z0, z0, z0],
    images2: [m6, m6, m6, m7, p4, p5, p6, p6, p6, p7, p7, p7, p8, m8],
    answerImg: p4,
    explanation: [
      '打', p8, '是', m6, m9, '/', p3, p6, '的', '变', '则', '四', '面', '听', '，', '但', '和', '到', m9, '就', '只', '有', '立', '直', '。',
      '这', '里', '打', p4, '立', '直', '确', '定', '亲', '满', '。',
      '这', '样', '不', '管', '和', '到', p5, '还', '是', p8, '一', '定', '有', '一', '杯', '口', '。'
    ]
  },
  {
    id: 144,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, p8, z0, z0, z0, z0],
    images2: [m2, m3, m4, p2, p4, p6, p6, p7, p8, s1, s2, s3, s4, s0],
    answerImg: p2,
    explanation: [
      '能', '看', '到', '234', '的', '三', '色', '。',
      '打', p6, '损', '宝', '牌', p9, '的', '进', '张', '。',
      '打', s1, '找', '234', '三', '色', '的', '话', '，', s5, '不', '成', '雀', '头', '就', '得', '把', s0, '打', '掉', '。',
      '在', '有', '赤', '麻', '将', '中', '，', '234', '和', '678', '的', '三', '色', '进', '了', '红', m5, '就', '没', '了', '。',
      '这', '次', '也', '一', '样', '，', '要', '做', '234', '的', '三', '色', '就', '很', '难', '用', '上', s0, '。',
      '老', '老', '实', '实', '打', p2, '要', '进', '张', '面', '，', '狙', '击', '立', '平', '才', '是', '正', '解', '。',
      '尤', '其', '在', '祝', '仪', '麻', '将', '里', '，', '有', '赤', '牌', '的', '时', '候', '就', '要', '想', '着', '去', '做', '可', '以', '自', '摸', '的', '最', '终', '形', '。'
    ]
  },
  {
    id: 145,
    round: '东 1 局  东家  9 巡目',
    images1: [z0, z0, m6, z0, z0, z0, z0],
    images2: [m6, m7, m9, m9, p2, p2, p3, p3, p4, p0, p6, p7, p7, p8],
    answerImg: p2,
    explanation: [
      '打', '掉', p2, '后', '，', '饼', '子', '成', '为', '左', '右', '对', '称', '的', '九', '枚', '翼', '形', '。',
      '进', '张', '是', p1, p4, p6, p9, '，', '加', '上', '万', '子', '的', '两', '面', '，', '有', '效', '牌', '最', '多', '，', '一', '共', '6', '种', '22', '枚', '，', '所', '有', '进', '张', '都', '有', '平', '和', '。'
    ]
  },
  {
    id: 146,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, p3, z0, z0, z0, z0],
    images2: [m2, m3, m4, p3, p4, p4, p5, p6, p7, p7, s6, s7, s7, p8],
    answerImg: s7,
    explanation: [
      '饼', '子', '是', '八', '枚', '翼', '形', '。',
      '打', s7, '成', '为', '“', '超', '完', '全', '一', '向', '听', '”', '。',
      '可', '以', '应', '对', '万', '一', '摸', '到', '宝', '牌', p4, '、', '赤', '牌', '。'
    ]
  },
  {
    id: 147,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, m9, z0, z0, z0, z0],
    images2: [m1, m2, m3, p3, p4, p4, p5, p6, p7, p7, s2, s2, s3, p8],
    answerImg: s3,
    explanation: [
      '饼', '子', '是', '八', '枚', '翼', '形', '。',
      '数', '数', '两', '面', '以', '上', '的', '最', '终', '形', '的', '有', '效', '牌', '，', '打', s2, '和', '打', s3, '一', '样', '优', '秀', '，', '都', '有', '26', '枚', '。',
      '打', s2, '后', '的', '牌', '形', '在', '漫', '画', '《', '打', '姬', '小', '笨', '蛋', 'miko', '》', '（', '片', '山', 'ま', 'さ', 'ゆ', 'き', '，', '竹', '书', '房', '）', '被', '称', '作', '“', '超', '完', '全', '一', '向', '听', '”', '，', '是', '平', '和', '确', '定', '的', '优', '秀', '形', '状', '，',
      '但', '打', s3, '后', '进', p3, p6, '/', p5, p8, '有', '高', '目', '一', '杯', '口', '，', '期', '待', '值', '更', '高', '。',
      '超', '越', '了', '超', '完', '全', '一', '向', '听', '的', '超', '完', '全', '一', '向', '听', '…', '叫', '作', '“', '超', '完', '全', '一', '向', '听', '2', '”', '吧', '。'
    ]
  },
  {
    id: 148,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, m3, z0, z0, z0, z0],
    images2: [m3, m4, m5, m6, m7, p3, p5, p7, p8, s1, s1, s9, s9, p4],
    answerImg: s1,
    explanation: [
      '面', '子', '已', '经', '够', '了', '，', '狙', '击', '平', '和', '拆', '一', '个', '对', '子', '。',
      '看', '上', '去', '拆', s1, '和', s9, '没', '什', '么', '区', '别', '，', '但', '因', '为', '已', '知', '两', '枚', s9, '的', '位', '置', '，', '尽', '管', '朴', '实', '，', '根', '据', '立', '直', '时', '的', '里', '宝', '期', '待', '值', '还', '是', '打', s1, '更', '有', '利', '。'
    ]
  },
  {
    id: 149,
    round: '东 1 局  东家  4 巡目',
    images1: [z0, z0, s3, z0, z0, z0, z0],
    images2: [m1, m3, m5, m6, m7, m7, m9, p5, p6, s3, s3, s4, s6, m4],
    answerImg: m9,
    explanation: [
      '做', '一', '气', '有', '大', '概', '率', '要', '打', '掉', '宝', '牌', '，', '放', '弃', '。',
      '打', m1, '和', m9, '的', '二', '择', '，', '打', m9, '进', m2, '可', '以', '成', '为', '能', '用', '上', '宝', '牌', '的', '一', '向', '听', '。'
    ]
  },
  {
    id: 150,
    round: '东 1 局  东家  5 巡目',
    images1: [z0, z0, p1, z0, z0, z0, z0],
    images2: [m5, m5, p1, p2, p3, s2, s3, s3, s5, s5, s7, s8, s8, m6],
    answerImg: s8,
    explanation: [
      '虽', '然', '有', '四', '对', '，', '但', '现', '在', '五', '搭', '子', '形', '状', '很', '好', '，', '除', '非', '有', '场', '上', '的', '情', '报', '，', '不', '然', '就', '固', '定', '一', '个', '两', '面', '。',
      '如', '果', '狙', '击', '摸',  m0, '和', '靠', '边', '的', '最', '终', '形', '，', '就', '是', '打', s3, '和', s8, '的', '二', '择', '。',
      '这', '两', '者', '间', '在', '摸', '进', '各', '自', '的', '内', '侧', '牌', '时', '存', '在', '着', '细', '微', '的', '差', '别', '。',
      '留', s3, '进', s4, '的', '一', '向', '听', '时', '，', '有', '着', '打', m6, '或', '者', s3, '的', '选', '择', '权', '。',
      '大', '部', '分', '的', '场', '合', '下', '，', '集', '中', '在', '一', '起', '的', '牌', '形', '后', '来', '变', '为', '好', '形', '的', '情', '况', '很', '常', '见', '。',
      '像', '这', '次', '的', '例', '子', '中', '就', '保', '留', '下', '靠', '近', s5, '对', '子', '的', s3, '。'
    ]
  },
  {
    id: 151,
    round: '南 4 局  南家  7 巡目',
    images1: [z0, z0, m9, z0, z0, z0, z0],
    images2: [p2, p2, p4, p4, p5, p6, p7, s1, s2, s2, s3, s4, s5, p6],
    answerImg: p4,
    explanation: [
      '留', '下', '进', '张', '最', '多', '的', '平', '和', '形', '，', '而', '且', '还', '能', '碰', '听', '。',
      '摸', p3, '可', '以', '打', p6, '成', '为', '形', '状', '更', '好', '的', '一', '向', '听', '。'
    ]
  },
  {
    id: 152,
    round: '南 4 局  南家  5 巡目',
    images1: [z0, z0, m3, z0, z0, z0, z0],
    images2: [m5, m6, m7, m8, m8, p3, p3, p4, p4, p4, p5, p6, s6, s7],
    answerImg: p3,
    explanation: [
      '打', p3, '进', '张', '最', '多', '。',
      '不', '仅', '可', '以', '碰', m8, '，', p4, '也', '可', '以', '。'
    ]
  },
  {
    id: 153,
    round: '南 4 局  南家  5 巡目',
    images1: [z0, z0, m3, z0, z0, z0, z0],
    images2: [m5, m6, m7, m8, m8, p3, p3, p4, p4, p4, p5, p6, s5, s7],
    answerImg: s7,
    explanation: [
      '因', '为', '和', '了', '就', '一', '位', '，', '不', '应', '该', '单', '纯', '看', '进', '张', '数', '，', '而', '要', '根', '据', '“', '鸣', '牌', '效', '率', '重', '视', '”', '选', '择', '打', '什', '么', '牌', '。',
      m8, p3, p4, '碰', '，', p2, p5, p7, '吃', '。',
      p4, '不', '吃', '而', '是', '碰', '。',
      p4, '成', '壁', p3, '更', '容', '易', '出', '+', '摸', p7, '三', '面', '听', '。'
    ]
  },
  {
    id: 154,
    round: '南 4 局  东家  7 巡目',
    images1: [z0, z0, m7, z0, z0, z0, z0],
    images2: [m2, m4, p6, p7, s6, s7, s8, ph, ph, ph, ph, ph, ph, s8],
    images3: [s2, s2, s2],
    images4: [z5, z5, z5],
    answerImg: m4,
    explanation: [
      '单', '纯', '听', '牌', '效', '率', '打', s8, '，', '但', '考', '虑', '到', '包', '括', '鸣', '牌', '在', '内', '的', '和', '牌', '速', '度', '，', '拆', '掉', '最', '弱', '的', '坎', '张', '。',
      '这', '里', '根', '据', '危', '险', '度', '先', '打', '内', '侧', '的', m4, '是', '正', '解', '，', '实', '战', '里', '留', '下', '容', '易', '成', '对', '的', '那', '边', '。'
    ]
  },
  {
    id: 155,
    round: '南 4 局  南家  7 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m7, m8, m9, p3, p5, p5, s4, s6, s7, s8, ph, ph, ph, m7],
    images3: [ z7, z7, z7],
    answerImg: p3,
    explanation: [
      '考', '虑', '到', '坎', '张', '的', '鸣', '牌', '就', '能', '很', '简', '单', '得', '出', '答', '案', '了', '。',
      '剩', '下', '的', '形', '状', '是', '不', '是', '两', '面', '。',
      m8, '和', s5, '必', '吃', '。'
    ]
  },
  {
    id: 156,
    round: '南 4 局  南家  4 巡目',
    images1: [z0, z0, m1, z0, z0, z0, z0],
    images2: [m8, m8, p4, p4, p6, s3, s4, s6, s8, s8, z4, z4, z4, p7],
    answerImg: z4,
    explanation: [
      '和', '了', '就', '一', '位', '，', '拆', '了', '北', '暗', '刻', '向', '断', '幺', '前', '进', '。',
      '实', '际', '上', '有', '六', '个', '搭', '子', '，', '面', '子', '超', '载', '了', '。',
      '断', '幺', '的', '面', '子', '候', '补', '已', '经', '够', '了', '。',
      '虽', '然', '拆', '暗', '刻', '要', '缓', '三', '巡', '，', '但', '相', '对', '地', '确', '定', '了', '断', '幺', '，', '所', '有', '的', '搭', '子', '都', '可', '以', '鸣', '。',
      '按', '吃', '两', '倍', '速', '、', '碰', '四', '倍', '速', '来', '算', '，', '断', '幺', '似', '乎', '更', '快', '。'
    ]
  },
  {
    id: 157,
    round: '南 4 局  南家  7 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m1, m1, m1, p3, p4, p6, p8, s7, s8, s9, s9, z7, z7, z7],
    answerImg: p8,
    explanation: [
      '单', '纯', '听', '牌', '效', '率', '打', s9, '，', '但', '考', '虑', '到', '包', '括', '鸣', '牌', '在', '内', '的', '和', '牌', '速', '度', '，', '拆', '掉', '最', '弱', '的', '坎', '张', '。',
      '随', '手', '从', '内', '侧', '的', p6, '打', '起', '的', '话', '，', '会', '错', '过', '摸', p3, '的', '听', '牌', '机', '会', '，', '需', '要', '注', '意', '。'
    ]
  },
  {
    id: 158,
    round: '南 4 局  南家  9 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m6, m6, m7, m7, m8, p2, p3, p3, p4, p5, p6, p6, p7, p7],
    answerImg: p3,
    explanation: [
      '虽', '然', '想', '做', '两', '杯', '口', '，', '但', '和', '了', '就', '一', '位', '。',
      '打', p3, '进', '张', '最', '多', '，', '而', '且', m6, m7, p6, p7, '四', '种', '牌', '都', '可', '以', '碰', '听', '。'
    ]
  },
  {
    id: 159,
    round: '南 4 局  南家  7 巡目',
    images1: [z0, z0, m4, z0, z0, z0, z0],
    images2: [m6, m6, p2, p3, p4, p4, p4, p5, p5, s7, s8, z7, z7, z7],
    answerImg: p5,
    explanation: [
      '和', '了', '就', '一', '位', '，', '所', '以', '不', '需', '要', '一', '杯', '口', '或', '者', '三', '暗', '刻', '。',
      '选', '择', '可', '以', '吃', '听', '容', '易', '打', '出', '的', p1, '的', '形', '状', '。',
      '打', p5, '进', '张', '最', '多', '，', p1, p3, s6, s9, '吃', '，', m6, p4, '碰', '。',
      '一', '个', '小', '细', '节', '，', '上', '家', '打', p4, '的', '场', '合', '比', '起', '吃', '，', '碰', '更', '好', '。',
      '因', '为', '可', '以', '替', '换', p0, '，', p4, '成', '壁', '也', '更', '利', '于', '防', '守', '。'
    ]
  },
  {
    id: 160,
    round: '南 4 局  西家  7 巡目',
    images1: [z0, z0, z1, z0, z0, z0, z0],
    images2: [m6, m6, m7, m8, p3, p4, p5, s4, s5, s6, s7, z4, z4, p4],
    answerImg: m6,
    explanation: [
      '到', '听', '牌', '的', '单', '纯', '枚', '数', '打', p4, '有', '利', '，', '但', '打', m6, '容', '易', '成', '为', '平', '和', '。',
      '因', '为', '有', '效', '牌', '很', '多', '，', '所', '以', '打', '北', '转', '断', '幺', '慢', '了', '。'
    ]
  },
  {
    id: 161,
    round: '南 4 局  东家  1 巡目',
    images1: [z0, z0, p1, z0, z0, z0, z0],
    images2: [m2, m4, m6, m9, m9, p5, p7, s2, s4, s6, s8, z1, z5, z7],
    answerImg: m9,
    explanation: [
      '打', '掉', '役', '牌', '推', '进', '下', '去', '也', '没', '役', '。',
      '因', '为', '和', '了', '就', '一', '位', '，', '所', '以', '从', '配', '牌', '开', '始', '就', '要', '想', '好', '最', '终', '形', '前', '进', '。',
      '这', '里', '兼', '顾', '断', '幺', '和', '役', '牌', '，', '一', '口', '气', '拆', '掉', m9, '的', '对', '子', '。',
      '虽', '然', '瞬', '间', '失', '去', '了', '雀', '头', '，', '但', '这', '里', '比', '起', '牌', '效', '率', '，', '役', '更', '重', '要', '。'
    ]
  },
  {
    id: 162,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, p7, z0, z0, z0, z0],
    images2: [m2, m2, m3, m6, m7, m8, p3, p4, p5, p8, p8, s4, s4, s6],
    answerImg: m2,
    explanation: [
      '能', '鸣', '到', '宝', '牌', p8, '很', '简', '单', '，', '碰', '不', '出', '就', '没', '什', '么', '牌', '好', '打', '的', '形', '状', '。',
      '因', '为', '三', '雀', '头', '，', '拆', '对', '子', '的', '进', '张', '数', '比', '较', '多', '，', '但', '断', '幺', '不', '确', '定', '。',
      '想', '食', '断', '而', '打', m3, '或', '者', s6, '维', '持', '三', '雀', '头', '好', '像', '不', '错', '，', '但', '愚', '型', '听', '牌', '的', '概', '率', '很', '大', '。',
      '各', '有', '各', '的', '优', '缺', '点', '，', '在', '没', '有', '明', '显', '差', '距', '的', '情', '况', '下', '，', '门', '清', '效', '率', '重', '视', '的', '一', '边', '由', '于', '有', '着', '立', '直', '、', '自', '摸', '、', '里', '宝', '的', '可', '能', '性', '，', '期', '待', '值', '更', '高', '。'
    ]
  },
  {
    id: 163,
    round: '东 1 局  西家  5 巡目',
    images1: [z0, z0, m4, z0, z0, z0, z0],
    images2: [m3, m4, m4, p2, p4, p5, p6, p6, p7, p7, p8, s7, s8, s8],
    answerImg: m4,
    explanation: [
      '摸', '到', '坎', p3, '断', '平', '听', '牌', '。',
      '先', '处', '理', '掉', '将', '来', '很', '可', '怕', '的', '宝', '牌', '表', '示', '牌', '，', '固', '定', '宝', '牌', '进', '张', '。',
      '期', '待', '饼', '子', '和', '索', '子', '的', '变', '化', '。'
    ]
  },
  {
    id: 164,
    round: '东 1 局  东家  6 巡目',
    images1: [z0, z0, s1, z0, z0, z0, z0],
    images2: [m2, m2, m3, m3, m4, m0, m6, m8, p7, p8, s6, s7, s8, m6],
    answerImg: m2,
    explanation: [
      '打', m8, '进', '张', '最', '多', '，', '但', '打', m2, '后', '万', '子', '是', '两', '面', '坎', '张', '亚', '种', '（', '进', '张', m1, m4, m7, '）', '，', '进', m7, '有', '高', '目', '平', '和', '三', '色', '。',
      '而', '且', '手', '里', '有', m0, '，', '不', '管', '怎', '么', '打', '都', '没', '有', '一', '杯', '口', '。'
    ]
  },
  {
    id: 165,
    round: '东 1 局  东家  5 巡目',
    images1: [z0, z0, s3, z0, z0, z0, z0],
    images2: [m1, m2, m2, m6, m8, m8, p4, p6, p6, s2, s3, s7, s8, s9],
    answerImg: m1,
    explanation: [
      '三', '雀', '头', '的', '手', '牌', '。',
      '根', '据', '三', '雀', '头', '最', '弱', '理', '论', '，', '维', '持', '三', '雀', '头', '的', '瞬', '间', '进', '张', '损', '两', '枚', '。',
      '但', '是', '，', '瞬', '间', '进', '张', '最', '大', '而', '拆', '对', '子', '（', '如', '打', p6, '）', '，', '一', '向', '听', '时', '无', '法', '确', '保', '两', '雀', '头', '时', '会', '出', '现', '废', '牌', '，', '进', '张', '数', '容', '易', '逆', '转', '。',
      '这', '次', '的', '牌', '形', '走', '门', '清', '要', '花', '不', '少', '时', '间', '，', '先', '向', '内', '侧', '靠', '拢', '，', '把', '食', '断', '纳', '入', '视', '野', '。'
    ]
  },
  {
    id: 166,
    round: '东 1 局  东家  5 巡目',
    images1: [z0, z0, p7, z0, z0, z0, z0],
    images2: [m1, m1, m3, m6, m7, p4, p4, p6, s3, s4, s6, s6, s8, m0],
    answerImg: m1,
    explanation: [
      '三', '雀', '头', '，', '先', '向', '内', '靠', '拢', '。',
      '瞬', '间', '进', '张', '最', '多', '，', '也', '能', '流', '畅', '地', '移', '向', '断', '幺', '。',
      '万', '一', '上', '家', '打', '赤', '牌', '也', '能', '吃', '。'
    ]
  },
  {
    id: 167,
    round: '东 1 局  西家  6 巡目',
    images1: [z0, z0, m3, z0, z0, z0, z0],
    images2: [m2, m4, m6, p1, p2, p3, s2, s2, s3, s3, s4, s5, s5, s5],
    answerImg: m2,
    explanation: [
      '单', '纯', '进', '张', '打', s2, '最', '多', '。',
      '能', '一', '眼', '看', '出', '的', '人', '很', '厉', '害', '！',
      '打', s2, '不', '仅', '进', '张', '最', '多', '，', '还', '能', '狙', '击', '234', '三', '色', '。',
      '但', '这', '里', '打', m2, '，', '有', '一', '杯', '口', '、', '进', '宝', '牌', '、', '以', '及', '进', m7, '变', '两', '面', '等', '变', '化', '，', '综', '合', '期', '待', '值', '更', '高', '。'
    ]
  },
  {
    id: 168,
    round: '东 1 局  西家  4 巡目',
    images1: [z0, z0, m9, z0, z0, z0, z0],
    images2: [m1, m2, m3, m7, m8, p1, p3, p3, s1, s2, s2, s6, s8, s8],
    answerImg: p3,
    explanation: [
      '明', '显', '可', '以', '狙', '击', '三', '色', '的', '形', '状', '，', '这', '里', '打', p3, '是', '正', '解', '。',
      '看', '上', '去', '打', s6, '既', '能', '狙', '击', '三', '色', '，', '又', '保', '留', '了', '之', '后', '的', '补', '强', '，', '可', '是', '这', '里', '的', '补', '强', '都', '会', '损', '失', '三', '色', '。',
      '现', '在', '打', p3, '的', '话', '，', '瞬', '间', '进', '张', '最', '多', '，', '而', '且', '除', '了', m0, '或', s7, '，', '也', '能', '应', '对', '摸', p4, '。',
      '最', '终', '听', '坎', p2, '的', '时', '候', '也', '很', '强', '。',
      '此', '外', '，', '打', s2, '是', '打', p3, '的', '下', '位', '互', '换', '，', '打', s1, '是', '打', p1, '的', '下', '位', '互', '换', '。'
    ]
  },
  {
    id: 169,
    round: '东 1 局  东家  7 巡目',
    images1: [z0, z0, p4, z0, z0, z0, z0],
    images2: [m2, m3, m7, m8, m8, m8, p2, p3, p4, s1, s2, s3, s4, p5],
    answerImg: s1,
    explanation: [
      '以', '前', '的', '正', '解', '是', '打', m7, '的', '123', '/', '234', '三', '色', '两', '天', '平', '。',
      '但', '在', '有', '赤', '麻', '将', '中', '，', '老', '老', '实', '实', '打', s1, '要', '最', '大', '进', '张', '。',
      '就', '算', '这', '样', '也', '还', '有', '234', '三', '色', '的', '机', '会', '。'
    ]
  },
  {
    id: 170,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, m8, z0, z0, z0, z0],
    images2: [m2, m3, m4, m9, m9, p4, p6, p6, s2, s4, s4, s5, s6, s7],
    answerImg: s4,
    explanation: [
      '宝', '牌', '是', m9, '，', '所', '以', '以', '门', '清', '为', '前', '提', '前', '进', '。',
      '根', '据', '三', '雀', '头', '最', '弱', '理', '论', '，', '这', '里', '拆', '对', '子', '瞬', '间', '进', '张', '最', '多', '。',
      '两', '面', '变', '化', '饼', '子', '有', '两', '种', '，', '索', '子', '有', '三', '种', '，', '故', '打', '索', '子', '。'
    ]
  },
  {
    id: 171,
    round: '东 1 局  东家  5 巡目',
    images1: [z0, z0, z5, z0, z0, z0, z0],
    images2: [m3, m5, m8, m8, p9, p9, s4, s5, s6, s7, s9, z6, z6, z6],
    answerImg: m5,
    explanation: [
      '虽', '然', '有', '三', '雀', '头', '，', '但', '有', '宝', '牌', '役', '牌', '暗', '刻', '，', '考', '虑', '到', '碰', '听', '留', '下', '对', '子', '。',
      '所', '以', '是', m3, m5, '和', s7, s9, '的', '选', '择', '，', '如', '果', '保', '留', '索', '子', '现', '有', '的', '连', '续', '形', '，', '不', '仅', '有', '两', '面', '变', '化', '，', s4, s7, s9, '成', '对', '的', '时', '候', '也', '很', '强', '。',
      '只', '看', '瞬', '间', '的', '两', '面', '变', '化', '数', '而', '打', s9, '的', '话', '，', '进', m8, '/', p9, '的', '时', '候', '只', '能', '听', '坎', m4, '，', '之', '后', '的', '变', '化', '就', '变', '少', '了', '。',
      '期', '待', m3, m5, '变', '化', '成', '靠', '边', '的', '两', '面', '，', '从', m5, '打', '起', '。'
    ]
  },
  {
    id: 172,
    round: '东 1 局  东家  9 巡目',
    images1: [z0, z0, p6, z0, z0, z0, z0],
    images2: [m2, m3, m4, m6, m6, m7, p6, s4, s4, s5, s6, s7, s8, m5],
    answerImg: s8,
    explanation: [
      '活', '用', '索', '子', '三', '面', '听', '必', '须', '要', '有', '雀', '头', '，', '而', '打', s4, '后', '剩', '下', '的', '形', '状', '很', '难', '做', '出', '雀', '头', '。',
      '把', s4, '固', '定', '成', '雀', '头', '，', '老', '实', '地', '狙', '击', '带', '宝', '牌', '的', '三', '色', '靠', '张', '听', '牌', '。',
      '这', '样', '也', '能', '应', '对', '所', '有', '的', '赤', '牌', '。'
    ]
  },
  {
    id: 173,
    round: '东 1 局  南家  7 巡目',
    images1: [z0, z0, p2, z0, z0, z0, z0],
    images2: [p3, p5, p5, p6, p7, s0, s5, s6, s7, s7, s7, s8, s8, p0],
    answerImg: s5,
    explanation: [
      '打', '掉', '宝', '牌', p3, '形', '状', '最', '好', '，', '不', '过', '能', '用', '上', '宝', '牌', '的', '话', '，', '鸣', '牌', '了', '也', '有', '满', '贯', '。',
      '3900', '和', '8000', '点', '的', '差', '别', '很', '大', '，', '尽', '可', '能', '完', '全', '用', '上', '。',
      '打', s5, '虽', '然', '留', '有', '愚', '形', '的', '可', '能', '性', '，', '但', '实', '际', '上', '进', '张', '最', '多', '，', '也', '能', '看', '到', '高', '打', '点', '。',
      '万', '一', '摸', '到', '宝', '牌', p3, '也', '不', '用', '头', '疼', '。'
    ]
  },
  {
    id: 174,
    round: '东 1 局  东家  3 巡目',
    images1: [z0, z0, m1, z0, z0, z0, z0],
    images2: [m2, m3, m3, p1, p3, p3, p7, s2, s3, s4, s8, z4, z4, p2],
    answerImg: s8,
    explanation: [
      '单', '纯', '进', '张', '面', '打', m3, '有', '利', '，', '可', '是', '由', '于', '搭', '子', '不', '足', '，', '不', '用', '急', '着', '固', '定', '宝', '牌', '搭', '子', '。',
      '宝', '牌', '成', '对', '或', '摸', m4, '等', '等', '高', '打', '点', '变', '化', '的', '种', '子', '很', '多', '。',
      '虽', '然', '很', '多', '情', '况', '下', m3, '迟', '早', '还', '是', '要', '打', '掉', '，', '但', '如', '果', '两', '枚', '都', '能', '用', '上', '，', '回', '报', '是', '很', '大', '的', '。'
    ]
  },
  {
    id: 175,
    round: '东 1 局  东家  6 巡目',
    images1: [z0, z0, s6, z0, z0, z0, z0],
    images2: [m2, m2, m3, m7, m8, s5, s6, s6, s7, s7, s7, s9, s9, m6],
    answerImg: m2,
    explanation: [
      '比', '起', '走', '断', '幺', '绕', '远', '路', '，', '打', m2, '的', '进', '张', '也', '有', '24', '枚', '，', '老', '实', '地', '要', '最', '大', '进', '张', '。',
      '即', '使', '打', '掉', '宝', '牌', s7, '打', '点', '也', '足', '够', '了', '。'
    ]
  },
  {
    id: 176,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, m1, z0, z0, z0, z0],
    images2: [m2, m2, m2, m3, m4, m7, m8, p5, p6, s2, s3, s5, s5, m5],
    answerImg: s2,
    explanation: [
      '面', '子', '超', '载', '。',
      '宝', '牌', '三', '，', '因', '此', '以', '鸣', '牌', '为', '前', '提', '向', '内', '侧', '靠', '拢', '。',
      '从', '断', '幺', '不', '确', '定', '的', m7, m8, '和', s2, s3, '两', '个', '搭', '子', '中', '选', '择', '，', '打', s2, '后', '即', '使', '摸', '进', '失', '张', s4, '也', '可', '以', '打', s5, '，', '变', '成', '进', '张', '面', '更', '广', '的', '一', '向', '听', '。'
    ]
  },
  {
    id: 177,
    round: '东 1 局  西家  7 巡目',
    images1: [z0, z0, s1, z0, z0, z0, z0],
    images2: [m1, m2, m3, p2, p3, s2, s2, s3, s3, s4, s5, s6, s6, p3],
    answerImg: p3,
    explanation: [
      '索', '子', '形', '状', '比', '较', '特', '别', '，', '是', '含', '有', '一', '杯', '口', '的', '连', '续', '形', '。',
      '乍', '一', '看', '打', s5, '的', '完', '全', '一', '向', '听', '进', '张', '不', '错', '，', '但', '打', p3, '比', '打', s5, '进', '张', '更', '多', '，', '而', '且', '摸', '宝', '牌', s2, '也', '可', '以', '听', '牌', '。',
      '此', '外', '，', '单', '纯', '进', '张', '面', '上', '打', s6, '最', '广', '，', '不', '过', '饼', '子', '先', '完', '成', '时', '会', '变', '成', '对', '碰', '听', '牌', '。'
    ]
  },
  {
    id: 178,
    round: '东 1 局  西家  9 巡目',
    images1: [z0, z0, m8, z0, z0, z0, z0],
    images2: [m3, m4, p2, p2, p0, p6, p6, p7, s3, s3, s0, s6, s6, s7],
    answerImg: s6,
    explanation: [
      '已', '经', '第', '9', '巡', '，', '拆', '对', '子', '退', '回', '两', '向', '听', '太', '慢', '了', '。',
      '打', p6, '或', '者', s6, '要', '最', '大', '进', '张', '。',
      '看', '上', '去', '打', '哪', '个', '都', '一', '样', '，', '但', '打', s6, '摸', '回', s4, '或', s8, '仍', '然', '是', '连', '续', '形', '，', '更', '容', '易', '做', '出', '面', '子', '。'
    ]
  },
  {
    id: 179,
    round: '东 1 局  西家  3 巡目',
    images1: [z0, z0, m8, z0, z0, z0, z0],
    images2: [m5, m6, p1, p1, p4, p5, p5, p6, s1, s1, s5, s6, s6, s7],
    answerImg: p1,
    explanation: [
      '推', '进', '一', '步', '之', '后', '的', '牌', '效', '率', '，', '被', '称', '为', '二', '阶', '段', '牌', '效', '率', '。',
      '还', '是', '序', '盘', '，', '拆', '对', '子', '狙', '击', '立', '平', '三', '色', '。',
      '看', '上', '去', '拆', '哪', '个', '对', '子', '都', '一', '样', '，', '但', '打', p1, '摸', p3, '会', '变', '为', p1, p3, p4, p5, p5, p6, '的', '两', '面', '坎', '张', '形', '。'
    ]
  },
  {
    id: 180,
    round: '东 1 局  西家  5 巡目',
    images1: [z0, z0, s1, z0, z0, z0, z0],
    images2: [m4, m0, m5, m7, p3, p6, p6, p7, p8, p8, s2, s3, s4, p5],
    answerImg: p3,
    explanation: [
      m7, '或', p3, '的', '二', '择', '，', '摸', '入', '各', '自', '内', '侧', '牌', '时', '会', '产', '生', '差', '别', '。',
      '打', m7, '进', p4, '是', '坎', '张', '听', '牌', '，', '而', '打', p3, '进', m6, '是', '两', '面', '听', '牌', '。',
      m4, m5, m5, m7, '中', '打', m7, '是', '常', '识', '，', '能', '够', '掌', '握', '其', '中', '例', '外', '的', '话', '就', '能', '更', '加', 'power', 'up', '！'
    ]
  },
  {
    id: 181,
    round: '东 1 局  西家   3 巡目',
    images1: [z0, z0, s3, z0, z0, z0, z0],
    images2: [m5, m7, m9, p1, p1, p2, p2, p6, p7, s4, s4, s5, s6, m4],
    answerImg: p1,
    explanation: [
      '六', '搭', '子', '，', '这', '里', '想', '转', '向', '狙', '击', '食', '断', '。',
      m7, m9, '的', '坎', '张', '搭', '子', '大', '概', '率', '还', '是', '会', '打', '掉', '，', '但', '直', '接', '摸', '进', m8, '的', '话', '就', '是', '立', '平', '的', '一', '向', '听', '，',
      '所', '以', '从', '打', p1, '开', '始', '。'
    ]
  },
  {
    id: 182,
    round: '东 1 局  东家   4 巡目',
    images1: [z0, z0, p7, z0, z0, z0, z0],
    images2: [m4, m4, m5, p4, p5, p6, s4, s4, s5, s5, s6, s7, s7, s4],
    answerImg: m4,
    explanation: [
      '牌', '形', '来', '自', '漫', '画', '《', '満', '潮', '！', 'ツ', 'モ', 'ク', 'ラ', 'テ', 'ス', '》', '（', '片', '山', 'ま', 'さ', 'ゆ', 'き', '，', '竹', '书', '房', '）', '。',
      '虽', '然', '是', '亲', '，', '但', '有', '很', '多', '好', '形', '变', '化', '，', '甚', '至', '可', '能', '有', '三', '色', '，', '因', '此', '想', '拒', '听', '。',
      '打', s7, '要', '进', '张', '数', '，', '打', m4, '要', '三', '色', '，', '和', '打', s4, '要', '一', '杯', '的', '三', '择', '，',
      '根', '据', '进', '张', '数', '和', '打', '点', '的', '平', '衡', '，', '打', m4, '较', '好', '。'
    ]
  },
  {
    id: 183,
    round: '东 1 局  东家   4 巡目',
    images1: [z0, z0, p9, z0, z0, z0, z0],
    images2: [m2, m3, m6, m8, p2, p3, p4, p4, p6, s7, s9, z7, z7, p1],
    answerImg: m8,
    explanation: [
      '含', '有', '役', '牌', '的', '六', '搭', '。', '根', '据', '五', '搭', '子', '理', '论', '，', '这', '里', '锁', '定', '更', '强', '的', '五', '搭', '比', '较', '好', '（', '鸣', '中', '之', '后', '也', '不', '打', p6, '）', '。',
      m6, m8, '和', s7, s9, '的', '二', '择', '，', '门', '清', '听', '牌', '时', '即', '立', '的', '可', '能', '性', '很', '大', '，',
      '因', '此', '留', '下', '做', '为', '最', '终', '形', '容', '易', '荣', '和', '的', '一', '边', '。'
    ]
  },
  {
    id: 184,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, m3, z0, z0, z0, z0],
    images2: [m6, m7, p3, p4, p6, p7, p8, s1, s2, s3, ph, ph, ph, s3],
    images3: [z7, z7, z7],
    answerImg: s2,
    explanation: [
      '鸣', '牌', '手', '两', '面', '×', '两', '面', '的', '形', '状', '。',
      '打', s3, '固', '定', '面', '子', '的', '话', '，', '吃', '之', '后', '只', '能', '单', '骑', '听', '牌', '。',
      '考', '虑', '吃', '听', '两', '倍', '速', '，', '这', '里', '做', '两', '面', '×', '两', '面', '的', '决', '定', '打', '是', '基', '本', '。'
    ]
  },
  {
    id: 185,
    round: '东 1 局  东家   3 巡目',
    images1: [z0, z0, m8, z0, z0, z0, z0],
    images2: [m7, m8, m9, p1, p3, p5, p6, p8, p9, s3, s3, s0, s5, s6],
    answerImg: p9,
    explanation: [
      p1, '和', p9, '的', '选', '择', '，', '打', '掉', p9, '后', '饼', '子', '进', '张', '是', p2, p4, p7, '。',
      '这', '里', '进', p4, '后', '是', p2, p7, '进', '张', '的', '相', '离', '两', '坎', '，', '进', p7, '是', p2, p4, '进', '张', '的', '两', '坎', '。',
      '请', '记', '住', '这', '个', '很', '常', '见', '的', '形', '状', '。'
    ]
  },
  {
    id: 186,
    round: '东 1 局  西家   6 巡目',
    images1: [z0, z0, m3, z0, z0, z0, z0],
    images2: [m3, m4, m4, m6, m8, p2, p3, p4, p7, p8, p8, p9, p9, p5],
    answerImg: p9,
    explanation: [
      '想', '维', '持', '一', '向', '听', '而', '打', m3, '，', '但', '在', '门', '清', '前', '提', '下', '保', '留', '愚', '型', '很', '难', '受', '。',
      '这', '里', '放', '弃', '一', '杯', '口', '，', '狙', '击', '一', '气', '或', '者', '食', '断', '。',
      '只', '看', '形', '状', '想', '打', p8, '，', '可', '是', '摸', '进', '大', '部', '分', '饼', '子', '后', '还', '是', '要', '打', p9, '。',
      '那', '不', '如', '先', '打', '掉', p9, '了', '（', '特', '别', '是', '摸', '进', p6, '形', '状', '很', '强', '）', '。'
    ]
  },
  {
    id: 187,
    round: '东 1 局  西家   8 巡目',
    images1: [z0, z0, s7, z0, z0, z0, z0],
    images2: [m3, m3, p2, p3, p4, p5, p8, p9, s3, s4, s7, s8, s9, p8],
    answerImg: p5,
    explanation: [
      '一', '向', '听', '要', '最', '大', '进', '张', '面', '。',
      '成', '为', '对', '碰', '听', '牌', '的', '时', '候', '，', '打', p5, '可', '以', '引', '挂', '。'
    ]
  },
  {
    id: 188,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, p3, z0, z0, z0, z0],
    images2: [m3, m5, m7, p4, p0, p6, s3, s5, s5, s6, s6, s7, s8, m4],
    answerImg: s3,
    explanation: [
      '打', s6, '进', '张', '最', '多', '，', '但', '考', '虑', '到', '最', '终', '形', '打', s3, '更', '有', '利', '。',
      '打', s3, '和', s6, '的', '进', '张', '数', '和', '其', '他', '打', '牌', '候', '补', '的', '差', '距', '很', '大', '，',
      '是', '因', '为', s3, s6, '筋', '牌', '进', '张', '重', '复', '了', '。'
    ]
  },
  {
    id: 189,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, s7, z0, z0, z0, z0],
    images2: [m3, m4, m4, m5, m6, p1, p1, p2, p3, s6, s6, s7, s8, s8],
    answerImg: p1,
    explanation: [
      s7, '是', '宝', '牌', '指', '示', '牌', '比', '较', '讨', '厌', '，', '尽', '管', '如', '此', '进', '张', '数', '差', '太', '多', '，',
      '比', '起', '打', '索', '子', '还', '是', '打', p1, '更', '好', '。',
      '不', '过', '最', '终', '听', '在', '坎', s7, '上', '的', '概', '率', '很', '高', '，', '听', '牌', '率', '虽', '然', '差', '很', '多', '，', '和', '牌', '率', '差', '别', '不', '大', '。'
    ]
  },
  {
    id: 190,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, m7, z0, z0, z0, z0],
    images2: [m2, m3, m6, m7, p5, p5, p6, p7, s6, s6, s7, s7, s8, m8],
    answerImg: p5,
    explanation: [
      '虽', '然', '三', '色', '没', '了', '，', '但', '有', '效', '牌', '的', '枚', '数', '和', '其', '他', '牌', '差', '太', '多', '。',
      '不', '管', '进', '什', '么', '牌', '都', '是', '带', '宝', '牌', m8, '的', '有', '役', '听', '牌', '，', '足', '够', '了', '。',
      '摸', '到', p8, '仍', '然', '有', '三', '色', '机', '会', '。'
    ]
  },
  {
    id: 191,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, p5, z0, z0, z0, z0],
    images2: [m2, m2, p4, p5, s2, s3, s4, s4, s5, s6, s7, s7, s8, s1],
    answerImg: s7,
    explanation: [
      s1, s4, s7, '随', '便', '打', '哪', '个', '都', '是', '一', '向', '听', '，', '但', '打', s1, '就', '没', '一', '气', '了', '。',
      s4, s7, '的', '比', '较', '，', '打', s4, '进', s3, '要', '不', '了', '断', '幺', '。',
      '可', '以', '同', '时', '对', '应', '一', '气', '和', '断', '幺', '的', '打', s7, '是', '正', '解', '。'
    ]
  },
  {
    id: 192,
    round: '东 1 局  西家   5 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m4, m5, m7, m8, p6, p7, p8, s5, s6, s7, s7, s8, s9, m6],
    answerImg: s9,
    explanation: [
      '变', '化', '很', '多', '，', '可', '以', '狙', '击', '断', '平', '、', '三', '色', '等', '高', '打', '点', '，', '推', '荐', '拒', '听', '。',
      '拒', '听', '的', '话', '是', '打', s7, '和', s9, '的', '二', '择', '。',
      '比', '较', '两', '者', '的', '条', '件', '，', '进', '张', '数', '一', '样', '。',
      '三', '色', '的', '可', '能', '性', '上', '，', '打', s7, '仅', '多', '一', '枚', '。',
      '但', '是', '附', '加', '断', '幺', '的', '可', '能', '性', '上', '差', '距', '很', '大', '。',
      '打', s9, '摸', s5, '/', s7, '带', '三', '色', '听', '牌', '的', '时', '候', '，', '可', '以', '选', '择', '“', '暗', '听', '狙', '击', '高', '目', '满', '贯', '”', '或', '者', '“', '立', '直', '狙', '击', '跳', '满', '”', '。'
    ]
  },
  {
    id: 193,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, p5, z0, z0, z0, z0],
    images2: [m6, m6, m7, p2, p2, p4, p4, p5, p6, p6, s2, s3, s4, p7],
    answerImg: p4,
    explanation: [
      '因', '为', '有', '一', '杯', '口', '所', '以', '想', '打', m6, '，', '但', '打', '了', m6, '后', '进', p2, p4, '得', '打', '掉', '宝', '牌', p6, '。',
      '所', '以', '还', '是', '固', '定', '宝', '牌', '搭', '子', '。'
    ]
  },
  {
    id: 194,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, m7, z0, z0, z0, z0],
    images2: [m4, m6, m6, p3, p3, p5, p7, p7, p8, p9, s5, s5, s7, p8],
    answerImg: s7,
    explanation: [
      '有', '没', '有', '注', '意', '到', '七', '对', '子', '一', '向', '听', '的', '问', '题', '。',
      '虽', '也', '能', '看', '到', '面', '子', '手', '，', '但', '走', '面', '子', '全', '是', '坎', '张', '，', '还', '是', '以', '七', '对', '为', '本', '线', '。',
      '考', '虑', '到', '赤', '牌', '的', '进', '张', '，', '根', '据', '排', '除', '法', '打', s7, '比', '较', '好', '。'
    ]
  },
  {
    id: 195,
    round: '东 1 局  西家   4 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m2, m4, m6, m8, p2, p2, p8, p8, s2, s4, s4, s0, s6, m7],
    answerImg: m2,
    explanation: [
      m2, '/', p2, '/', p8, '/', s2, '中', '选', '择', '。',
      '根', '据', '两', '雀', '头', '理', '论', '，', '留', '下', '成', '刻', '很', '强', '，', '进', '内', '侧', '可', '以', '转', '两', '面', '的', '对', '子', '组', '合', '。',
      '因', '此', '问', '题', '在', '于', '拆', '万', '子', '还', '是', '索', '子', '的', '坎', '张', '更', '好', '。',
      '万', '子', '进', '内', '侧', '的', m5, '变', '成', '三', '面', '，', '但', '进', m9, '就', '没', '断', '幺', '有', '点', '微', '妙', '。',
      '索', '子', '进', '内', '侧', '的', s5, '当', '然', '很', '强', '，', '进', s4, s6, s7, '时', '也', '有', '厚', '味', '。'
    ]
  },
  {
    id: 196,
    round: '东 1 局  东家   6 巡目',
    images1: [z0, z0, s4, z0, z0, z0, z0],
    images2: [m3, m4, m5, m6, m7, m7, p3, p4, p4, p5, p6, p8, s3, s5],
    answerImg: m6,
    explanation: [
      '不', '仅', p5, '，', '摸', p7, '也', '有', '三', '色', '，', '不', '要', '看', '漏', '了', '。'
    ]
  },
  {
    id: 197,
    round: '东 1 局  东家   4 巡目',
    images1: [z0, z0, m2, z0, z0, z0, z0],
    images2: [m2, m3, m4, m6, m7, m7, p3, p3, p4, p5, s6, s7, s8, s8],
    answerImg: s8,
    explanation: [
      '打', s8, '好', '形', '听', '牌', '率', '最', '高', '，', '和', '率', '、', '期', '待', '值', '最', '大', '。',
      '因', '为', '有', '宝', '牌', '1', '，', '摸', p1, '也', '可', '以', '坎', '张', '立', '直', '。'
    ]
  },
  {
    id: 198,
    round: '东 1 局  东家   8 巡目',
    images1: [z0, z0, z6, z0, z0, z0, z0],
    images2: [p6, p6, p7, p8, p9, s3, s5, s6, s7, s7, s7, z7, z7, s2],
    answerImg: p6,
    explanation: [
      '6', '搭', '的', '面', '子', '超', '载', '，', '所', '以', '这', '里', '留', '强', '力', '的', '五', '搭', '是', '基', '本', '。',
      '虽', '然', '不', '管', '打', '什', '么', '，', '只', '要', '能', '鸣', '到', '中', '似', '乎', '就', '能', '和', '出', '，', '但', '已', '经', '第', '8', '巡', '了', '，',
      '还', '是', '设', '想', '下', '鸣', '不', '到', '的', '情', '况', '比', '较', '好', '。',
      '索', '子', '的', '“', '进', '张', '”', '和', '“', '最', '终', '形', '”', '都', '很', '强', '，', '因', '此', '不', '动', '。',
      '因', '为', '红', p5, '还', '没', '见', '，', '所', '以', p6, p6, p7, p8, p9, '中', '要', '留', '下', p6, p7, p8, '的', '面', '子', '。',
      '因', '此', '这', '里', '打', p6, '或', p9, '，', '考', '虑', '危', '险', '度', '先', '打', p6, '。'
    ]
  },
  {
    id: 199,
    round: '东 1 局  西家   6 巡目',
    images1: [z0, z0, p7, z0, z0, z0, z0],
    images2: [p2, p2, p2, p3, p5, p7, s1, s2, s3, s5, s6, s7, s8, p1],
    answerImg: p5,
    explanation: [
      '变', '化', '很', '多', '，', '这', '里', '拒', '听', '。',
      '打', p5, '兼', '顾', '一', '气', '和', '宝', '牌', '进', '张', '。',
      '无', '宝', '牌', '的', '坎', '张', '即', '立', '是', '通', '往', '地', '狱', '的', '单', '程', '车', '票', '。', '躲', '开', '吧', '。'
    ]
  },
  {
    id: 200,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, p4, z0, z0, z0, z0],
    images2: [m2, m4, m6, m8, m8, m8, p3, p4, p0, p6, p7, s2, s3, s4],
    answerImg: m2,
    explanation: [
      '亲', '家', '第', '7', '巡', '已', '经', '确', '定', '了', '起', '码', '断', '幺', '宝', '牌', '2', '，', '比', '起', '三', '色', '更', '应', '该', '优', '先', '根', '据', '“', '进', '张', '面', '”', '和', '“', '最', '终', '形', '”', '来', '选', '择', '出', '牌', '。',
      '此', '外', '，', '饼', '子', '的', '形', '状', '很', '好', '，', '做', '成', '三', '色', '的', '概', '率', '不', '高', '。',
      '因', '此', '，', '万', '子', '想', '留', '下', m6, m8, m8, m8, '的', '变', '则', '两', '面', '听', '。'
    ]
  },
  {
    id: 201,
    round: '东 1 局  东家   3 巡目',
    images1: [z0, z0, p8, z0, z0, z0, z0],
    images2: [m2, m4, m7, m8, p2, p4, p9, p9, p9, s1, s1, s4, s4, m6],
    answerImg: p2,
    explanation: [
      '面', '子', '超', '载', '。', '根', '据', '五', '搭', '子', '理', '论', '拆', '掉', '最', '弱', '的', '搭', '子', '。',
      s4, '对', '子', '有', '两', '种', '两', '面', '变', '化', '，', '是', '优', '秀', '的', '搭', '子', '。',
      s1, '是', s4, '两', '面', '变', '化', '时', '的', '雀', '头', '，', '所', '以', '和', s4, '配', '套', '留', '下', '（', '两', '雀', '头', '理', '论', '）', '。',
      '剩', '下', m2, m4, '和', p2, p4, '的', '选', '择', '，', m2, m4, '进', m5, '变', '为', '三', '面', '听', '时', '更', '强', '。',
      '因', '此', '，', '拆', '掉', '最', '弱', '搭', '子', p2, p4, '从', '外', '侧', '打', p2, '是', '正', '解', '。'
    ]
  },
  {
    id: 202,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, s6, z0, z0, z0, z0],
    images2: [m3, m3, m5, m5, m5, p2, p3, p3, p4, s2, s2, s6, s7, p1],
    answerImg: s2,
    explanation: [
      '“', '居', '然', '发', '现', '了', '打', '点', '上', '升', '的', '种', '子', '！', '”',
      m3, '和', s2, '的', '比', '较', '，', '打', s2, '进', m4, '时', '可', '以', '附', '加', '平', '和', '。'
    ]
  },
  {
    id: 203,
    round: '东 1 局  东家   3 巡目',
    images1: [z0, z0, s9, z0, z0, z0, z0],
    images2: [m2, m3, m3, m4, m7, p3, s1, s2, s2, s3, s3, s8, s9, s9],
    answerImg: s8,
    explanation: [
      '已', '经', '确', '保', '了', '三', '个', '面', '子', '，', '也', '有', '雀', '头', '，', '基', '本', '问', '题', '其', '实', '是', '剩', '下', '的', '一', '个', '面', '子', '在', '哪', '里', '靠', '张', '找', '。',
      '狙', '击', m3, '/', m7, '/', p3, '的', '靠', '张', '是', '正', '解', '。'
    ]
  },
  {
    id: 204,
    round: '东 1 局  西家   5 巡目',
    images1: [z0, z0, p4, z0, z0, z0, z0],
    images2: [m3, m4, p2, p3, p3, p4, p5, p6, p6, p7, s2, s2, s3, m4],
    answerImg: p3,
    explanation: [
      '可', '以', '狙', '击', m2, p3, s4, '三', '色', '的', '形', '状', '。',
      '因', '为', '宝', '牌', '是', p5, '，', '打', p3, '既', '保', '留', '了', '三', '色', '的', '可', '能', '性', '，', '也', '活', '用', '了', '宝', '牌', '进', '张', '，', '进', '张', '面', '、', '期', '待', '值', '都', '是', '最', '大', '的', '。',
      '打', m4, '也', '是', '柔', '软', '的', '一', '打', '，', '但', '进', m5, '失', '去', '三', '色', '时', '的', '形', '状', '比', '打', p3, '要', '差', '（', '打', p3, '时', '，', '摸', m5, '打', s3, '是', '绝', '好', '的', '一', '向', '听', '）', '。',
      '这', '题', '相', '当', '难', '，', '不', '过', '解', '法', '也', '有', '小', '窍', '门', '。',
      '要', '做', '成', '完', '全', '一', '向', '听', '需', '要', '维', '持', '两', '个', '雀', '头', '前', '进', '。',
      '想', '活', '用', '宝', '牌', p5, '，', '怎', '么', '用', '它', '周', '边', '的', '牌', '就', '成', '为', '了', '重', '点', '，',
      '把', p5, p6, p6, p7, '的', '部', '分', '当', '作', '中', '膨', '形', '来', '考', '虑', '的', '话', '，', p6, '筋', '牌', '的', p3, '就', '浮', '现', '成', '了', '选', '项', '。',
      '之', '后', '去', '验', '证', '这', '个', '选', '项', '对', '不', '对', '便', '可', '。'
    ]
  },
  {
    id: 205,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, m8, z0, z0, z0, z0],
    images2: [m0, m6, m7, p1, p1, p2, p3, p5, p6, p7, p7, s2, s4, s4],
    answerImg: p1,
    explanation: [
      p4, '进', '张', '重', '复', '了', '，', '打', p1, '进', '张', '最', '多', '。',
      '看', '不', '见', '坎', '张', '或', '者', '边', '张', '做', '为', '最', '终', '形', '的', '一', '杯', '口', '。'
    ]
  },
  {
    id: 206,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, z6, z0, z0, z0, z0],
    images2: [p4, p4, p4, p5, p7, p9, p9, s4, s5, s7, s9, z7, z7, s6],
    answerImg: p5,
    explanation: [
      '乍', '看', '上', '去', '饼', '子', '形', '状', '很', '复', '杂', '，', '如', '果', '能', '设', '想', '出', '鸣', '完', '中', '之', '后', '的', '形', '状', '，', '应', '该', '能', '立', '即', '做', '出', '回', '答', '。',
      '饼', '子', '先', '进', '张', '的', '话', '，', '坎', s8, '即', '立', '相', '当', '实', '战', '。',
      '不', '论', '是', '两', '雀', '头', '理', '论', '，', '还', '是', '弱', '搭', '子', '三', '枚', '构', '成', '理', '论', '，', '都', '导', '向', '打', p5, '的', '一', '题', '。'
    ]
  },
  {
    id: 207,
    round: '东 1 局  西家   5 巡目',
    images1: [z0, z0, p4, z0, z0, z0, z0],
    images2: [p3, p4, p6, p7, s1, s1, s2, s3, s7, s8, s8, s9, s9, p5],
    answerImg: s8,
    explanation: [
      '类', '似', '这', '样', '雀', '头', '不', '明', '确', '的', '形', '状', '，', '通', '常', '打', s1, '拆', '亚', '两', '面', '都', '是', '没', '有', '问', '题', '的', '，', '但', '这', '次', '有', '点', '不', '同', '。',
      '饼', '子', '三', '面', '听', '，', '正', '中', '是', '宝', '牌', '，', '因', '此', '想', '最', '大', '限', '度', '活', '用', '这', '个', '形', '状', '。',
      '打', s8, '确', '定', '了', '平', '和', '，', '最', '终', '形', '是', '三', '面', '听', '的', '可', '能', '性', '也', '很', '高', '。',
      '单', '纯', '进', '张', '数', '上', '不', '如', '打', s1, '，', '但', '和', '率', '最', '大', '。',
      '预', '估', '的', '打', '点', '也', '不', '同', '，', '总', '和', '期', '待', '值', '最', '大', '。'
    ]
  },
  {
    id: 208,
    round: '东 1 局  东家   5 巡目',
    images1: [z0, z0, m4, z0, z0, z0, z0],
    images2: [m2, m3, m7, m7, m8, p3, p4, s1, s2, s3, s5, s7, s9, s6],
    answerImg: m8,
    explanation: [
      '好', '形', '一', '向', '听', '。',
      m8, '和', s9, '的', '比', '较', '，', '索', '子', '有', '一', '气', '，', '所', '以', '先', '打', m8, '。'
    ]
  },
  {
    id: 209,
    round: '东 1 局  东家   5 巡目',
    images1: [z0, z0, m1, z0, z0, z0, z0],
    images2: [m2, m3, m6, m7, m7, p3, p4, s1, s2, s3, s5, s7, s9, s6],
    answerImg: s9,
    explanation: [
      '面', '子', '候', '补', '够', '了', '，', '打', m6, '留', '下', '一', '气', '可', '能', '也', '没', '问', '题', '。',
      '但', '是', '备', '着', '摸', m0, '，', '推', '荐', '打', s9, '的', '贪', '心', '打', '法', '。',
      '这', '样', '摸', '宝', '牌', m2, '也', '可', '以', '替', '换', '雀', '头', '。',
      '实', '战', '中', '和', '安', '牌', '的', '替', '换', '时', '机', '上', '可', '以', '看', '出', '实', '力', '的', '差', '距', '。'
    ]
  },
  {
    id: 210,
    round: '东 1 局  南家   3 巡目',
    images1: [z0, z0, m8, z0, z0, z0, z0],
    images2: [m4, m0, m6, m7, p5, s2, s4, s0, s5, s6, s6, s6, s8, p0],
    answerImg: s2,
    explanation: [
      '即', '使', '是', '愚', '形', '也', '要', '最', '快', '听', '牌', '就', '打', m7, '，', '但', '巡', '目', '尚', '早', '，', '想', '打', s2, '或', s8, '期', '待', '万', '子', '的', '延', '伸', '。',
      '比', '较', '这', '两', '者', '，', '打', s2, '进', s7, '时', '两', '面', '听', '牌', '。',
      '打', s8, '进', s3, '时', '对', '碰', '听', '牌', '。',
      '此', '外', '，', '打', s2, '进', s3, '时', '，', '打', s8, '可', '以', '在', '振', '听', '的', '同', '时', '变', '为', '进', '张', '面', '更', '广', '的', '一', '向', '听', '，',
      '而', '打', s8, '进', s7, '只', '是', '纯', '粹', '的', '失', '张', '。'
    ]
  },
  {
    id: 211,
    round: '东 1 局  东家   5 巡目',
    images1: [z0, z0, p7, z0, z0, z0, z0],
    images2: [m2, m4, p1, p1, p6, p7, s1, s2, s3, s5, s6, s8, s8, s9],
    answerImg: m2,
    explanation: [
      '现', '在', '是', '面', '子', '超', '载', '的', '两', '向', '听', '。',
      '根', '据', '一', '向', '听', '顶', '峰', '理', '论', '，', '目', '标', '是', '带', '有', '一', '气', '的', '厚', '实', '一', '向', '听', '。'
    ]
  },
  {
    id: 212,
    round: '东 1 局  西家   4 巡目',
    images1: [z0, z0, m7, z0, z0, z0, z0],
    images2: [m3, m3, m4, m5, m6, m8, m9, p5, p6, p6, p7, s2, s4, m3],
    answerImg: m9,
    explanation: [
      '如', '果', '能', '想', '到', m3, m3, m3, m4, m5, m6, m8, '的', '变', '则', '两', '面', '听', '就', '能', '立', '即', '作', '答', '。',
      '这', '里', '即', '使', '打', '掉', m9, '，', m7, m8, '也', '有', '作', '用', '。',
      '索', '子', '坎', '张', '直', '接', '进', '张', '的', '话', '打', p6, '即', '立', '。'
    ]
  },
  {
    id: 213,
    round: '东 1 局  东家   5 巡目',
    images1: [z0, z0, m2, z0, z0, z0, z0],
    images2: [m1, m2, m3, p2, p4, p0, p6, p7, p9, s2, s3, s4, s5, s7],
    answerImg: p2,
    explanation: [
      '宝', '牌', '2', '的', '一', '向', '听', '。',
      '因', '为', '是', '亲', '，', '即', '使', '愚', '形', '听', '牌', '也', '想', '先', '制', '立', '直', '。',
      '一', '边', '靠', '向', '内', '侧', '一', '边', '看', '着', '三', '色', '打', p9, '貌', '似', '没', '什', '么', '问', '题', '，',
      '但', '是', '比', '起', '三', '色', '，', '先', '听', '牌', '的', '时', '候', '比', '较', '多', '，',
      '考', '虑', '到', '最', '终', '形', '是', '饼', '子', '的', '情', '况', '，', '打', p2, '留', '下', '靠', '边', '的', '听', '牌', '是', '正', '解', '。'
    ]
  },
  {
    id: 214,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m6, m7, m8, m9, p1, p1, p1, p2, p4, s4, s0, s7, s7, s7],
    answerImg: p4,
    explanation: [
      '单', '纯', '的', '进', '张', '数', '打', m9, '最', '多', '，', '但', '坎', p3, '的', '最', '终', '形', '不', '舒', '服', '。',
      '打', p4, '必', '定', '好', '形', '听', '牌', '。'
    ]
  },
  {
    id: 215,
    round: '东 1 局  东家   9 巡目',
    images1: [z0, z0, m6, z0, z0, z0, z0],
    images2: [m3, m3, m4, m7, m7, p5, p7, p7, s1, s1, s6, s7, s8, p6],
    answerImg: m3,
    explanation: [
      '虽', '想', '拆', s1, '对', '子', '走', '断', '幺', '，', '但', '已', '经', '第', '9', '巡', '了', '。',
      '固', '定', '两', '面', '只', '留', '下', '好', '形', '的', '最', '终', '形', '，', '继', '续', '维', '持', '一', '向', '听', '。',
      p7, '靠', '上', '张', '了', '拆', s1, '。',
      '宝', '牌', m7, '当', '然', '碰', '，', '可', '能', '的', '话', p6, '也', '想', '吃', '。'
    ]
  },
  {
    id: 216,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, m1, z0, z0, z0, z0],
    images2: [m2, m3, m4, m4, p5, p6, p7, p8, s3, s4, s5, s6, s7, s3],
    answerImg: m4,
    explanation: [
      '像', '下', '面', '这', '样', '拆', '解', '出', '来', '就', '容', '易', '理', '解', '了', '。', m2, m3, m4, m4, '+', p5, p6, p7, p8, '+', s3, s3, '+', s4, s5, s6, s7, '。',
      '索', '子', '的', '部', '分', '是', '不', '管', '做', '“', '雀', '头', '+', '面', '子', '”', '还', '是', '“', '两', '个', '面', '子', '”', '都', '可', '以', '的', '好', '形', '，',
      '延', '伸', '之', '后', '也', '有', '“', '雀', '头', '+', '两', '个', '面', '子', '”', '的', '可', '能', '。',
      '亚', '两', '面', '和', '四', '连', '形', '相', '比', '，', '四', '连', '形', '更', '强', '，',
      '含', '有', '这', '种', '好', '形', '的', '场', '合', '，', '拆', '亚', '两', '面', '高', '概', '率', '是', '正', '解', '。'
    ]
  },
  {
    id: 217,
    round: '东 1 局  西家   5 巡目',
    images1: [z0, z0, m4, z0, z0, z0, z0],
    images2: [m2, m3, m3, m0, p3, p4, p5, p6, p6, s5, s6, s7, s8, p7],
    answerImg: s8,
    explanation: [
      '看', '上', '去', '打', m2, '退', '向', '听', '不', '错', '，', '但', m0, '是', '不', '能', '打', '掉', '的', '，', '即', '使', '索', '子', '延', '伸', '了', '也', '毫', '无', '意', '义', '。',
      '这', '里', '打', '索', '子', '是', '正', '解', '，', '不', '放', '过', '摸', m4, '的', '听', '牌', '。'
    ]
  },
  {
    id: 218,
    round: '东 1 局  东家   5 巡目',
    images1: [z0, z0, p4, z0, z0, z0, z0],
    images2: [m2, m2, m5, m5, p4, p5, s2, s3, s5, s6, s6, s7, s8, s9],
    answerImg: m2,
    explanation: [
      '根', '据', '五', '搭', '子', '理', '论', '，', '拆', '一', '个', '弱', '搭', '。',
      '打', '掉', '改', '良', '较', '少', '的', 'm2', '。',
      '打', s6, '不', '仅', '是', '六', '搭', '，', s4, '还', '重', '复', '进', '张', '了', '，', '不', '要', '这', '样', '打', '。'
    ]
  },
  {
    id: 219,
    round: '东 1 局  西家   4 巡目',
    images1: [z0, z0, s8, z0, z0, z0, z0],
    images2: [m3, m5, m6, m7, p3, p3, p4, p4, p7, p8, s2, s4, s4, p9],
    answerImg: s2,
    explanation: [
      '摸', p9, '没', '了', '断', '幺', '。',
      '单', '纯', '进', '张', '数', '上', '打', m3, '最', '多', '，', '但', '索', '子', '先', '进', '张', '就', '会', '变', '成', '“', '无', '宝', '牌', '、', '无', '役', '、', '一', '无', '是', '处', '”', '，', '连', '立', '直', '都', '不', '敢', '。',
      '既', '然', '如', '此', '，', '不', '如', '从', '一', '开', '始', '就', '留', '下', '可', '以', '有', '役', '听', '牌', '的', '形', '状', '，', '柔', '软', '地', '组', '牌', '。',
      '打', s2, '的', '话', '，', '虽', '然', s3, '成', '了', '失', '张', '，', '但', '进', p2, p5, '有', '高', '目', '平', '和', '一', '杯', '口', '。',
      m3, '靠', '张', '了', '从', p3, p3, p4, p4, '的', '双', '面', '子', '中', '打', '掉', '一', '枚', '就', '是', '完', '全', '一', '向', '听', '。',
      '此', '外', '，', '从', '题', '中', '的', '形', '状', '里', '一', '下', '子', '打', '出', p3, p4, '的', '打', '法', '，', '在', '现', '代', '大', '多', '已', '经', '被', '否', '定', '了', '。'
    ]
  },
  {
    id: 220,
    round: '东 1 局  东家   8 巡目',
    images1: [z0, z0, p7, z0, z0, z0, z0],
    images2: [m3, m4, m7, m8, m9, p7, p8, p8, p9, s3, s4, s5, s6, m4],
    answerImg: p8,
    explanation: [
    '固', '定', '宝', '牌', '雀', '头', '太', '慢', '了', '。',
      '这', '里', '打', '宝', '牌', '要', '进', '张', '面', '。',
      '打', m3, '的', '进', '张', '数', '也', '不', '错', '，', '但', '饼', '子', '上', '除', '了', '摸', '到', '宝', '牌', p8, '和', '宝', '牌', '指', '示', '牌', p7, '以', '外', '，', '没', '有', '其', '他', '好', '的', '进', '张', '了', '。',
      '而', '万', '子', '还', '有', '赤', '牌', '进', '张', '，', '很', '重', '要', '。'
    ]
  },
  {
    id: 221,
    round: '东 1 局  东家   6 巡目',
    images1: [z0, z0, p6, z0, z0, z0, z0],
    images2: [p2, p4, p5, p6, p7, p7, p8, p8, s1, s2, s3, s7, s8, p4],
    answerImg: p2,
    explanation: [
      '打', p8, '的', '话', '，', '饼', '子', '是', p3, p6, p9, '进', '张', '的', '两', '面', '坎', '张', '亚', '种', '。',
      '但', '这', '是', '陷', '阱', '。',
      '打', p8, '不', '仅', '没', '了', '一', '杯', '口', '，', '摸', '到', '第', '三', '枚', '宝', '牌', '也', '很', '难', '办', '。',
      '普', '通', '的', '打', p2, '进', '张', '多', '，', '打', '点', '也', '很', '优', '秀', '。'
    ]
  },
  {
    id: 222,
    round: '东 1 局  西家   5 巡目',
    images1: [z0, z0, m9, z0, z0, z0, z0],
    images2: [m2, m3, m3, m4, p1, p1, p5, p7, p7, s4, s5, s7, s8, s9],
    answerImg: p7,
    explanation: [
    '以', '当', '下', '的', '速', '度', '来', '说', '打', m3, '最', '快', '，', '但', '成', '为', '无', '役', '、', '无', '宝', '牌', '、', ' Foolish shape', '听', '牌', '的', '可', '能', '性', '很', '高', '。',
      '这', '里', '打', p7, '，', '看', '饼', '子', '的', '两', '面', '变', '化', '和', '万', '子', '的', '延', '伸', '。',
      '看', '上', '去', '似', '乎', '违', '反', '了', '两', '雀', '头', '理', '论', '，', '实', '际', '上', '就', '算', '打', p5, '留', '两', '个', '雀', '头', '，', '饼', '子', '的', '两', '面', '变', '化', '牌', '也', '只', '有', p8, '一', '种', '。',
      '摸', p6, '直', '接', '平', '和', '听', '牌', '也', '很', '关', '键', '。'
    ]
  },
  {
    id: 223,
    round: '东 1 局  东家   4 巡目',
    images1: [z0, z0, m9, z0, z0, z0, z0],
    images2: [p3, p0, p8, p9, s2, s4, s7, s7, s8, s8, s8, z1, z1, p9],
    answerImg: s2,
    explanation: [
      '六', '搭', '子', '，', '面', '子', '超', '载', '。',
      '因', '为', '是', '依', '赖', '双', '东', '的', '牌', '，', '这', '里', '根', '据', '鸣', '牌', '效', '率', '重', '视', '留', '五', '搭', '。'
    ]
  },
  {
    id: 224,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, m3, z0, z0, z0, z0],
    images2: [m3, m4, m6, m6, m6, m6, m7, p3, p4, p5, s7, s7, s7, m5],
    answerImg: m3,
    explanation: [
      '估', '计', '打', m6, '听', m2, m5, m7, m8, '四', '面', '的', '人', '很', '多', '，', '其', '实', '打', m3, '也', '是', m4, m5, m7, m8, '的', '四', '面', '听', '。',
      '含', '有', '宝', '牌', m4, '的', '听', '牌', '，', '打', '点', '面', '上', '有', '利', '。',
      '实', '战', '中', '要', '看', '具', '体', '情', '况', '，', '从', '期', '待', '值', '来', '说', '，', '顺', '序', '是', '打', m3, '>', '打', m6, '>', '打', s7, '。'
    ]
  },
  {
    id: 225,
    round: '东 1 局  北家   6 巡目',
    images1: [z0, z0, m9, z0, z0, z0, z0],
    images2: [m1, m1, m3, m3, p1, p2, p3, p4, p7, s4, s5, s6, s7, p9],
    answerImg: p1,
    explanation: [
      '某', '本', '何', '切', '书', '中', '的', '正', '解', '是', '打', m3, '退', '回', '两', '向', '听', '，', '还', '是', '推', '荐', '直', '接', '要', '一', '向', '听', '。',
      '即', '使', '打', '了', m3, '也', '不', '能', '保', '证', '好', '形', '听', '牌', '。',
      '摸', p8, '直', '接', '双', '碰', '立', '直', '毫', '无', '问', '题', '，', '索', '子', '延', '伸', '的', '时', '候', '从', m3, '对', '子', '和', '饼', '子', '坎', '张', '中', '选', '择', '。',
      '这', '个', '牌', '形', '打', m3, '不', '仅', '好', '形', '病', '，', '还', '很', '慢', '。'
    ]
  },
  {
    id: 226,
    round: '东 1 局  东家   6 巡目',
    images1: [z0, z0, p1, z0, z0, z0, z0],
    images2: [m1, m2, m2, m3, m4, m6, p1, p2, p3, p8, p8, s3, s4, m4],
    answerImg: m1,
    explanation: [
      '打', m2, '进', '张', '最', '多', '，', '但', '和', '打', m1, '的', '差', '距', '只', '有', '一', '枚', '。',
      '考', '虑', '到', '打', '点', '保', '留', '一', '杯', '口', '。',
      '摸', p4, '能', '看', '到', '234', '的', '三', '色', '。'
    ]
  },
  {
    id: 227,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, m8, z0, z0, z0, z0],
    images2: [p2, p3, p3, p4, p4, p4, p7, p7, p8, s3, s4, s4, s5, p3],
    answerImg: p8,
    explanation: [
      '能', '看', '到', p2, p3, p3, p4, p4, p4, '不', '仅', '有', '纵', '向', '（', '刻', '子', '）', '进', '张', '，', '也', '有', '横', '向', '（', '顺', '子', '）', '进', '张', '的', '话', '，', '就', '能', '得', '出', '答', '案', '。',
      '进', p2, p5, '有', '断', '平', '一', '杯', '口', '。',
      '索', '子', '进', '张', '的', '听', '牌', '必', '定', '可', '以', '两', '面', '立', '直', '。',
      '进', '张', '最', '多', '，', '也', '最', '不', '容', '易', '丢', '掉', '断', '幺', '，', '毫', '无', '不', '满', '的', '一', '打', '。'
    ]
  },
  {
    id: 228,
    round: '东 1 局  西家   4 巡目',
    images1: [z0, z0, z3, z0, z0, z0, z0],
    images2: [m1, m1, m1, m5, m6, m6, p4, p5, p5, s2, s2, s3, s7, s8],
    answerImg: p4,
    explanation: [
      '乍', '一', '看', '固', '定', '某', '一', '个', '两', '面', '不', '错', '，', '实', '际', '上', '四', '对', '子', '有', '七', '对', '子', '的', '可', '能', '，', '固', '定', '雀', '头', '进', '张', '最', '多', '。',
      '稀', '有', '情', '况', '下', '还', '有', '三', '暗', '刻', '。',
      '其', '实', '速', '度', '上', '和', '打', '点', '面', '上', '也', '是', '固', '定', '雀', '头', '有', '利', '。',
      m5, '/', p4, '/', s3, '中', '选', '择', '，', '考', '虑', '最', '终', '形', '和', '赤', '牌', '，', '打', p4, '是', '正', '解', '。'
    ]
  },
  {
    id: 229,
    round: '东 1 局  东家   4 巡目',
    images1: [z0, z0, s1, z0, z0, z0, z0],
    images2: [m1, m1, m3, m5, m6, m6, m8, p4, p4, p7, p8, s4, s0, m4],
    answerImg: m1,
    explanation: [
      '三', '雀', '头', '。', '根', '据', '三', '雀', '头', '最', '弱', '理', '论', '，', '拆', '对', '子', '进', '张', '多', '两', '枚', '。',
      '这', '里', '打', '掉', '一', '枚', m1, '。',
      '之', '后', '根', '据', '进', '张', '选', '择', '走', '向', '断', '幺', '、', '三', '色', '或', '一', '气', '。'
    ]
  },
  {
    id: 230,
    round: '东 1 局  东家   8 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m0, m6, m6, p2, p3, p4, p4, p5, p6, p8, s4, s5, s5, p3],
    answerImg: m6,
    explanation: [
      '留', '不', '留', '坎', p7, '的', '问', '题', '。',
      '亲', '家', '第', '8', '巡', '基', '本', '断', '幺', '确', '定', '的', '赤', '1', '，', '老', '实', '地', '要', '一', '向', '听', '。',
      '柔', '软', '地', '打', m6, '既', '保', '留', '了', '直', '接', '摸', '坎', p7, '听', '牌', '，', '也', '不', '会', '打', '掉', '赤', '牌', '。',
      '这', '样', '饼', '子', '纵', '向', '进', '张', '时', '的', '形', '状', '更', '好', '。'
    ]
  },
  {
    id: 231,
    round: '东 1 局  西家   4 巡目',
    images1: [z0, z0, p6, z0, z0, z0, z0],
    images2: [m3, m4, m5, m6, m8, p3, p3, p8, p8, p9, s3, s3, s5, m7],
    answerImg: s3,
    explanation: [
      '某', '何', '切', '书', '中', '认', '为', '打', p3, '是', '正', '解', '的', '问', '题', '。',
      '但', '是', '昭', '和', '时', '代', '才', '认', '为', '拆', '对', '子', '留', '浮', '牌', '狙', '击', '三', '色', '是', '高', '端', '打', '法', '。',
      '现', '代', '麻', '将', '中', '不', '会', '去', '强', '行', '狙', '击', '遥', '远', '的', '三', '色', '。',
      '也', '不', '推', '荐', '拆', '对', '子', '留', '浮', '牌', '。',
      '也', '有', '一', '口', '气', '打', p9, '走', '食', '断', '的', '打', '法', '，', '但', '巡', '目', '尚', '早', '，', '根', '据', '三', '雀', '头', '最', '弱', '理', '论', '，',
      '打', s3, '不', '仅', '保', '留', '了', '宝', '牌', p7, '进', '张', '，', '而', '且', '容', '易', '动', '手', '，', '变', '化', '也', '很', '多', '。',
      '之', '后', '如', '果', p3, '靠', '张', '了', '再', '打', p9, '狙', '击', '三', '色', '。'
    ]
  },
  {
    id: 232,
    round: '东 1 局  东家   3 巡目',
    images1: [z0, z0, p8, z0, z0, z0, z0],
    images2: [m1, m2, m6, m8, p2, p3, p7, p8, s4, s4, s5, s7, s7, s5],
    answerImg: m1,
    explanation: [
      '面', '子', '超', '载', '。',
      '拆', '掉', '最', '弱', '的', '边', '张', '。',
      '索', '子', '虽', '是', '二', '度', '受', '，', s4, s5, '也', '不', '能', '打', '。'
    ]
  },
  {
    id: 233,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, s1, z0, z0, z0, z0],
    images2: [m2, m3, m4, m4, m5, m6, m8, p3, p4, p5, p5, p7, p8, m2],
    answerImg: m8,
    explanation: [
      '打', p5, '的', '话', '，', '万', '子', '进', '张', m2, m5, m7, m8, '，', '必', '定', '平', '和', '。',
      '打', m8, '除', '了', '摸', p8, '是', '坎', '张', '听', '牌', '，', '其', '他', '有', '效', '牌', '都', '有', '平', '和', '。',
      '两', '者', '都', '很', '优', '秀', '，', '但', '有', '着', '“', '摸', p6, '三', '面', '听', '”', '“', p0, '进', '张', '”', '，', '打', m8, '期', '待', '值', '最', '大', '。'
    ]
  },
  {
    id: 234,
    round: '东 1 局  西家   6 巡目',
    images1: [z0, z0, p6, z0, z0, z0, z0],
    images2: [m6, m8, p4, p5, p6, p7, p8, p9, s3, s3, s0, z1, z1, p3],
    answerImg: m8,
    explanation: [
      '虽', '然', '退', '回', '了', '两', '向', '听', '，', '但', '留', '下', '了', '强', '力', '的', '形', '状', '。',
      '就', '算', '切', '饼', '子', '进', '一', '向', '听', '，', '由', '于', '役', '牌', '是', '对', '子', '，', '直', '线', '听', '牌', '打', '掉', s0, '的', '可', '能', '性', '很', '大', '。',
      '欲', '速', '则', '不', '达', '。',
      '饼', '子', '抽', '出', p7, p8, p9, '来', '看', '，', '是', p3, p4, p5, p6, '的', '四', '连', '形', '。',
      '即', '使', '退', '回', '两', '向', '听', '，', '这', '里', '也', '很', '快', '就', '能', '做', '出', '两', '面', '。',
      '此', '外', '，', p3, p6, p9, '成', '对', '的', '形', '状', '也', '不', '差', '。'
    ]
  },
  {
    id: 235,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, m2, z0, z0, z0, z0],
    images2: [m3, m0, m6, m7, p5, p5, p6, p7, s6, s6, s7, s7, s8, s9],
    answerImg: p5,
    explanation: [
      '序', '盘', '可', '以', '打', s9, '，', '但', '这', '里', '已', '经', '第', '7', '巡', '，', '要', '考', '虑', '“', '进', '张', '面', '”', '、', '“', '打', '点', '”', '和', '“', '最', '终', '形', '”', '的', '平', '衡', '。',
      '可', '以', '兼', '顾', '宝', '牌', m3, '“', '靠', '张', '”', '和', '“', '成', '对', '”', '的', '打', '法', '才', '是', '正', '解', '。'
    ]
  },
  {
    id: 236,
    round: '东 1 局  南家   1 巡目',
    images1: [z0, z0, m8, z0, z0, z0, z0],
    images2: [m3, m4, m7, m8, p1, p4, s2, s3, s4, s6, s8, z1, z4, m5],
    answerImg: z1,
    explanation: [
      '已', '经', '完', '成', '两', '个', '面', '子', '的', '好', '配', '牌', '，', '没', '雀', '头', '。',
      '因', '为', '接', '近', '平', '和', '，', '仔', '细', '地', '从', '役', '牌', '打', '起', '。',
      '稀', '有', '情', '况', '下', '，', p1, p4, '的', '愚', '形', '连', '续', '摸', '进', p2, p3, '的', '话', '会', '成', '为', '两', '面', '单', '骑', '这', '种', '容', '易', '出', '雀', '头', '的', '形', '状', '。'
    ]
  },
  {
    id: 237,
    round: '东 1 局  南家   5 巡目',
    images1: [z0, z0, s4, z0, z0, z0, z0],
    images2: [m1, m1, m3, m4, m0, m5, m6, m7, m7, m7, p4, s4, s4, s0],
    answerImg: s4,
    explanation: [
      '固', '定', '双', '宝', '牌', s0, '。',
      '14', '枚', '的', '进', '张', '数', '还', '算', '过', '得', '去', '，', '所', '以', '不', '会', '打', m1, '直', '线', '转', '向', '断', '幺', '。',
      '恐', '怕', '打', m1, '的', '人', '有', '断', '幺', '病', '。',
      '拆', m1, '对', '子', '要', '等', '到', p4, '靠', '张', '之', '后', '。',
      '此', '外', '，', '现', '在', '的', '形', '状', '中', '有', '三', '个', '雀', '头', '，', '打', s4, '和', '打', p4, '的', '进', '张', '数', '差', '距', '只', '有', '两', '枚', '（', '宝', '牌', '指', '示', '牌', '还', '用', '掉', '了', '一', '枚', '）', '，', '请', '注', '意', '。'
    ]
  },
  {
    id: 238,
    round: '东 1 局  东家   5 巡目',
    images1: [z0, z0, m7, z0, z0, z0, z0],
    images2: [m6, m7, m8, p4, p5, p6, p6, p7, s2, s2, s4, s4, s6, s6],
    answerImg: s4,
    explanation: [
      s2, s2, s4, s4, s6, s6, '是', '被', '叫', '做', '“', '跳', '对', '子', '”', '的', '形', '状', '。',
      '如', '果', '切', '掉', '当', '中', '的', s4, '，', '摸', s2, s3, s5, s6, '都', '能', '做', '出', '雀', '头', '+', '一', '个', '面', '子', '。',
      '跳', '对', '子', '打', '中', '间', '。'
    ]
  },
  {
    id: 239,
    round: '东 1 局  西家   6 巡目',
    images1: [z0, z0, z3, z0, z0, z0, z0],
    images2: [m3, m4, m5, p3, p4, p4, p4, p5, s3, s3, s5, s5, s7, s7],
    answerImg: s3,
    explanation: [
      '不', '要', '按', '照', '跳', '对', '子', '打', '中', '间', '的', '理', '论', '简', '单', '地', '打', '掉', s5, '。',
      '相', '当', '少', '见', '的', '例', '外', '形', '。',
      '打', s3, '的', '话', '，', '摸', s6, '也', '有', '三', '色', '，', '默', '听', '5200', '点', '确', '定', '。',
      '虽', '然', '饼', '子', '有', '变', '化', '的', '场', '合', '比', '起', '打', s5, '最', '多', '会', '亏', '四', '枚', '进', '张', '，', '但', '少', '掉', '的', '进', '张', '都', '会', '丢', '掉', '三', '色', '。',
      '此', '外', '可', '以', '碰', s0, '也', '是', '优', '点', '。'
    ]
  },
  {
    id: 240,
    round: '东 1 局  西家   4 巡目',
    images1: [z0, z0, s7, z0, z0, z0, z0],
    images2: [m2, m4, p5, p6, p6, p6, p7, s2, s2, s4, s4, s6, s6, p4],
    answerImg: m2,
    explanation: [
      '可', '以', '狙', '击', '三', '暗', '刻', '、', '七', '对', '、', '一', '杯', '口', '。',
      '从', s2, s2, s4, s4, s6, s6, '的', '跳', '对', '子', '中', '打', s4, '很', '柔', '软', '，', '但', '打', m2, '后', '再', '前', '进', '一', '步', '的', '形', '状', '更', '强', '。',
      '打', s4, '后', '再', '前', '前', '进', '一', '步', '，', '同', '样', '是', '坎', '张', '的', '话', '，', '还', '是', '留', '下', s4, '的', '一', '杯', '口', '更', '赚', '一', '些', '。',
      '打', '索', '子', '的', '人', '估', '计', '没', '看', '到', '饼', '子', '的', '纵', '向', '进', '张', '和', '七', '对', '。'
    ]
  },
  {
    id: 241,
    round: '东 1 局  东家   5 巡目',
    images1: [z0, z0, p4, z0, z0, z0, z0],
    images2: [m4, m0, m7, m8, p3, p3, p5, p5, p7, p7, p8, p8, p8, m9],
    answerImg: p3,
    explanation: [
      '打', '宝', '牌', p5, '进', '张', '最', '多', '，', '但', '有', '可', '能', '要', '把', '一', '对', '宝', '牌', '都', '打', '了', '。',
      '打', p3, '时', '摸', p6, '、', '打', p7, '时', '摸', p4, '，', '都', '会', '错', '过', '听', '牌', '，',
      '不', '过', '打', p3, '后', '摸', '失', '张', p6, '以', '及', p9, '都', '可', '以', '狙', '击', '一', '杯', '口', '。'
    ]
  },
  {
    id: 242,
    round: '东 1 局  西家   4 巡目',
    images1: [z0, z0, s8, z0, z0, z0, z0],
    images2: [m0, m6, p2, p2, p5, p7, s4, s5, s5, s6, s7, s7, s9, s9],
    answerImg: p2,
    explanation: [
      '因', '为', s9, '是', '宝', '牌', '，', '所', '以', '即', '使', '有', '鸣', '三', '色', '，', '也', '没', '有', '食', '断', '。',
      '由', '于', '面', '子', '超', '载', '，', '根', '据', '五', '搭', '子', '理', '论', '拆', '掉', '弱', '搭', '。',
      '乍', '看', '上', '去', '有', '567', '三', '色', '，', '想', '打', s7, '，', '但', '之', '后', '摸', '进', s3, s6, '还', '是', '要', '拆', p2, '对', '子', '。',
      '既', '然', '如', '此', '现', '在', '就', '打', p2, '，', '保', '留', '之', '后', '的', '强', '力', '形', '状', '。',
      '直', '接', '的', '失', '张', '只', '有', p2, '。'
    ]
  },
  {
    id: 243,
    round: '东 1 局  西家   6 巡目',
    images1: [z0, z0, m2, z0, z0, z0, z0],
    images2: [m4, m5, p3, p4, p5, p6, p6, p8, p8, s6, s6, s7, s7, s7],
    answerImg: p8,
    explanation: [
      '考', '虑', '到', '摸', p2, '/', p4, '/', p5, '时', '的', '强', '度', '，', '打', p8, '是', '正', '解', '。',
      '估', '计', '打', p6, '的', '人', '很', '多', '。',
      '打', p6, '优', '点', '在', '于', '摸', m3, m6, '时', '，', '双', '碰', '立', '直', p8, '更', '容', '易', '被', '打', '出', '。',
      '但', '是', '，', '麻', '将', '中', '不', '光', '有', '一', '发', '和', '自', '摸', '，', '打', p8, '有', '着', '三', '面', '听', '、', '一', '杯', '口', '、', '完', '全', '一', '向', '听', '等', '等', '可', '能', '，', '打', p6, '是', '及', '不', '上', '的', '。'
    ]
  },
  {
    id: 244,
    round: '东 1 局  东家   6 巡目',
    images1: [z0, z0, p4, z0, z0, z0, z0],
    images2: [m2, m3, m4, m5, m6, m7, p0, s2, s3, s4, s7, s7, s8, m4],
    answerImg: s8,
    explanation: [
      '万', '子', '能', '看', '到', m4, m5, m6, m7, '的', '四', '连', '好', '形', '。',
      '能', '做', '出', '三', '面', '听', '或', '者', '立', '断', '平', '的', '话', '，', '打', '掉', '双', '宝', '牌', p0, '也', '无', '妨', '。',
      '摸', m1, '或', m9, '这', '种', '没', '有', '打', '掉', p0, '价', '值', '的', '牌', '就', '摸', '切', '。'
    ]
  },
  {
    id: 245,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, s4, z0, z0, z0, z0],
    images2: [m3, m4, m6, m7, p2, p2, p4, p5, p6, p7, p7, s1, s1, m5],
    answerImg: s1,
    explanation: [
      '进', '张', '面', '上', '打', p2, '，', '但', '万', '子', '形', '状', '很', '好', '，', '很', '大', '可', '能', '变', '成', '无', '役', '愚', '形', '听', '牌', '。',
      '现', '在', '转', '向', '容', '易', '动', '手', '的', '断', '幺', '。',
      '这', '样', '进', '了', m2, m5, m8, '可', '以', '默', '听', '。'
    ]
  },
  {
    id: 246,
    round: '东 1 局  东家   4 巡目',
    images1: [z0, z0, p9, z0, z0, z0, z0],
    images2: [m2, m3, m4, p4, p0, p7, p9, p9, s4, s4, s5, s7, s9, p6],
    answerImg: s4,
    explanation: [
      '直', '接', '进', '坎', s8, '平', '和', '听', '牌', '。',
      '饼', '子', '延', '伸', '了', '就', '打', '掉', '索', '子', '的', '坎', '张', '。',
      '根', '据', '牌', '风', '也', '有', '直', '接', '打', p7, '或', s9, '的', '，', '这', '里', p9, '已', '经', '被', '指', '示', '牌', '用', '掉', '一', '枚', '，', '这', '种', '打', '法', '的', '优', '势', '被', '削', '弱', '了', '。',
      '实', '战', '中', '希', '望', '能', '熟', '练', '掌', '握', '一', '边', '避', '开', '枚', '数', '很', '少', '的', '进', '张', '，', '一', '边', '组', '牌', '的', '技', '术', '。'
    ]
  },
  {
    id: 247,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, s8, z0, z0, z0, z0],
    images2: [m2, m2, m3, m3, m0, m7, m7, p6, p7, p8, s2, s4, s4, m4],
    answerImg: s2,
    explanation: [
      '想', '打', m2, '固', '定', '住', m0, '，', '但', '这', '里', '打', s2, '才', '是', '正', '解', '。',
      '进', '张', '数', '最', '多', '，', '而', '且', '摸', m6, '有', '高', '目', '断', '平', '一', '杯', '口', '，', '打', '点', '面', '也', '很', '优', '秀', '。',
      '也', '容', '易', '应', '对', '鸣', '牌', '。'
    ]
  },
  {
    id: 248,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, m9, z0, z0, z0, z0],
    images2: [m1, m3, m5, m5, m6, p1, p1, p2, p3, p3, p3, p4, p5, m4,],
    answerImg: p3,
    explanation: [
      '进', '张', '面', '当', '然', '是', '打', m1, '最', '广', '，', '但', '最', '终', '形', '成', '为', '坎', p2, '的', '可', '能', '性', '很', '高', '，', '是', '个', '难', '关', '。',
      '留', '住', '宝', '牌', '打', p3, '的', '话', '，', '摸', '宝', '牌', m1, '和', m2, '都', '可', '以', '听', '牌', '，', '基', '本', '上', '都', '有', '平', '和', '。'
    ]
  },
  {
    id: 249,
    round: '东 1 局  西家   4 巡目',
    images1: [z0, z0, z4, z0, z0, z0, z0],
    images2: [m2, m4, m6, m8, m8, p0, p5, p7, p9, s5, s6, z1, z1, z1],
    answerImg: p9,
    explanation: [
      '打', m2, '或', p9, '进', '张', '最', '多', '。',
      '切', '哪', '边', '好', '像', '都', '差', '不', '多', '，', '但', '在', '碰', '之', '后', '会', '不', '会', '产', '生', '废', '牌', '有', '很', '大', '区', '别', '。',
      '打', p9, '碰', m8, '打', p7, '绝', '佳', '，', '而', '打', m2, '碰', m8, '后', '变', '为', m4, m6, '和', p7, p9, '的', '坎', '张', '二', '择', '，', '会', '出', '现', '废', '牌', '。',
      '使', '用', '弱', '搭', '子', '三', '枚', '构', '成', '理', '论', '可', '以', '简', '单', '的', '解', '答', '。',
      '请', '注', '意', '题', '中', '的', '牌', '形', '，', '万', '子', '有', '五', '枚', '（', '奇', '数', '）', '，', '而', '饼', '子', '有', '四', '枚', '（', '偶', '数', '）', '。'
    ]
  },
  {
    id: 250,
    round: '东 1 局  南家   7 巡目',
    images1: [z0, z0, z3, z0, z0, z0, z0],
    images2: [m2, m4, m4, p4, p5, p6, p6, p6, p7, s4, s0, s7, s8, s8],
    answerImg: m2,
    explanation: [
      '万', '子', '虽', '然', '是', '边', '张', '，', '但', '留', '下', '可', '以', '狙', '击', m3, m6, '的', '进', '张', '，', '有', '一', '杯', '口', '可', '能', '。',
      '打', m2, '保', '留', '了', '6', 'm', '进', '张', '，', '也', '容', '易', '有', '断', '幺', '。',
      '请', '仔', '细', '品', '味', '和', '打', s8, '这', '种', '昭', '和', '风', '六', '搭', '子', '打', '法', '的', '区', '别', '。'
    ]
  },
  {
    id: 251,
    round: '东 1 局  东家   9 巡目',
    images1: [z0, z0, m3, z0, z0, z0, z0],
    images2: [m5, m7, m8, m8, m8, p3, p4, p4, p6, p7, s8, s9, s9, m9],
    answerImg: p4,
    explanation: [
      '不', '论', '怎', '么', '打', '都', '有', '失', '张', '的', '形', '状', '。',
      '这', '里', '打', p4, '的', '失', '张', '损', '失', '最', '小', '。',
      '饼', '子', '虽', '然', '成', '了', '二', '度', '受', '，', '但', '还', '是', '两', '面', '比', '较', '强', '。',
      '迷', '茫', '的', '时', '候', '就', '固', '定', '两', '面', '。',
      '这', '样', '可', '以', '回', '避', '绝', '大', '多', '数', '的', 'A', '级', '失', '误', '了', '。'
    ]
  },
  {
    id: 252,
    round: '东 1 局  东家   9 巡目',
    images1: [z0, z0, m4, z0, z0, z0, z0],
    images2: [m3, m4, m4, m6, m6, p7, p7, p7, p8, p9, s3, s5, s5, p6],
    answerImg: p7,
    explanation: [
      '四', '雀', '头', '的', '手', '牌', '。',
      '想', '看', '食', '断', '，', '但', '饼', '子', '不', '往', '下', '延', '伸', '的', '话', '很', '难', '受', '。',
      '最', '高', '形', '有', '四', '暗', '刻', '，', '可', '指', '示', '牌', '用', '掉', '了', '一', '枚', m4, '，', '宝', '牌', m5, '也', '是', '进', '张', '，', '万', '子', '更', '想', '做', '顺', '子', '。',
      '打', p7, '不', '仅', '可', '以', '狙', '击', '顺', '子', '系', '，', '同', '时', '保', '留', '了', '七', '对', '，', '很', '柔', '软', '。'
    ]
  },
  {
    id: 253,
    round: '东 1 局  东家   5 巡目',
    images1: [z0, z0, p3, z0, z0, z0, z0],
    images2: [m3, m3, m5, m6, m6, m7, m8, p6, p7, s2, s2, s3, s4, s0],
    answerImg: s2,
    explanation: [
      '面', '子', '超', '载', '。',
      '这', '里', '打', s2, '是', '正', '解', '，', '摸', s6, '可', '以', '狙', '击', '567', '三', '色', '。',
      '不', '过', '如', '果', '在', '进', s6, '前', '饼', '子', '纵', '向', '进', '张', '了', '，', '就', '放', '弃', '三', '色', '老', '实', '要', '厚', '度', '。',
      '此', '外', '，', '单', '纯', '进', '张', '数', '打', m6, '最', '多', '，', '但', '摸', p5, p8, '不', '能', '两', '面', '听', '牌', '很', '亏', '。'
    ]
  },
  {
    id: 254,
    round: '东 1 局  东家   3 巡目',
    images1: [z0, z0, p5, z0, z0, z0, z0],
    images2: [m4, m0, m6, m8, m9, m9, p6, p7, s2, s4, s4, s5, s7, m7],
    answerImg: s2,
    explanation: [
      '打', s2, '留', '下', m9, '的', '话', '，', '摸', m3, m6, m9, '时', '可', '以', '打', s7, '变', '为', '完', '全', '一', '向', '听', '。',
      '而', '打', m9, '在', '进', s2, s3, '时', '形', '状', '很', '强', '，', '比', '起', s2, s3, '，', m3, m6, m9, '稍', '微', '多', '一', '些', '。'
    ]
  },
  {
    id: 255,
    round: '东 1 局  东家   5 巡目',
    images1: [z0, z0, m2, z0, z0, z0, z0],
    images2: [m7, m8, p3, p5, p5, p7, p7, p9, s5, s5, s6, s7, s8, s9],
    answerImg: p3,
    explanation: [
      '狙', '击', m7, p8, s9, '三', '色', '。',
      '根', '据', '一', '向', '听', '顶', '峰', '理', '论', '，', '保', '留', '一', '向', '听', '时', '最', '容', '易', '做', '出', '三', '色', '的', '形', '状', '是', '正', '解', '。',
      '选', '择', s5, '或', p7, '的', '人', '，', '再', '看', '一', '下', '进', p6, '后', '的', '形', '状', '。',
      '不', '管', '哪', '边', '应', '该', '都', '不', '容', '易', '在', '一', '向', '听', '时', '保', '留', '两', '个', '雀', '头', '。'
    ]
  },
  {
    id: 256,
    round: '东 1 局  西家   6 巡目',
    images1: [z0, z0, z4, z0, z0, z0, z0],
    images2: [p2, p2, p3, p4, p6, p8, s3, s5, s6, s6, ph, ph, ph, p4],
    images3: [m4, m0, m6],
    answerImg: p8,
    explanation: [
      '这', '里', '推', '荐', '打', p8, '。',
      '直', '接', '的', '失', '张', '只', '有', p7, '。',
      '虽', '比', '打', p2, '的', '直', '接', '进', '张', '差', '一', '枚', '，', '却', '留', '下', '了', '容', '易', '行', '动', '的', '形', '状', '。'
    ]
  },
  {
    id: 257,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, m6, z0, z0, z0, z0],
    images2: [m5, m6, m6, m7, p2, p3, p3, p4, p4, p5, p6, s7, s8, s8],
    answerImg: s7,
    explanation: [
      '看', '上', '去', '很', '复', '杂', '，', '但', '如', '果', '能', '像', '下', '面', '这', '样', '拆', '解', '开', '来', '，', '就', '和', '已', '经', '解', '出', '题', '目', '一', '样', '了', '。',
      m5, m6, m7, '+', p2, p3, p4, '+', p3, p4, p5, p6, '+', s7, s8, s8, '。',
      '固', '定', s8, '雀', '头', '，', '等', '万', '子', '或', '饼', '子', '的', '靠', '张', '听', '牌', '。'
    ]
  },
  {
    id: 258,
    round: '东 1 局  南家   3 巡目',
    images1: [z0, z0, m1, z0, z0, z0, z0],
    images2: [m1, m2, m2, m2, m3, m5, m7, p2, p2, p3, s5, s6, z2, z2],
    answerImg: m7,
    explanation: [
      '宝', '牌', p3, '的', '面', '子', '超', '载', '。',
      '以', '“', '鸣', '南', '为', '前', '提', '/', '能', '鸣', '牌', '为', '前', '提', '”', '，', '留', '下', '较', '强', '的', '形', '状', '。',
      '要', '解', '答', '这', '种', '带', '有', '役', '牌', '的', '问', '题', '，', '可', '以', '从', '先', '完', '成', '容', '易', '碰', '出', '必', '定', '会', '鸣', '的', '搭', '子', '，', '和', '门', '清', '也', '能', '做', '出', '面', '子', '的', '强', '力', '搭', '子', '来', '考', '虑', '。',
      '本', '题', '中', '，', '容', '易', '碰', '触', '必', '定', '会', '鸣', '的', '牌', '是', '自', '风', '南', '，', '门', '清', '也', '能', '做', '出', '面', '子', '的', '强', '力', '搭', '子', '是', p2, p2, p3, '，', '实', '战', '中', '也', '是', '这', '两', '者', '先', '完', '成', '的', '情', '况', '比', '较', '多', '。',
      '想', '到', '这', '点', '自', '然', '就', '能', '得', '出', '打', m7, '的', '答', '案', '。'
    ]
  },
  {
    id: 259,
    round: '东 1 局  西家   4 巡目',
    images1: [z0, z0, z4, z0, z0, z0, z0],
    images2: [m5, p1, p1, p6, p6, p6, p7, s3, s4, s5, z1, z1, z1, s6],
    answerImg: m5,
    explanation: [
      '狙', '击', '靠', '张', '听', '牌', '打', '暗', '刻', '旁', '边', '的', '牌', '是', '理', '论', '。',
      '但', '是', '手', '里', '有', '役', '牌', '宝', '牌', p3, '，', '碰', p1, '或', p6, '的', '形', '状', '很', '强', '。',
      '打', m5, '和', '打', p7, '的', '进', '张', '数', '只', '差', '三', '张', '。',
      '考', '虑', '到', '最', '终', '形', '打', m5, '是', '正', '解', '。'
    ]
  },
  {
    id: 260,
    round: '东 1 局  东家   4 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m3, m4, m6, m8, p4, p4, p7, p7, s2, s3, s3, s5, s6, s7],
    answerImg: m8,
    explanation: [
      '面', '子', '超', '载', '。',
      '因', '为', '有', '三', '雀', '头', '，', '瞬', '间', '的', '进', '张', '数', '拆', '对', '子', '最', '多', '，', '但', '之', '后', '的', '进', '张', '数', '会', '逆', '转', '的', '典', '型', '牌', '形', '。',
      '虽', '然', '饼', '子', '的', '对', '子', '是', '筋', '牌', '，', '但', '还', '是', '维', '持', '三', '雀', '头', '。',
      '能', '想', '到', p4, '或', p7, '横', '向', '进', '张', '后', '的', '完', '全', '一', '向', '听', '应', '该', '就', '能', 'no', 'time', '打', '对', '。'
    ]
  },
  {
    id: 261,
    round: '东 1 局  西家   4 巡目',
    images1: [z0, z0, m2, z0, z0, z0, z0],
    images2: [m2, m3, m6, m7, p2, p4, p4, p9, p9, s4, s5, s7, s8, s9],
    answerImg: p9,
    explanation: [
      '以', '前', '依', '据', '容', '易', '成', '为', '平', '和', '而', '将', '打', p4, '做', '为', '正', '解', '的', '形', '状', '。',
      '仅', '根', '据', '容', '易', '做', '平', '和', '来', '选', '择', '打', p4, '的', '话', '，', '因', '为', '面', '子', '超', '载', '，', '之', '后', '摸', '进', '成', '对', '的', '牌', '，', '还', '得', '整', '理', '剩', '下', '的', p2, p4, '。',
      '如', '果', '把', '成', '对', '做', '为', '前', '提', '，', '这', '里', '保', '留', '五', '搭', '，', '拆', '掉', '弱', '搭', p9, '对', '子', '，', '之', '后', '会', '更', '强', '。'
    ]
  },
  {
    id: 262,
    round: '东 1 局  东家   6 巡目',
    images1: [z0, z0, s3, z0, z0, z0, z0],
    images2: [m1, m1, m7, m8, p0, s1, s2, s3, s4, s5, s6, z1, z1, p6],
    answerImg: m1,
    explanation: [
      '双', '东', '对', '子', '宝', '牌', p2, '。',
      '双', '东', '还', '是', '平', '和', '的', '选', '择', '，', '现', '代', '舍', '弃', '平', '和', '打', m1, '越', '来', '越', '成', '为', '了', '常', '识', '。',
      '不', '依', '赖', '双', '东', '，', '听', '牌', '即', '立', '。',
      m7, m8, '/', p5, p6, '出', '了', '对', '子', '也', '可', '以', '碰', '听', '。'
    ]
  },
  {
    id: 263,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, m4, z0, z0, z0, z0],
    images2: [m1, m2, m4, m5, m6, p4, p5, p6, p9, p9, s6, s7, s7, p3],
    answerImg: s7,
    explanation: [
      '饼', '子', '四', '连', '形', '，', '似', '乎', '可', '以', '做', '出', '两', '个', '面', '子', '。',
      m1, m2, '的', '边', '张', '虽', '然', '多', '半', '还', '是', '会', '拆', '掉', '，', '但', '直', '接', '进', m3, '可', '以', '听', '牌', '，', '不', '到', '最', '后', '不', '拆', '。',
      '打', s7, '固', '定', '两', '面', '是', '做', '平', '和', '的', '基', '本', '。'
    ]
  },
  {
    id: 264,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, s4, z0, z0, z0, z0],
    images2: [m4, m4, m5, m5, m6, m7, m8, m8, m9, p4, p5, s4, s5, s0],
    answerImg: s4,
    explanation: [
      '要', '一', '向', '听', '只', '能', '打', m8, '或', s4, '。',
      '打', m9, '是', '两', '向', '听', '，', '很', '慢', '。',
      m8, '和', s4, '不', '管', '打', '哪', '个', '，', '能', '上', '听', '的', '有', '效', '牌', '是', '一', '样', '的', '。',
      '打', m8, '不', '仅', '限', '定', '了', '门', '清', '，', '做', '三', '色', '也', '要', '打', '掉', '宝', '牌', '。',
      '而', '打', s4, '固', '定', '了', '宝', '牌', p3, '，', '可', '以', '应', '对', '鸣', '牌', '。',
      '见', '到', m8, '或', s5, '毫', '不', '犹', '豫', '地', '碰', '。'
    ]
  },
  {
    id: 265,
    round: '东 1 局  西家   6 巡目',
    images1: [z0, z0, p2, z0, z0, z0, z0],
    images2: [m0, p4, p5, p5, p6, p6, s5, s5, s7, s8, s8, z7, z7, m6],
    answerImg: z7,
    explanation: [
      '放', '弃', '很', '难', '用', '上', '红', m5, '的', '七', '对', '。',
      '保', '留', '五', '搭', '，', '狙', '击', '立', '断', '平', '。'
    ]
  },
  {
    id: 266,
    round: '东 1 局  东家   5 巡目',
    images1: [z0, z0, p6, z0, z0, z0, z0],
    images2: [m3, m5, p3, p4, p5, p5, p6, p7, s2, s4, s6, s7, s8, p8],
    answerImg: s2,
    explanation: [
      '打', p5, '或', p8, '进', '张', '最', '多', '，', '但', '考', '虑', '到', '最', '终', '形', '想', '拆', m3, m5, '或', s2, s4, '的', '坎', '张', '。',
      m3, m5, '的', '两', '面', '变', '化', '有', '两', '种', '，', s2, s4, '的', '两', '面', '变', '化', '有', '一', '种', '。',
      '摸', s5, '的', '三', '面', '变', '化', '很', '有', '魅', '力', '，', '不', '过', '更', '优', '先', '变', '化', '的', '数', '量', '是', '基', '本', '。',
      '防', '备', '下', '巡', '摸', s5, '，', '从', '外', '侧', '的', s2, '打', '起', '。'
    ]
  },
  {
    id: 267,
    round: '东 1 局  东家   6 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m2, m2, m4, m5, m6, m6, m8, p0, p6, s5, s5, s7, s8, s9],
    answerImg: m8,
    explanation: [
      '根', '据', '两', '雀', '头', '理', '论', '，', '两', '个', '对', '子', '都', '留', '下', '。',
      '经', '常', '见', '到', '“', '坎', m7, '和', '对', '碰', m2, '/', s5, '的', '进', '张', '数', '一', '样', '，', '因', '为', '有', '平', '和', '所', '以', '拆', '对', '子', '”', '这', '样', '的', '意', '见', '，',
      '但', '假', '定', '饼', '子', '先', '进', '张', '即', '立', '的', '话', '，', '比', '起', '坎', m7, '，', m2, '/', s5, '的', '双', '碰', '稍', '好', '一', '些', '。',
      '此', '外', '也', '不', '要', '打', s5, '留', '浮', '牌', '。',
      '比', '起', s5, '靠', '上', s4, s6, '再', '拆', m6, m8, '的', '坎', '张', '，', '完', '全', '一', '向', '听', '更', '好', '。'
    ]
  },
  {
    id: 268,
    round: '东 1 局  西家   5 巡目',
    images1: [z0, z0, m7, z0, z0, z0, z0],
    images2: [m1, m2, m3, m4, p2, p3, p4, p4, s1, s2, s3, s4, s5, m3],
    answerImg: s5,
    explanation: [
      '打', s5, '兼', '顾', '123', '和', '234', '三', '色', '。',
      '打', p4, '进', '张', '最', '多', '，', '但', '可', '能', '仅', '有', '立', '直', '，', '这', '里', '还', '是', '想', '狙', '击', '三', '色', '。',
      '这', '个', '牌', '形', '必', '定', '有', '平', '和', '。',
      '以', '前', '说', '起', '何', '切', '全', '是', '狙', '击', '三', '色', '的', '问', '题', '，', '很', '多', '打', '法', '毫', '无', '道', '理', '，', '像', '这', '样', '在', '今', '天', '还', '能', '通', '用', '的', '例', '子', '很', '少', '了', '。'
    ]
  },
  {
    id: 269,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, s5, z0, z0, z0, z0],
    images2: [m2, m3, m4, m6, m7, p1, p1, p3, p7, p7, p9, s4, s5, s6],
    answerImg: p9,
    explanation: [
      '保', '留', '两', '雀', '头', '，', '打', p3, '或', p9, '的', '二', '择', '，', '摸', '进', '各', '自', '内', '侧', '的', '牌', '时', '存', '在', '差', '距', '。',
      '打', p9, '摸', p6, '时', '变', '为', '完', '全', '一', '向', '听', '，', '摸', p4, '转', '断', '幺', '。',
      '打', p3, '转', '不', '了', '断', '幺', '。'
    ]
  },
  {
    id: 270,
    round: '东 1 局  东家   5 巡目',
    images1: [z0, z0, p4, z0, z0, z0, z0],
    images2: [m1, m2, m2, p4, p6, p7, p8, p9, s2, s3, s3, s0, s6, s7],
    answerImg: m1,
    explanation: [
      '重', '点', '在', '于', '坎', p5, '要', '不', '要', '即', '立', '。',
      '考', '虑', '到', '有', '双', '宝', '牌', p0, '，', '即', '立', '也', '没', '什', '么', '问', '题', '。',
      '如', '果', '决', '定', '如', '此', '，', '那', '就', '选', '择', '速', '度', '最', '快', '的', '形', '状', '。',
      '中', '途', '半', '端', '地', '打', s3, '会', '损', '失', '四', '枚', '进', '张', '。',
      '是', '否', '采', '用', '高', '风', '险', '高', '回', '报', '的', '打', '法', '看', '个', '人', '喜', '好', '。',
      '拒', '绝', '听', '宝', '牌', '坎', '张', '即', '立', '的', '人', '，', '也', '可', '以', '先', '打', m1, '，', '后', '续', '再', '替', '换', '搭', '子', '。'
    ]
  },
  {
    id: 271,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, m2, z0, z0, z0, z0],
    images2: [m3, m3, m5, m6, m7, p4, p5, p7, p8, s2, s2, s3, s5, s6],
    answerImg: p8,
    explanation: [
      '面', '子', '超', '载', '。',
      '设', '想', '完', '全', '一', '向', '听', '保', '留', '较', '强', '的', '五', '搭', '。',
      '虽', '然', '拆', '了', p7, p8, '，', '但', '摸', p6, '有', '567', '三', '色', '，', '先', '从', p8, '打', '起', '。'
    ]
  },
  {
    id: 272,
    round: '东 1 局  西家   6 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m2, m2, m6, m7, m8, m9, m9, p5, p6, p7, s3, s5, s5, s6],
    answerImg: m9,
    explanation: [
      '打', s3, '直', '线', '前', '进', '最', '终', '只', '有', '立', '直', '的', '可', '能', '性', '很', '高', '。',
      '进', s4, s7, '有', '断', '幺', '，', '打', '掉', '一', '张', m9, '。'
    ]
  },
  {
    id: 273,
    round: '东 1 局  西家   4 巡目',
    images1: [z0, z0, m6, z0, z0, z0, z0],
    images2: [m3, m3, m7, m7, p2, p3, p7, p8, p8, s2, s4, s6, s8, p4],
    answerImg: s8,
    explanation: [
      '宝', '牌', m7, '对', '子', '，', '能', '看', '到', '断', '幺', '的', '形', '状', '。',
      '全', '力', '向', '食', '断', '前', '进', '。',
      '以', '鸣', '牌', '为', '前', '提', '，', '维', '持', '三', '雀', '头', '比', '较', '强', '。',
      '特', '别', '是', '打', p8, '绝', '对', '不', '行', '，', '因', '为', '不', '能', '安', '定', '断', '幺', '。',
      '这', '里', '从', '索', '子', s2, s4, s6, s8, '中', '打', '掉', '一', '张', '，', '普', '通', '留', '个', '两', '坎', '就', '好', '。',
      '有', '微', '弱', '的', '234', '三', '色', '可', '能', '，', '留', s2, '打', s8, '是', '正', '解', '。',
      '这', '也', '是', '弱', '搭', '子', '三', '枚', '构', '成', '理', '论', '。',
      '把', '四', '枚', '的', '索', '子', '变', '为', '三', '枚', '构', '成', '，', '之', '后', '不', '管', '进', '什', '么', '牌', '都', '不', '会', '产', '生', '废', '牌', '。'
    ]
  },
  {
    id: 274,
    round: '东 1 局  东家   4 巡目',
    images1: [z0, z0, m4, z0, z0, z0, z0],
    images2: [m0, p4, p5, s1, s2, s3, s4, s0, s5, s5, s6, z1, z1, m7],
    answerImg: s1,
    explanation: [
      '坎', m6, '是', '瓶', '颈', '。',
      '双', '东', '或', '食', '断', '，', '反', '正', '都', '要', '考', '虑', '可', '以', '鸣', '牌', '的', '役', '。',
      '双', '东', '当', '然', '要', '碰', '，', '鸣', '不', '到', '的', '场', '合', '也', '可', '以', '转', '向', '断', '幺', '，', '这', '里', '打', s1, '。'
    ]
  },
  {
    id: 275,
    round: '东 1 局  东家   5 巡目',
    images1: [z0, z0, s9, z0, z0, z0, z0],
    images2: [m3, m3, m5, m6, m6, m7, m8, p3, p4, p5, p6, s2, s3, p0],
    answerImg: m6,
    explanation: [
      '考', '虑', '应', '对', '失', '张', '的', '一', '打', '。',
      '摸', '回', '失', '张', m4, '也', '可', '以', '打', m3, '，', '变', '成', '下', '面', '这', '样', '进', '张', '翻', '倍', '以', '上', '的', '一', '向', '听', '。'
    ]
  },
  {
    id: 276,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, z6, z0, z0, z0, z0],
    images2: [m1, m1, m9, m9, m9, p4, p5, p6, p7, p7, s2, s4, s6, s7],
    answerImg: s4,
    explanation: [
      '以', '前', '的', '何', '切', '中', '把', '拆', p7, '对', '子', '作', '为', '正', '解', '，', '本', '书', '推', '荐', '拆', '坎', '张', '。',
      '这', '样', '摸', p5, p6, '能', '看', '到', '一', '杯', '口', '，', '摸', '其', '他', '饼', '子', '的', '厚', '味', '也', '不', '同', '。',
      s2, s4, '先', '打', '哪', '个', '差', '别', '不', '大', '，', '不', '管', '怎', '么', '推', '进', '基', '本', '都', '是', '仅', '有', '立', '直', '的', '手', '牌', '，', '建', '议', '重', '视', '危', '险', '度', '从', '内', '侧', '打', '起', '。'
    ]
  },
  {
    id: 277,
    round: '东 1 局  西家   6 巡目',
    images1: [z0, z0, p9, z0, z0, z0, z0],
    images2: [m2, m2, m3, p1, p3, p3, p4, p5, p6, p6, p7, s7, s8, s9],
    answerImg: m2,
    explanation: [
      '如', '果', '打', m2, '，', '饼', '子', '是', '两', '面', '坎', '张', '亚', '种', '（', p2, p5, p8, '进', '张', '）', '，', '必', '定', '平', '和', '。',
      '也', '可', '以', '应', '对', '宝', '牌', p1, '的', '纵', '向', '进', '张', '。'
    ]
  },
  {
    id: 278,
    round: '东 1 局  南家   4 巡目',
    images1: [z0, z0, z5, z0, z0, z0, z0],
    images2: [m3, m5, p1, p3, p6, p8, s5, s7, s9, z3, z3, z6, z6, z6],
    answerImg: p8,
    explanation: [
      '面', '子', '超', '载', '。',
      '根', '据', '五', '搭', '子', '理', '论', '拆', '掉', '弱', '搭', '。',
      '在', m3, m5, '、', p1, p3, '、', p6, p8, '中', '选', '择', '。',
      '保', '留', '有', '两', '种', '两', '面', '变', '化', '的', m3, m5, '，', p1, p3, '和', p6, p8, '中', '，', '考', '虑', '“', '是', '否', '容', '易', '鸣', '出', '”', '和', '“', '作', '为', '最', '终', '听', '牌', '形', '是', '否', '容', '易', '和', '出', '”', '，', '留', '下', '靠', '边', '的', '，', '拆', '掉', p6, p8, '。',
      '从', '外', '侧', '的', p8, '打', '起', '。'
    ]
  },
  {
    id: 279,
    round: '东 1 局  北家   9 巡目',
    images1: [z0, z0, z5, z0, z0, z0, z0],
    images2: [m1, m2, m3, m6, m7, p6, p8, p8, s7, s7, s9, z6, z6, m8],
    answerImg: s7,
    explanation: [
      '现', '在', '三', '雀', '头', '。',
      '以', '门', '清', '为', '前', '提', '的', '话', '拆', '对', '子', '有', '利', '，', '以', '鸣', '牌', '为', '前', '提', '的', '话', '维', '持', '三', '雀', '头', '有', '利', '。',
      '因', '为', '有', '役', '牌', '对', '子', '，', '一', '般', '会', '以', '鸣', '牌', '为', '前', '提', '做', '牌', '，', '但', '这', '里', '已', '经', '第', '9', '巡', '了', '。',
      '应', '该', '考', '虑', '宝', '牌', '发', '对', '死', '的', '可', '能', '性', '而', '以', '门', '清', '为', '前', '提', '做', '牌', '。',
      '重', '视', '最', '终', '形', '，', '比', '起', '坎', p7, '，', '保', '留', '坎', s8, '更', '好', '。'
    ]
  },
  {
    id: 280,
    round: '东 1 局  东家   3 巡目',
    images1: [z0, z0, m7, z0, z0, z0, z0],
    images2: [m1, m3, m7, m8, p0, p6, p7, p7, p9, s2, s4, z1, z1, z1],
    answerImg: s2,
    explanation: [
      '双', '东', '宝', '牌', p2, '的', '满', '贯', '确', '定', '。',
      '留', '下', '容', '易', '鸣', '出', '和', '和', '出', '的', '靠', '边', '牌', '。',
      '因', '为', '面', '子', '超', '载', '，', '而', '且', '没', '雀', '头', '，', '不', '能', '打', p9, '，', '转', '为', '五', '搭', '子', '。'
    ]
  },
  {
    id: 281,
    round: '东 1 局  南家   5 巡目',
    images1: [z0, z0, m4, z0, z0, z0, z0],
    images2: [m4, m5, m7, m9, p4, p5, p6, p7, s3, s4, s5, s8, s8, s4],
    answerImg: m7,
    explanation: [
      p4, p5, p6, p7, '的', '四', '连', '形', '和', s3, s4, s4, s5, '的', '中', '膨', '形', '是', '两', '面', '种', '子', '界', '的', '双', '巨', '头', '。',
      '这', '里', '拆', m7, m9, '坎', '张', '退', '回', '两', '向', '听', '。',
      '好', '形', '已', '经', '凑', '齐', '了', '，', '重', '视', '危', '险', '度', '从', '内', '侧', '的', m7, '打', '起', '是', '正', '解', '。',
      '打', m9, '只', '有', '90', '分', '。'
    ]
  },
  {
    id: 282,
    round: '东 1 局  东家   6 巡目',
    images1: [z0, z0, s5, z0, z0, z0, z0],
    images2: [m2, m2, m7, m8, p2, p4, p7, p8, p9, p9, p9, s0, s6, p3],
    answerImg: m2,
    explanation: [
      '因', '为', '有', '平', '和', '所', '以', '从', m2, '和', p9, '中', '选', '择', '。',
      '顺', '利', '听', '牌', '的', '话', '两', '边', '都', '一', '样', '，', '但', '在', '搭', '子', m7, m8, '/', s0, s6, '纵', '向', '进', '张', '成', '为', '完', '全', '一', '向', '听', '时', '存', '在', '着', '差', '别', '。',
      '例', '如', '摸', m7, '的', '场', '合', '，', '打', p9, '时', '增', '加', m2, '/', m7, '四', '枚', '有', '效', '牌', '，', '而', '打', m2, '时', '增', '加', p6, p9, '/', m7, '七', '枚', '有', '效', '牌', '。',
      '留', '下', '连', '续', '的', '牌', '是', '正', '理', '。'
    ]
  },
  {
    id: 283,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, s1, z0, z0, z0, z0],
    images2: [m3, m4, m8, m8, p4, p5, p6, p8, p8, s4, s5, s8, s8, s9],
    answerImg: m8,
    explanation: [
      '拆', '哪', '个', '对', '子', '好', '，', '比', '较', '摸', '进', '各', '自', '内', '侧', '的', '牌', '时', '的', '形', '状', '。',
      '索', '子', '完', '成', '一', '个', '面', '子', '，', '饼', '子', '三', '面', '张', '。', '万', '子', '最', '弱', '。',
      '注', '意', '不', '要', '打', '一', '张', p8, '留', '一', '张', '备', '着', '三', '面', '张', '这', '种', '中', '途', '半', '端', '的', '拆', '对', '留', '孤', '打', '法', '。'
    ]
  },
  {
    id: 284,
    round: '东 1 局  西家   4 巡目',
    images1: [z0, z0, m6, z0, z0, z0, z0],
    images2: [m6, m7, p6, p6, p8, s2, s2, s3, s3, s4, s5, s7, s7, s8],
    answerImg: p8,
    explanation: [
      '现', '在', '两', '向', '听', '。', '不', '含', '七', '对', '的', '有', '效', '牌', '，', p6, '×', '31', '、', s2, '×', '31', '、', s5, '×', '31', '、', s7, '×', '31', '、', p8, '×', '29', '、', s8, '×', '29', '。',
      '因', '为', '也', '能', '看', '作', '三', '雀', '头', '形', '，', '拆', '对', '子', '进', '张', '最', '多', '，', '但', '在', '一', '向', '听', '时', '进', '张', '数', '会', '逆', '转', '。',
      '打', p8, '的', '话', '，', '之', '后', '不', '论', '怎', '么', '进', '张', '都', '不', '会', '产', '生', '废', '牌', '，', '形', '状', '也', '有', '厚', '度', '，', '期', '待', '值', '最', '大', '。'
    ]
  },
  {
    id: 285,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, p2, z0, z0, z0, z0],
    images2: [m5, m6, p2, p2, p3, p3, p4, p5, p5, p6, s4, s5, s6, s7],
    answerImg: s4,
    explanation: [
      '有', '宝', '牌', '2', '，', '不', '用', '去', '追', '求', '456', '/','567', '两', '个', '三', '色', '，', '直', '接', '固', '定', '索', '子', '的', '一', '个', '面', '子', '要', '最', '大', '的', '进', '张', '面', '。',
      s4, s7, '打', '哪', '边', '，', '要', '点', '在', '于', '摸', m4, m7, '/', p4, '时', '都', '会', '打', p6, '放', '弃', '三', '色', '找', '高', '目', '一', '杯', '口', '。',
      '也', '就', '是', '说', '差', '别', '只', '在', p2, '/', p3, '/', p7, '上', '。',
      '因', '此', '比', '较', '三', '枚', p2, p3, '和', '四', '枚', p7, '就', '能', '得', '出', '结', '论', '，', '不', '论', '是', '打', '点', '的', '平', '衡', '上', '，', '还', '是', '枚', '数', '上', '，', '都', '是', '狙', '击', '567', '三', '色', '更', '有', '利', '。'
    ]
  },
  {
    id: 286,
    round: '东 1 局  西家   5 巡目',
    images1: [z0, z0, p8, z0, z0, z0, z0],
    images2: [m5, m6, m6, m6, m7, p2, p2, p3, s6, s6, s6, s7, s7, s8],
    answerImg: s6,
    explanation: [
      '留', '下', s6, '摸', s9, '最', '不', '爽', '。', '拒', '绝', '这', '个', '进', '张', '打', s6, '是', '均', '衡', '的', '一', '打', '。',
      '比', '起', '遥', '远', '的', '四', '暗', '刻', '，', '能', '看', '到', '眼', '下', '的', '断', '幺', '、', '赤', '牌', '进', '张', '、', '一', '杯', '口', '更', '容', '易', '出', '高', '打', '点', '。'
    ]
  },
  {
    id: 287,
    round: '东 1 局  西家   6 巡目',
    images1: [z0, z0, p9, z0, z0, z0, z0],
    images2: [p1, p1, p2, p3, p3, p4, p5, p5, p6, s5, s6, s7, s8, s9],
    answerImg: p5,
    explanation: [
      '进', '张', '数', '上', '打', p1, '或', p5, '。', '宝', '牌', '是', p1, '，', '所', '以', '打', p5, '比', '较', '好', '。',
      '虽', '然', '索', '子', '出', '雀', '头', '时', '会', '变', '成', '坎', '张', '听', '牌', '，', '但', '成', '为', p1, p4, p7, '三', '面', '听', '的', '可', '能', '性', '也', '很', '高', '。'
    ]
  },
  {
    id: 288,
    round: '东 1 局  西家   8 巡目',
    images1: [z0, z0, p6, z0, z0, z0, z0],
    images2: [m5, m5, m7, p5, p6, p7, p7, p8, p8, s5, s6, s6, s7, m6],
    answerImg: m5,
    explanation: [
      '好', '形', '一', '向', '听', '。', '不', '要', '单', '纯', '看', '进', '张', '数', '，', '而', '看', '可', '以', '好', '形', '听', '牌', '的', '枚', '数', '来', '选', '择', '打', '牌', '比', '较', '好', '。',
      '虽', '然', '容', '易', '丢', '掉', '三', '色', '，', '但', '就', '算', '打', '掉', '宝', '牌', '也', '有', '立', '断', '平', '，', '亲', '家', '满', '贯', '起', '步', '。',
      '最', '差', '的', '进', '张', '是', p9, '，', '不', '过', '这', '样', '也', '确', '定', '有', '三', '色', '。',
      '这', '里', '也', '证', '明', '了', '拆', '亚', '两','面','基','本','是','正','解','。'
    ]
  },
  {
    id: 289,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, s4, z0, z0, z0, z0],
    images2: [m3, m3, m4, m5, p5, p6, p7, p8, s1, s1, s2, s2, s3, s4],
    answerImg: s2,
    explanation: [
      '注', '意', '到', '是', '靠', '张', '听', '牌', '问', '题', '就', '很', '简', '单', '。',
      '老', '实', '要', '最', '大', '进', '张', '就', '行', '。', '这', '里', '固', '定', s1, '雀', '头', '打', s2, '是', '正', '解', '。'
    ]
  },
  {
    id: 290,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, p7, z0, z0, z0, z0],
    images2: [m2, m2, m3, p3, p3, p6, p7, p8, s6, s7, s7, s8, s8, s8],
    answerImg: m2,
    explanation: [
      '打', m2, '进', '张', '最', '多', '。', '索', '子', '是', '进', s5, '-', s9, '都', '能', '听', '牌', '的', '优', '秀', '形', '状', '，', '不', '要', '去', '动', '。',
      '保', '留', '复', '杂', '的', '形', '状', '，', '固', '定', '两', '面', '，', '基', '本', '都', '是', '正', '解', '。'
    ]
  },
  {
    id: 291,
    round: '东 1 局  西家   4 巡目',
    images1: [z0, z0, z3, z0, z0, z0, z0],
    images2: [m3, m3, m5, m7, m9, p1, p1, p3, p5, s6, s7, z4, z4, m8],
    answerImg: p1,
    explanation: [
      '三', '雀', '头', '两', '向', '听', '，', '以', '门', '清', '为', '前', '提', '。',
      '根', '据', '三', '雀', '头', '最', '弱', '理', '论', '，', '拆', '对', '子', '的', '瞬', '间', '进', '张', '多', '两', '枚', '。',
      '进', '张', '多', '+', '一', '向', '听', '时', '无', '废', '牌', '的', '打', p1, '是', '正', '解', '。',
      '这', '个', '问', '题', '用', '五', '搭', '子', '理', '论', '也', '能', '解', '答', '。', '饼', '子', '拆', '解', '为', p1, p1, '和', p3, p5, '的', '话', '就', '是', '六', '搭', '子', '了', '。',
      '打', p1, '或', p5, '就', '能', '变', '为', '无', '废', '牌', '的', '五', '搭', '子', '，', '所', '以', '是', p1, '和', p5, '的', '二', '择', '，', '再', '根', '据', '进', '张', '数', '就', '可', '以', '得', '出', '打', p1, '的', '答', '案', '。'
    ]
  },
  {
    id: 292,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, m3, z0, z0, z0, z0],
    images2: [m3, m4, m4, m5, m6, m7, m8, m8, p6, p7, p8, s3, s4, m7],
    answerImg: m8,
    explanation: [
      '万', '子', '是', '翼', '-', '八', '枚', '形', '。', '虽', '然', '不', '能', '碰', '宝', '牌', '听', '牌', '（', '可', '以', '吃', '听', '）', '，', '但', '26', '枚', '进', '张', '全', '部', '可', '以', '听', '两', '面', '。'
    ]
  },
  {
    id: 293,
    round: '东 1 局  西家   3 巡目',
    images1: [z0, z0, s8, z0, z0, z0, z0],
    images2: [m4, m5, m6, m7, m9, m9, p6, p8, s4, s4, s8, s9, s9, s6],
    answerImg: s4,
    explanation: [
      '三', '雀', '头', '。', '宝', '牌', s9, '对', '子', '，', '所', '以', '以', '门', '清', '为', '前', '提', '做', '牌', '。',
      '把', '宝', '牌', s9, '对', '子', '抽', '出', '来', '，', '能', '看', '出', s4, s4, s6, s8, '是', '四', '枚', '构', '成', '。', '把', '它', '们', '变', '成', '三', '枚', '构', '成', '吧', '。',
      '三', '色', '也', '能', '进', '入', '视', '野', '，', '选', '择', '两', '坎', '比', '较', '好', '。'
    ]
  },
  {
    id: 294,
    round: '东 1 局  西家   6 巡目',
    images1: [z0, z0, p7, z0, z0, z0, z0],
    images2: [p4, p4, p4, p0, p7, p8, s2, s2, s3, s3, s4, s5, s6, s7],
    answerImg: s3,
    explanation: [
      '打', '掉', '红', p5, '或', '者', p8, '进', '张', '最', '多', '，', '但', '是', '打', '点', '一', '下', '子', '降', '低', '的', '可', '能', '性', '很', '高', '。',
      '这', '里', '打', s3, '是', '正', '解', '，', '期', '待', '值', '、', '和', '率', '同', '时', '最', '大', '。',
      '看', '上', '去', p6, '进', '张', '重', '复', '，', '估', '计', '很', '多', '人', '比', '较', '抵', '触', '同', '时', '留', '下', '红', p5, '和', p8, '，', '不', '过', p4, p4, p4, p5, p7, p8, '的', '形', '状', '进', '张', '有', '15', '枚', '，', '推', '进', '一', '手', '之', '后', '必', '定', '能', '留', '下', '两', '面', '以', '上', '的', '听', '牌', '。',
      '而', '且', '摸', '到', p6, '有', '五', '面', '听', '，', '比', '起', '单', '纯', '的', '二', '度', '受', '是', '完', '全', '不', '同', '等', '级', '的', '超', '好', '形', '。'
    ]
  },
  {
    id: 295,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, p3, z0, z0, z0, z0],
    images2: [m1, m2, m3, m4, m5, m7, m7, p4, p6, p7, s7, s8, s8, p3],
    answerImg: m1,
    explanation: [
      '面', '子', '超', '载', '。', '打', m1, '进', '张', '最', '多', '。',
      '保', '留', '了', m6, '进', '张', '，', '也', '容', '易', '有', '断', '幺', '。',
      '请', '仔', '细', '品', '味', '和', '打', s8, '这', '种', '昭', '和', '风', '六', '搭', '子', '打', '法', '的', '区', '别', '。'
    ]
  },
  {
    id: 296,
    round: '东 1 局  北家   5 巡目',
    images1: [z0, z0, s7, z0, z0, z0, z0],
    images2: [m7, m9, m9, p6, p7, s1, s2, s2, s4, s5, s6, s8, s9, s2],
    answerImg: s1,
    explanation: [
      '维', '持', '一', '向', '听', '的', '打', '牌', '选', '择', '只', '有', m7, '或', s1, '。',
      '打', m7, '虽', '然', '能', '保', '留', '一', '气', '的', '可', '能', '，', '但', '一', '气', '不', '仅', '不', '安', '定', '，', '先', '进', s7, '的', '时', '候', '就', '即', '立', '了', '，', '也', '不', '存', '在', '一', '气', '。',
      '比', '起', '这', '样', '，', '不', '如', '优', '先', '摸', '宝', '牌', s8, '或', '摸', m8, '完', '成', '面', '子', '更', '好', '。'
    ]
  },
  {
    id: 297,
    round: '东 1 局  西家   5 巡目',
    images1: [z0, z0, m1, z0, z0, z0, z0],
    images2: [m5, m5, m7, p6, p6, p7, p8, p8, s3, s3, s6, s6, s7, p8],
    answerImg: m7,
    explanation: [
      '七', '对', '一', '向', '听', '。', '单', '纯', '进', '张', '面', '上', '摸', '切', '最', '广', '，', '但', '能', '看', '到', '遥', '远', '的', '567', '三', '色', '或', '四', '暗', '刻', '。',
      '不', '管', '打', '什', '么', '都', '有', '损', '失', '的', '形', '状', '，', '应', '该', '狙', '击', '什', '么', '而', '切', '牌', '呢', '？',
      '如', '果', '觉', '得', '这', '里', '最', '痛', '的', '是', '错', '过', '役', '满', '四', '暗', '刻', '，', '那', '就', '维', '持', '七', '对', '一', '向', '听', '，', '向', '对', '对', '系', '前', '进', '比', '较', '好', '。'
    ]
  },
  {
    id: 298,
    round: '东 1 局  西家   7 巡目',
    images1: [z0, z0, m9, z0, z0, z0, z0],
    images2: [m1, m3, m5, m6, m7, p4, p4, p6, s3, s4, s6, s6, s8, m1],
    answerImg: m3,
    explanation: [
      '虽', '想', '使', '用', '三', '雀', '头', '最', '弱', '理', '论', '拆', '个', '对', '子', '，', '但', '还', '是', '固', '定', '宝', '牌', '对', '子', '。',
      '比', '起', '拆', '对', '子', '进', '张', '少', '两', '张', '，', '不', '过', '就', '这', '样', '推', '进', '向', '听', '后', '进', '张', '数', '会', '逆', '转', '。'
    ]
  },
  {
    id: 299,
    round: '东 1 局  东家   7 巡目',
    images1: [z0, z0, m2, z0, z0, z0, z0],
    images2: [m3, m5, m6, m7, m7, m8, p3, p4, p6, p6, p6, s3, s4, s5],
    answerImg: m7,
    explanation: [
      '打', '宝', '牌', '进', '张', '最', '多', '，', '但', '完', '全', '能', '看', '到', '亲', '家', '满', '贯', '的', '牌', '最', '坏', '情', '况', '下', '会', '变', '成', '仅', '有', '立', '直', '的', '小', '牌', '。',
      '这', '里', '打', m7, '是', '正', '解', '。', '最', '高', '形', '断', '平', '三', '色', '，', '宝', '牌', '成', '对', '也', '有', '断', '幺', '宝', '牌', '2', '的', '听', '牌', '。',
      '打', p6, '的', '进', '张', '少', '太', '多', '了', '。'
    ]
  },
  {
    id: 300,
    round: '东 1 局  西家   4 巡目',
    images1: [z0, z0, z2, z0, z0, z0, z0],
    images2: [m1, m2, m2, p4, p6, p8, p8, p9, p9, s4, s0, z5, z5, p3],
    answerImg: p6,
    explanation: [
      '四', '雀', '头', '的', '七', '对', '两', '向', '听', '。', '面', '子', '手', '则', '是', '三', '向', '听', '的', '面', '子', '超', '载', '。',
      '这', '里', '能', '保', '留', '较', '强', '的', '五', '搭', '的', '话', '就', '是', '正', '解', '。',
      '首', '先', '，', p3, p4, '、', s4, s5, '和', '白', '白', '是', '强', '搭', '，', '确', '定', '为', '面', '子', '候', '补', '。',
      '剩', '下', '的', m1, m2, m2, '和', p6, p8, p9, p9, '中', '能', '做', '出', '两', '个', '搭', '子', '就', '好', '。',
      '这', '里', '打', p6, '是', '正', '解', '。', '先', '做', '个', p8, p8, p9, p9, '的', '连', '对', '形', '，', '之', '后', '没', '有', '特', '殊', '情', '况', '就', '打', '掉', '一', '枚', p8, '变', '为', p8, p9, p9, '三', '枚', '构', '成', '。'
    ]
  }
]